
import IdealArithmetic.Examples.NF3_1_795800_1.RI3_1_795800_1
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp37 : Fact (Nat.Prime 37) := {out := by norm_num}

def I37N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, 0, 0]] i)))

def SI37N0: IdealEqSpanCertificate' Table ![![37, 0, 0]] 
 ![![37, 0, 0], ![0, 37, 0], ![0, 0, 37]] where
  M :=![![![37, 0, 0], ![0, 37, 0], ![0, 0, 37]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P37P0 : CertificateIrreducibleZModOfList' 37 3 2 5 [22, 33, 25, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [7, 31, 25], [5, 5, 12], [0, 1]]
 g := ![![[35, 2, 21], [32, 27], [10], [12, 1], []], ![[3, 12, 14, 36], [], [35, 24, 5, 36], [36, 25], [22, 33]], ![[3, 20, 21, 34], [18, 27], [13, 20, 4, 1], [19, 36], [35, 33]]]
 h' := ![![[7, 31, 25], [3, 16, 13], [2, 28, 8], [32, 26], [0, 0, 1], [0, 1]], ![[5, 5, 12], [10, 27, 21], [11, 13], [29, 29, 21], [9, 18, 5], [7, 31, 25]], ![[0, 1], [18, 31, 3], [28, 33, 29], [14, 19, 16], [32, 19, 31], [5, 5, 12]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [5, 5], []]
 b := ![[], [32, 35, 22], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI37N0 : CertifiedPrimeIdeal' SI37N0 37 where
  n := 3
  hpos := by decide
  P := [22, 33, 25, 1]
  hirr := P37P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-1194952, 58312, 17131]
  a := ![0, -2, -5]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-32296, 1576, 463]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI37N0 : Ideal.IsPrime I37N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI37N0 B_one_repr
lemma NI37N0 : Nat.card (O ⧸ I37N0) = 50653 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI37N0

def PBC37 : ContainsPrimesAboveP 37 ![I37N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI37N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![37, 0, 0]]) timesTableT_eq_Table B_one_repr 37 (by decide) 𝕀

instance hp41 : Fact (Nat.Prime 41) := {out := by norm_num}

def I41N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![41, 0, 0]] i)))

def SI41N0: IdealEqSpanCertificate' Table ![![41, 0, 0]] 
 ![![41, 0, 0], ![0, 41, 0], ![0, 0, 41]] where
  M :=![![![41, 0, 0], ![0, 41, 0], ![0, 0, 41]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P41P0 : CertificateIrreducibleZModOfList' 41 3 2 5 [34, 26, 24, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [19, 33, 3], [39, 7, 38], [0, 1]]
 g := ![![[32, 9, 39], [26, 9], [30, 37], [17, 17, 1], []], ![[31, 16, 8, 3], [19, 33], [38, 37], [37, 12, 38, 24], [23, 9]], ![[0, 6, 8, 28], [35, 33], [13, 25], [16, 8, 23, 13], [29, 9]]]
 h' := ![![[19, 33, 3], [8, 15, 11], [21, 13, 3], [37, 5, 18], [0, 0, 1], [0, 1]], ![[39, 7, 38], [8, 40, 40], [30, 3, 19], [16, 28, 18], [30, 22, 7], [19, 33, 3]], ![[0, 1], [0, 27, 31], [1, 25, 19], [22, 8, 5], [2, 19, 33], [39, 7, 38]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [34, 35], []]
 b := ![[], [32, 29, 2], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI41N0 : CertifiedPrimeIdeal' SI41N0 41 where
  n := 3
  hpos := by decide
  P := [34, 26, 24, 1]
  hirr := P41P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![1220119, -115989, 2091]
  a := ![-1, 1, 5]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![29759, -2829, 51]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI41N0 : Ideal.IsPrime I41N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI41N0 B_one_repr
lemma NI41N0 : Nat.card (O ⧸ I41N0) = 68921 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI41N0

def PBC41 : ContainsPrimesAboveP 41 ![I41N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI41N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![41, 0, 0]]) timesTableT_eq_Table B_one_repr 41 (by decide) 𝕀

instance hp43 : Fact (Nat.Prime 43) := {out := by norm_num}

def I43N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![43, 0, 0]] i)))

def SI43N0: IdealEqSpanCertificate' Table ![![43, 0, 0]] 
 ![![43, 0, 0], ![0, 43, 0], ![0, 0, 43]] where
  M :=![![![43, 0, 0], ![0, 43, 0], ![0, 0, 43]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P43P0 : CertificateIrreducibleZModOfList' 43 3 2 5 [13, 42, 32, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [34, 31, 29], [20, 11, 14], [0, 1]]
 g := ![![[4, 3, 21], [8, 10, 40], [30, 6], [36, 11, 1], []], ![[41, 24, 10, 7], [10, 42, 21, 8], [20, 41], [29, 37, 36, 26], [41, 24]], ![[37, 32, 11, 15], [14, 24, 27, 15], [8, 38], [7, 32, 34, 38], [13, 24]]]
 h' := ![![[34, 31, 29], [25, 18, 8], [22, 0, 30], [5, 22, 7], [0, 0, 1], [0, 1]], ![[20, 11, 14], [31, 32, 8], [7, 27, 29], [40, 39, 27], [21, 31, 11], [34, 31, 29]], ![[0, 1], [40, 36, 27], [29, 16, 27], [41, 25, 9], [16, 12, 31], [20, 11, 14]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [17], []]
 b := ![[], [34, 35], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI43N0 : CertifiedPrimeIdeal' SI43N0 43 where
  n := 3
  hpos := by decide
  P := [13, 42, 32, 1]
  hirr := P43P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-153467, 9976, -9288]
  a := ![-64, 0, -1]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-3569, 232, -216]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI43N0 : Ideal.IsPrime I43N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI43N0 B_one_repr
lemma NI43N0 : Nat.card (O ⧸ I43N0) = 79507 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI43N0

def PBC43 : ContainsPrimesAboveP 43 ![I43N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI43N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![43, 0, 0]]) timesTableT_eq_Table B_one_repr 43 (by decide) 𝕀

instance hp47 : Fact (Nat.Prime 47) := {out := by norm_num}

def I47N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![47, 0, 0]] i)))

def SI47N0: IdealEqSpanCertificate' Table ![![47, 0, 0]] 
 ![![47, 0, 0], ![0, 47, 0], ![0, 0, 47]] where
  M :=![![![47, 0, 0], ![0, 47, 0], ![0, 0, 47]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P47P0 : CertificateIrreducibleZModOfList' 47 3 2 5 [40, 10, 36, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [44, 10, 14], [14, 36, 33], [0, 1]]
 g := ![![[13, 39, 27], [45, 45, 27], [41, 46, 6], [17, 11, 1], []], ![[14, 33, 33, 12], [39, 4, 24, 8], [25, 23, 8, 4], [30, 23, 8, 2], [39, 8]], ![[46, 4, 9, 26], [23, 6, 29, 29], [28, 24, 0, 40], [5, 43, 33, 10], [20, 8]]]
 h' := ![![[44, 10, 14], [33, 31, 11], [5, 20, 36], [25, 1, 37], [0, 0, 1], [0, 1]], ![[14, 36, 33], [34, 18, 31], [39, 22, 25], [22, 2, 30], [0, 29, 36], [44, 10, 14]], ![[0, 1], [27, 45, 5], [20, 5, 33], [16, 44, 27], [7, 18, 10], [14, 36, 33]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [10, 23], []]
 b := ![[], [39, 34, 42], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI47N0 : CertifiedPrimeIdeal' SI47N0 47 where
  n := 3
  hpos := by decide
  P := [40, 10, 36, 1]
  hirr := P47P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-3348891, 137804, 28717]
  a := ![1, -2, -7]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-71253, 2932, 611]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI47N0 : Ideal.IsPrime I47N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI47N0 B_one_repr
lemma NI47N0 : Nat.card (O ⧸ I47N0) = 103823 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI47N0

def PBC47 : ContainsPrimesAboveP 47 ![I47N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI47N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![47, 0, 0]]) timesTableT_eq_Table B_one_repr 47 (by decide) 𝕀

instance hp53 : Fact (Nat.Prime 53) := {out := by norm_num}

def I53N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-83139963690856231592829822123, 11364158829559278008124290194, -4036078141793952501433633166]] i)))

def SI53N0: IdealEqSpanCertificate' Table ![![-83139963690856231592829822123, 11364158829559278008124290194, -4036078141793952501433633166]] 
 ![![53, 0, 0], ![0, 53, 0], ![2, 24, 1]] where
  M :=![![![-83139963690856231592829822123, 11364158829559278008124290194, -4036078141793952501433633166], ![702277596672147735249452170884, -95992273712060668593307330925, 34092476488677834024372870582], ![-2211456168567363618496777217384, 302277485201404913131896464792, -107356432541619946601431621119]]]
  hmulB := by decide  
  f := ![![![338841301580073, -10253106651238, -15994791626686]], ![![2783093743043364, 232619445168719, -30759319953714]], ![![1289212737342802, 121293202739380, -9949824723067]]]
  g := ![![![-1416373724665440124338916147, 2042076117596493170613801626, -4036078141793952501433633166], ![11964012145184755984918989240, -17249277536609975192042570281, 34092476488677834024372870582], ![-37674401952530636326300263682, 54317582381137427010684063616, -107356432541619946601431621119]]]
  hle1 := by decide   
  hle2 := by decide  


def P53P0 : CertificateIrreducibleZModOfList' 53 2 2 5 [23, 37, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [16, 52], [0, 1]]
 g := ![![[50, 52], [47], [46, 40], [17], [16, 1]], ![[34, 1], [47], [50, 13], [17], [32, 52]]]
 h' := ![![[16, 52], [36, 23], [2, 43], [42, 27], [3, 21], [0, 1]], ![[0, 1], [33, 30], [1, 10], [50, 26], [21, 32], [16, 52]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [31]]
 b := ![[], [35, 42]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI53N0 : CertifiedPrimeIdeal' SI53N0 53 where
  n := 2
  hpos := by decide
  P := [23, 37, 1]
  hirr := P53P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-2007, -1400, -23]
  a := ![0, -2, -5]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-37, -16, -23]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI53N0 : Ideal.IsPrime I53N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI53N0 B_one_repr
lemma NI53N0 : Nat.card (O ⧸ I53N0) = 2809 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI53N0

def I53N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-338841301580073, 10253106651238, 15994791626686]] i)))

def SI53N1: IdealEqSpanCertificate' Table ![![-338841301580073, 10253106651238, 15994791626686]] 
 ![![53, 0, 0], ![34, 1, 0], ![45, 0, 1]] where
  M :=![![![-338841301580073, 10253106651238, 15994791626686], ![-2783093743043364, -232619445168719, 30759319953714], ![-856342642967624, -866179274440360, -242872551819957]]]
  hmulB := by decide  
  f := ![![![83139963690856231592829822123, -11364158829559278008124290194, 4036078141793952501433633166]], ![![40084550355037059224655882666, -5479040122508580824206010107, 1945927930798425491025861454]], ![![112316123295394227173096588923, -15352162877954196669763953274, 5452451866459392625772549313]]]
  g := ![![![-26551180206095, 10253106651238, 15994791626686], ![70599962165584, -232619445168719, 30759319953714], ![745717311696277, -866179274440360, -242872551819957]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI53N1 : Nat.card (O ⧸ I53N1) = 53 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI53N1)

lemma isPrimeI53N1 : Ideal.IsPrime I53N1 := prime_ideal_of_norm_prime hp53.out _ NI53N1
def MulI53N0 : IdealMulLeCertificate' Table 
  ![![-83139963690856231592829822123, 11364158829559278008124290194, -4036078141793952501433633166]] ![![-338841301580073, 10253106651238, 15994791626686]]
  ![![53, 0, 0]] where
 M := ![![![-53, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0]]]]
 hle2 := by decide  


def PBC53 : ContainsPrimesAboveP 53 ![I53N0, I53N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI53N0
    exact isPrimeI53N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 53 (by decide) (𝕀 ⊙ MulI53N0)
instance hp59 : Fact (Nat.Prime 59) := {out := by norm_num}

def I59N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1663990008336481552017498204333, 227445934615138115592292678496, -80779367739236068792174721947]] i)))

def SI59N0: IdealEqSpanCertificate' Table ![![-1663990008336481552017498204333, 227445934615138115592292678496, -80779367739236068792174721947]] 
 ![![59, 0, 0], ![18, 1, 0], ![4, 0, 1]] where
  M :=![![![-1663990008336481552017498204333, 227445934615138115592292678496, -80779367739236068792174721947], ![14055609986627075969838401618778, -1921220280156759849178253857519, 682337803845414346776878035488], ![-44260795951909724103005059931230, 6049878936566520683499889943902, -2148666214771897964770546536015]]]
  hmulB := by decide  
  f := ![![![-11518784526852609, -1139470601816246, 71195917803445]], ![![-3724173070866888, -554941533127807, -36218394660792]], ![![2649527285444342, -263119817809530, -183166531335901]]]
  g := ![![![-92116938312746158601865551347, 227445934615138115592292678496, -80779367739236068792174721947], ![778105488374018574032872184952, -1921220280156759849178253857519, 682337803845414346776878035488], ![-2450236473746093297405438860634, 6049878936566520683499889943902, -2148666214771897964770546536015]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI59N0 : Nat.card (O ⧸ I59N0) = 59 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI59N0)

lemma isPrimeI59N0 : Ideal.IsPrime I59N0 := prime_ideal_of_norm_prime hp59.out _ NI59N0

def I59N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-135558696830829134613213819, 18529122375393125547411848, -6580776186568814979500224]] i)))

def SI59N1: IdealEqSpanCertificate' Table ![![-135558696830829134613213819, 18529122375393125547411848, -6580776186568814979500224]] 
 ![![59, 0, 0], ![48, 1, 0], ![42, 0, 1]] where
  M :=![![![-135558696830829134613213819, 18529122375393125547411848, -6580776186568814979500224], ![1145055056462973806433038976, -156514231574848898942803315, 55587367126179376642235544], ![-3605752312139395114060674544, 492859753073350022095484080, -175043353950242024490215163]]]
  hmulB := by decide  
  f := ![![![112903322474175, 8410452982696, -1573761882752]], ![![96494814345072, 8738524531013, -852698498712]], ![![54021059927570, 8389490379136, 633266984781]]]
  g := ![![![-12687524932437439521185985, 18529122375393125547411848, -6580776186568814979500224], ![107170656826376053164639072, -156514231574848898942803315, 55587367126179376642235544], ![-337477959216102222814489382, 492859753073350022095484080, -175043353950242024490215163]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI59N1 : Nat.card (O ⧸ I59N1) = 59 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI59N1)

lemma isPrimeI59N1 : Ideal.IsPrime I59N1 := prime_ideal_of_norm_prime hp59.out _ NI59N1

def I59N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![29207179048982952688471140637, 3631538475261605255986648182, 55196349228776594987750655]] i)))

def SI59N2: IdealEqSpanCertificate' Table ![![29207179048982952688471140637, 3631538475261605255986648182, 55196349228776594987750655]] 
 ![![59, 0, 0], ![51, 1, 0], ![1, 0, 1]] where
  M :=![![![29207179048982952688471140637, 3631538475261605255986648182, 55196349228776594987750655], ![-9604164765807127527868613970, 33169895619617217514384292749, 10894615425784815767959944546], ![-628686306440250272032387245678, 18587842596300589026630351102, 29538357144355612258397644567]]]
  hmulB := by decide  
  f := ![![![-777276826571533687895474437930149918856160396071347354991, 106243699414390987722557497615062032411514701498232255384, -37733357949413695229183733011261838521079128374595214777]], ![![-560601930033054832420190284584374338288074777329816063277, 76627040597971449191566322711618724329086937484562010785, -27214748426727550737638947300494367243059176993384054025]], ![![-363596869249856947032426026061086952418344201737123427947, 49698994185876800633060321999298658662765972139222851606, -17651022579956433127114585915406487940740920249042607770]]]
  g := ![![![-2645025076925215117997214700, 3631538475261605255986648182, 55196349228776594987750655], ![-29019719606645254856430974385, 33169895619617217514384292749, 10894615425784815767959944546], ![-27223807389761625841507335533, 18587842596300589026630351102, 29538357144355612258397644567]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI59N2 : Nat.card (O ⧸ I59N2) = 59 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI59N2)

lemma isPrimeI59N2 : Ideal.IsPrime I59N2 := prime_ideal_of_norm_prime hp59.out _ NI59N2
def MulI59N0 : IdealMulLeCertificate' Table 
  ![![-1663990008336481552017498204333, 227445934615138115592292678496, -80779367739236068792174721947]] ![![-135558696830829134613213819, 18529122375393125547411848, -6580776186568814979500224]]
  ![![777276826571533687895474437930149918856160396071347354991, -106243699414390987722557497615062032411514701498232255384, 37733357949413695229183733011261838521079128374595214777]] where
 M := ![![![777276826571533687895474437930149918856160396071347354991, -106243699414390987722557497615062032411514701498232255384, 37733357949413695229183733011261838521079128374595214777]]]
 hmul := by decide  
 g := ![![![![1, 0, 0]]]]
 hle2 := by decide  

def MulI59N1 : IdealMulLeCertificate' Table 
  ![![777276826571533687895474437930149918856160396071347354991, -106243699414390987722557497615062032411514701498232255384, 37733357949413695229183733011261838521079128374595214777]] ![![29207179048982952688471140637, 3631538475261605255986648182, 55196349228776594987750655]]
  ![![59, 0, 0]] where
 M := ![![![-59, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0]]]]
 hle2 := by decide  


def PBC59 : ContainsPrimesAboveP 59 ![I59N0, I59N1, I59N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI59N0
    exact isPrimeI59N1
    exact isPrimeI59N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 59 (by decide) (𝕀 ⊙ MulI59N0 ⊙ MulI59N1)
instance hp61 : Fact (Nat.Prime 61) := {out := by norm_num}

def I61N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![1062271967, 626834162, 159123360]] i)))

def SI61N0: IdealEqSpanCertificate' Table ![![1062271967, 626834162, 159123360]] 
 ![![61, 0, 0], ![0, 61, 0], ![38, 37, 1]] where
  M :=![![![1062271967, 626834162, 159123360], ![-27687464640, 2643846289, 1880502486], ![-99839989308, -5468149908, 2017012127]]]
  hmulB := by decide  
  f := ![![![255992451191010131, -34990860536336614, 12427303198713372]], ![![-2162350756576126728, 295565409846953749, -104972581609009842]], ![![-1040492975888694386, 142221946151034461, -50511339796704355]]]
  g := ![![![-81711733, -86241478, 159123360], ![-1625353428, -1097290913, 1880502486], ![-2893220494, -1313075387, 2017012127]]]
  hle1 := by decide   
  hle2 := by decide  


def P61P0 : CertificateIrreducibleZModOfList' 61 2 2 5 [43, 33, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [28, 60], [0, 1]]
 g := ![![[49, 46], [60], [4, 14], [55, 20], [28, 1]], ![[56, 15], [60], [30, 47], [5, 41], [56, 60]]]
 h' := ![![[28, 60], [42, 31], [11, 11], [14, 21], [16, 9], [0, 1]], ![[0, 1], [56, 30], [14, 50], [53, 40], [24, 52], [28, 60]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [59]]
 b := ![[], [14, 60]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI61N0 : CertifiedPrimeIdeal' SI61N0 61 where
  n := 2
  hpos := by decide
  P := [43, 33, 1]
  hirr := P61P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-187785, -86558, 12721]
  a := ![1, 20, 41]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-11003, -9135, 12721]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI61N0 : Ideal.IsPrime I61N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI61N0 B_one_repr
lemma NI61N0 : Nat.card (O ⧸ I61N0) = 3721 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI61N0

def I61N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![255992451191010131, -34990860536336614, 12427303198713372]] i)))

def SI61N1: IdealEqSpanCertificate' Table ![![255992451191010131, -34990860536336614, 12427303198713372]] 
 ![![61, 0, 0], ![11, 1, 0], ![17, 0, 1]] where
  M :=![![![255992451191010131, -34990860536336614, 12427303198713372], ![-2162350756576126728, 295565409846953749, -104972581609009842], ![6809193318847946412, -930728748743395260, 330556270383290363]]]
  hmulB := by decide  
  f := ![![![1062271967, 626834162, 159123360]], ![![-262335623, 156377411, 59522286]], ![![-1340678129, 85049686, 77411627]]]
  g := ![![![7043078077255501, -34990860536336614, 12427303198713372], ![-59492399631794273, 295565409846953749, -104972581609009842], ![187340212434579641, -930728748743395260, 330556270383290363]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI61N1 : Nat.card (O ⧸ I61N1) = 61 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI61N1)

lemma isPrimeI61N1 : Ideal.IsPrime I61N1 := prime_ideal_of_norm_prime hp61.out _ NI61N1
def MulI61N0 : IdealMulLeCertificate' Table 
  ![![1062271967, 626834162, 159123360]] ![![255992451191010131, -34990860536336614, 12427303198713372]]
  ![![61, 0, 0]] where
 M := ![![![61, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0]]]]
 hle2 := by decide  


def PBC61 : ContainsPrimesAboveP 61 ![I61N0, I61N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI61N0
    exact isPrimeI61N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 61 (by decide) (𝕀 ⊙ MulI61N0)
instance hp67 : Fact (Nat.Prime 67) := {out := by norm_num}

def I67N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![67, 0, 0]] i)))

def SI67N0: IdealEqSpanCertificate' Table ![![67, 0, 0]] 
 ![![67, 0, 0], ![0, 67, 0], ![0, 0, 67]] where
  M :=![![![67, 0, 0], ![0, 67, 0], ![0, 0, 67]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P67P0 : CertificateIrreducibleZModOfList' 67 3 2 6 [8, 11, 32, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [30, 57, 58], [5, 9, 9], [0, 1]]
 g := ![![[13, 21, 36], [49, 20, 21], [58, 62], [39, 64], [35, 1], []], ![[55, 57, 11, 43], [15, 1, 2, 3], [25, 65], [51, 14], [2, 14], [0, 14]], ![[36, 54, 19, 9], [34, 58, 41, 64], [35, 17], [65, 1], [47, 33], [49, 14]]]
 h' := ![![[30, 57, 58], [10, 53, 61], [22, 23, 50], [33, 49, 14], [55, 9, 8], [0, 0, 1], [0, 1]], ![[5, 9, 9], [19, 57, 5], [18, 15, 42], [33, 61, 20], [21, 43, 58], [29, 25, 9], [30, 57, 58]], ![[0, 1], [65, 24, 1], [11, 29, 42], [31, 24, 33], [45, 15, 1], [35, 42, 57], [5, 9, 9]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [45, 57], []]
 b := ![[], [26, 56, 51], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI67N0 : CertifiedPrimeIdeal' SI67N0 67 where
  n := 3
  hpos := by decide
  P := [8, 11, 32, 1]
  hirr := P67P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![175942, -35778, -4422]
  a := ![-1, 2, 3]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![2626, -534, -66]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI67N0 : Ideal.IsPrime I67N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI67N0 B_one_repr
lemma NI67N0 : Nat.card (O ⧸ I67N0) = 300763 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI67N0

def PBC67 : ContainsPrimesAboveP 67 ![I67N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI67N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![67, 0, 0]]) timesTableT_eq_Table B_one_repr 67 (by decide) 𝕀

instance hp71 : Fact (Nat.Prime 71) := {out := by norm_num}

def I71N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-684408522258202843047961422964778747930041599495587698876560945829875, 1187202170409834257660172501215671136602223550265672892491158709948, 26107433643896902839409165976875648980200176624342602024891267505207]] i)))

def SI71N0: IdealEqSpanCertificate' Table ![![-684408522258202843047961422964778747930041599495587698876560945829875, 1187202170409834257660172501215671136602223550265672892491158709948, 26107433643896902839409165976875648980200176624342602024891267505207]] 
 ![![71, 0, 0], ![0, 71, 0], ![20, 61, 1]] where
  M :=![![![-684408522258202843047961422964778747930041599495587698876560945829875, 1187202170409834257660172501215671136602223550265672892491158709948, 26107433643896902839409165976875648980200176624342602024891267505207], ![-4542693454038061094057194879976362922554830732635612752331080545906018, -526576718224411591753846254602309182912238316199266413834722182088685, 3561606511229502772980517503647013409806670650797018677473476129844], ![1307657973694709203852861611447260863082823346465643834150231899771054, -1507107938323561359139770591651493614031996902910276880088746563042318, -527763920394821426011506427103524854048840539749532086727213340798633]]]
  hmulB := by decide  
  f := ![![![-3989801671056528734700244902430947272840332119908721863481039023258373161700646806451096042445995253739605666095042829705295701337570507, 545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, -193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717]], ![![33701582300020385992926616704172720901412089466927295858038120674031484992818752696946575095024618247777582644071079226210707847057804758, -4606570860302369452185853330134544324032488979412325599264774941177509149574991993400357873183568863638894688971117045429214324090108207, 1636063015023207433018341962148455836224780055998909053825149557349297380461662994008756758996722437313606997999820031401765633162159806]], ![![26336267200592865883969192697651394611189993549494996990556336142250939599956078974176935345926249304124770345555235511380863220253757884, -3599827449505679955392524186359572951430465316007308231962261995635544401349303024653010516261284978535147246430272390943143694831999259, 1278509487687547163542394927870506287581259786252889218127363240580675639976597936212226208202603909750179386605447976448772913576730127]]]
  g := ![![![-16993763311776632392058376654961855317380917351865348441892764731465, -22413609156440862520370407775890125586698711979361028882054593790249, 26107433643896902839409165976875648980200176624342602024891267505207], ![-64984867383981002105870496197877509728886818952838776420852817866238, -10476545287456496632474053835560239449442890505604007790994425718439, 3561606511229502772980517503647013409806670650797018677473476129844], ![167083611008325883437788593711517717521966678048680078432316883320334, 432204101489585149683973541713570739196440507349453245215088270784145, -527763920394821426011506427103524854048840539749532086727213340798633]]]
  hle1 := by decide   
  hle2 := by decide  


def P71P0 : CertificateIrreducibleZModOfList' 71 2 2 6 [67, 19, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [52, 70], [0, 1]]
 g := ![![[13, 8], [18, 36], [59, 48], [40], [6], [1]], ![[3, 63], [44, 35], [70, 23], [40], [6], [1]]]
 h' := ![![[52, 70], [1, 47], [23, 6], [56, 41], [40, 18], [4, 52], [0, 1]], ![[0, 1], [31, 24], [51, 65], [58, 30], [53, 53], [10, 19], [52, 70]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [45]]
 b := ![[], [54, 58]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI71N0 : CertifiedPrimeIdeal' SI71N0 71 where
  n := 2
  hpos := by decide
  P := [67, 19, 1]
  hirr := P71P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-4573, -3358, 563]
  a := ![0, 3, 8]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-223, -531, 563]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI71N0 : Ideal.IsPrime I71N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI71N0 B_one_repr
lemma NI71N0 : Nat.card (O ⧸ I71N0) = 5041 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI71N0

def I71N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![3989801671056528734700244902430947272840332119908721863481039023258373161700646806451096042445995253739605666095042829705295701337570507, -545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, 193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717]] i)))

def SI71N1: IdealEqSpanCertificate' Table ![![3989801671056528734700244902430947272840332119908721863481039023258373161700646806451096042445995253739605666095042829705295701337570507, -545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, 193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717]] 
 ![![71, 0, 0], ![30, 1, 0], ![45, 0, 1]] where
  M :=![![![3989801671056528734700244902430947272840332119908721863481039023258373161700646806451096042445995253739605666095042829705295701337570507, -545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, 193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717], ![-33701582300020385992926616704172720901412089466927295858038120674031484992818752696946575095024618247777582644071079226210707847057804758, 4606570860302369452185853330134544324032488979412325599264774941177509149574991993400357873183568863638894688971117045429214324090108207, -1636063015023207433018341962148455836224780055998909053825149557349297380461662994008756758996722437313606997999820031401765633162159806], ![106125515638019493112706039372668012134841273070245823741204714550936409731049371218156750386818107446781733432013254896705976005757870334, -14505986796719876863678889492354485306253589934306916726996339339375756425196243553666371883001650957219741544023333138207100548676921198, 5151925198643438596525300650850696269440748998078628617206491460293941609728879658069943459515809676076763688304390389229802868477494809]]]
  hmulB := by decide  
  f := ![![![684408522258202843047961422964778747930041599495587698876560945829875, -1187202170409834257660172501215671136602223550265672892491158709948, -26107433643896902839409165976875648980200176624342602024891267505207]], ![![353168297489917554725296303787601765640226460809904841107435336912708, 6914938776226993859493536331913226039636219854806989113520949588595, -11081473462368120957116274602956570180504393934944719428510021144874]], ![![415362331379217165257822569323489898503789417335715529792887474120751, 20474420290917166444296659564743498773026716100680585914459780578798, -9113670332120270447350789321913793662819259272477253582998502773742]]]
  g := ![![![163866272737841959171771076207991382543450790051035376743544243929360332480359582526722647949149457173901274359480795032241525062108962, -545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, 193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717], ![-1384167217366861057361645469176458281581290934216143048082389279276596864215403912233285311770129217997635329622713932056446254612167038, 4606570860302369452185853330134544324032488979412325599264774941177509149574991993400357873183568863638894688971117045429214324090108207, -1636063015023207433018341962148455836224780055998909053825149557349297380461662994008756758996722437313606997999820031401765633162159806], ![4358711064798043129287805561338327312642468537829789264462010972098334226044184411478879594347270432956614278577685655317998075839130139, -14505986796719876863678889492354485306253589934306916726996339339375756425196243553666371883001650957219741544023333138207100548676921198, 5151925198643438596525300650850696269440748998078628617206491460293941609728879658069943459515809676076763688304390389229802868477494809]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N1 : Nat.card (O ⧸ I71N1) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N1)

lemma isPrimeI71N1 : Ideal.IsPrime I71N1 := prime_ideal_of_norm_prime hp71.out _ NI71N1
def MulI71N0 : IdealMulLeCertificate' Table 
  ![![-684408522258202843047961422964778747930041599495587698876560945829875, 1187202170409834257660172501215671136602223550265672892491158709948, 26107433643896902839409165976875648980200176624342602024891267505207]] ![![3989801671056528734700244902430947272840332119908721863481039023258373161700646806451096042445995253739605666095042829705295701337570507, -545354338341069144339447320716151945408260018666303017941716519116432460153887664669585586332240812437868999333273343800588544387386602, 193687254597818310304175958069958166100069479694984458954242072839261408004705475269807902844969070389526337034891259920751194523320717]]
  ![![71, 0, 0]] where
 M := ![![![-71, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0]]]]
 hle2 := by decide  


def PBC71 : ContainsPrimesAboveP 71 ![I71N0, I71N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI71N0
    exact isPrimeI71N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 71 (by decide) (𝕀 ⊙ MulI71N0)
instance hp73 : Fact (Nat.Prime 73) := {out := by norm_num}

def I73N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![73, 0, 0]] i)))

def SI73N0: IdealEqSpanCertificate' Table ![![73, 0, 0]] 
 ![![73, 0, 0], ![0, 73, 0], ![0, 0, 73]] where
  M :=![![![73, 0, 0], ![0, 73, 0], ![0, 0, 73]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P73P0 : CertificateIrreducibleZModOfList' 73 3 2 6 [45, 55, 24, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [43, 28, 42], [6, 44, 31], [0, 1]]
 g := ![![[25, 58, 23], [72, 46], [26, 2], [63, 32, 27], [49, 1], []], ![[60, 56, 39, 59], [20, 35], [25, 64], [18, 7, 32, 59], [23, 38], [20, 12]], ![[26, 45, 8, 14], [60, 12], [54, 65], [58, 19, 7, 63], [7, 54], [31, 12]]]
 h' := ![![[43, 28, 42], [61, 1, 13], [69, 40, 22], [12, 65, 41], [58, 34, 10], [0, 0, 1], [0, 1]], ![[6, 44, 31], [31, 11, 30], [37, 58, 20], [33, 20, 8], [60, 18, 43], [0, 38, 44], [43, 28, 42]], ![[0, 1], [66, 61, 30], [49, 48, 31], [17, 61, 24], [31, 21, 20], [28, 35, 28], [6, 44, 31]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [7, 7], []]
 b := ![[], [64, 42, 12], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI73N0 : CertifiedPrimeIdeal' SI73N0 73 where
  n := 3
  hpos := by decide
  P := [45, 55, 24, 1]
  hirr := P73P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-24297101, 1882232, 549398]
  a := ![2, -8, -14]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![-332837, 25784, 7526]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI73N0 : Ideal.IsPrime I73N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI73N0 B_one_repr
lemma NI73N0 : Nat.card (O ⧸ I73N0) = 389017 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI73N0

def PBC73 : ContainsPrimesAboveP 73 ![I73N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI73N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![73, 0, 0]]) timesTableT_eq_Table B_one_repr 73 (by decide) 𝕀

instance hp79 : Fact (Nat.Prime 79) := {out := by norm_num}

def I79N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![79, 0, 0]] i)))

def SI79N0: IdealEqSpanCertificate' Table ![![79, 0, 0]] 
 ![![79, 0, 0], ![0, 79, 0], ![0, 0, 79]] where
  M :=![![![79, 0, 0], ![0, 79, 0], ![0, 0, 79]]]
  hmulB := by decide  
  f := ![![![1, 0, 0]], ![![0, 1, 0]], ![![0, 0, 1]]]
  g := ![![![1, 0, 0], ![0, 1, 0], ![0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P79P0 : CertificateIrreducibleZModOfList' 79 3 2 6 [63, 7, 28, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [77, 12, 8], [53, 66, 71], [0, 1]]
 g := ![![[69, 74, 73], [32, 60, 26], [78, 28, 42], [13, 26, 11], [51, 1], []], ![[64, 44, 4, 42], [76, 57, 6, 46], [71, 15, 37, 67], [47, 68, 68, 25], [64, 11], [59, 64]], ![[50, 35, 8, 34], [60, 35, 39, 68], [6, 27, 19, 7], [66, 36, 12, 75], [73, 65], [75, 64]]]
 h' := ![![[77, 12, 8], [38, 44, 51], [63, 32, 37], [50, 53, 68], [26, 54, 66], [0, 0, 1], [0, 1]], ![[53, 66, 71], [29, 11, 5], [78, 43, 12], [23, 52, 14], [76, 44, 48], [0, 10, 66], [77, 12, 8]], ![[0, 1], [7, 24, 23], [71, 4, 30], [77, 53, 76], [67, 60, 44], [59, 69, 12], [53, 66, 71]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [7, 52], []]
 b := ![[], [62, 68, 33], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI79N0 : CertifiedPrimeIdeal' SI79N0 79 where
  n := 3
  hpos := by decide
  P := [63, 7, 28, 1]
  hirr := P79P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![21409, -4582, 1738]
  a := ![13, 0, 1]
  z := ![1, 0, 0]
  hpol := by decide
  g := ![271, -58, 22]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI79N0 : Ideal.IsPrime I79N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI79N0 B_one_repr
lemma NI79N0 : Nat.card (O ⧸ I79N0) = 493039 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI79N0

def PBC79 : ContainsPrimesAboveP 79 ![I79N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI79N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![79, 0, 0]]) timesTableT_eq_Table B_one_repr 79 (by decide) 𝕀



lemma PB253I1_primes (p : ℕ) :
  p ∈ Set.range ![37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79] ↔ Nat.Prime p ∧ 31 < p ∧ p ≤ 79 := by
  rw [← List.mem_ofFn']
  convert primes_range 31 79 (by omega)

def PB253I1 : PrimesBelowBoundCertificateInterval O 31 79 253 where
  m := 11
  g := ![1, 1, 1, 1, 2, 3, 2, 1, 2, 1, 1]
  P := ![37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79]
  hP := PB253I1_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I37N0]
    · exact ![I41N0]
    · exact ![I43N0]
    · exact ![I47N0]
    · exact ![I53N0, I53N1]
    · exact ![I59N0, I59N1, I59N2]
    · exact ![I61N0, I61N1]
    · exact ![I67N0]
    · exact ![I71N0, I71N1]
    · exact ![I73N0]
    · exact ![I79N0]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC37
    · exact PBC41
    · exact PBC43
    · exact PBC47
    · exact PBC53
    · exact PBC59
    · exact PBC61
    · exact PBC67
    · exact PBC71
    · exact PBC73
    · exact PBC79
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![50653]
    · exact ![68921]
    · exact ![79507]
    · exact ![103823]
    · exact ![2809, 53]
    · exact ![59, 59, 59]
    · exact ![3721, 61]
    · exact ![300763]
    · exact ![5041, 71]
    · exact ![389017]
    · exact ![493039]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI37N0
    · dsimp ; intro j
      fin_cases j
      exact NI41N0
    · dsimp ; intro j
      fin_cases j
      exact NI43N0
    · dsimp ; intro j
      fin_cases j
      exact NI47N0
    · dsimp ; intro j
      fin_cases j
      exact NI53N0
      exact NI53N1
    · dsimp ; intro j
      fin_cases j
      exact NI59N0
      exact NI59N1
      exact NI59N2
    · dsimp ; intro j
      fin_cases j
      exact NI61N0
      exact NI61N1
    · dsimp ; intro j
      fin_cases j
      exact NI67N0
    · dsimp ; intro j
      fin_cases j
      exact NI71N0
      exact NI71N1
    · dsimp ; intro j
      fin_cases j
      exact NI73N0
    · dsimp ; intro j
      fin_cases j
      exact NI79N0
  β := ![I53N1, I59N0, I59N1, I59N2, I61N1, I71N1]
  Il := ![[], [], [], [], [I53N1], [I59N0, I59N1, I59N2], [I61N1], [], [I71N1], [], []]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
