
import IdealArithmetic.Examples.NF5_3_1518750000_3.RI5_3_1518750000_3
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp1879 : Fact (Nat.Prime 1879) := {out := by norm_num}

def I1879N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-10337, 11113, -2453, 1995, -913]] i)))

def SI1879N0: IdealEqSpanCertificate' Table ![![-10337, 11113, -2453, 1995, -913]] 
 ![![1879, 0, 0, 0, 0], ![0, 1879, 0, 0, 0], ![0, 0, 1879, 0, 0], ![1297, 932, 1843, 1, 0], ![314, 594, 455, 0, 1]] where
  M :=![![![-10337, 11113, -2453, 1995, -913], ![21912, -24032, 5411, -4269, 1995], ![-47880, 51837, -11510, 9363, -4269], ![41016, -44571, 9925, -8066, 3695], ![-13512, 14565, -3245, 2403, -1250]]]
  hmulB := by decide  
  f := ![![![-6647, 929, 2709, 1179, 571]], ![![-13704, 1918, 5593, 2439, 1179]], ![![-28296, 3981, 11542, 5019, 2439]], ![![-39137, 5497, 15964, 6946, 3371]], ![![-12298, 1726, 5017, 2184, 1059]]]
  g := ![![![-1230, -695, -1737, 1995, -913], ![2625, 1474, 3707, -4269, 1995], ![-5775, -3267, -8156, 9363, -4269], ![4972, 2809, 7022, -8066, 3695], ![-1457, -789, -2056, 2403, -1250]]]
  hle1 := by decide   
  hle2 := by decide  


def P1879P0 : CertificateIrreducibleZModOfList' 1879 3 2 10 [623, 1282, 1142, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [1534, 244, 882], [1082, 1634, 997], [0, 1]]
 g := ![![[836, 1850, 755], [1314, 1118, 976], [1557, 1219, 1868], [1005, 1731], [1223, 1515, 457], [], [1602, 144, 576], [1690, 180], [1191, 846, 138], [1]], ![[1106, 443, 1785, 390], [1712, 325, 156, 1784], [73, 601, 166, 658], [953, 493], [460, 1756, 1573, 761], [1502, 1361], [1180, 1362, 1404, 567], [1424, 1532], [919, 951, 1696, 1383], [1334, 1124, 102, 844]], ![[1147, 641, 536, 182], [1742, 1765, 95, 182], [486, 971, 588, 781], [448, 1217], [72, 1823, 1003, 906], [1471, 1361], [1709, 1857, 314, 1222], [757, 1568], [1613, 1876, 36, 782], [345, 1492, 1723, 1035]]]
 h' := ![![[1534, 244, 882], [622, 266, 1384], [1432, 51, 917], [92, 1091, 130], [945, 34, 1757], [1775, 457, 180], [1582, 1312], [1097, 554, 24], [212, 882, 567], [1256, 597, 737], [0, 1]], ![[1082, 1634, 997], [1483, 574, 756], [261, 979, 701], [223, 72, 307], [646, 830, 1629], [205, 296, 85], [1781, 698, 1599], [516, 217, 1724], [191, 554, 149], [1356, 1145, 253], [1534, 244, 882]], ![[0, 1], [576, 1039, 1618], [825, 849, 261], [108, 716, 1442], [965, 1015, 372], [1182, 1126, 1614], [642, 1748, 280], [379, 1108, 131], [19, 443, 1163], [426, 137, 889], [1082, 1634, 997]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [1533, 417], []]
 b := ![[], [715, 1790, 236], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI1879N0 : CertifiedPrimeIdeal' SI1879N0 1879 where
  n := 3
  hpos := by decide
  P := [623, 1282, 1142, 1]
  hirr := P1879P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-601873, 1936226, -1374475, -2357446, 1673119]
  a := ![0, -1, -4, -1, -6]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![1347337, 641428, 1906402, -2357446, 1673119]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI1879N0 : Ideal.IsPrime I1879N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI1879N0 B_one_repr
lemma NI1879N0 : Nat.card (O ⧸ I1879N0) = 6634074439 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI1879N0

def I1879N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, -44, 26, 56, -22]] i)))

def SI1879N1: IdealEqSpanCertificate' Table ![![37, -44, 26, 56, -22]] 
 ![![1879, 0, 0, 0, 0], ![584, 1, 0, 0, 0], ![922, 0, 1, 0, 0], ![616, 0, 0, 1, 0], ![36, 0, 0, 0, 1]] where
  M :=![![![37, -44, 26, 56, -22], ![528, -293, 66, 384, 56], ![-1344, 1368, -703, -1764, 384], ![-864, 52, 266, -91, -486], ![7728, -6630, 2980, 8580, -1165]]]
  hmulB := by decide  
  f := ![![![509995, -87480, -197590, -91000, -41002]], ![![159032, -27245, -61638, -28376, -12792]], ![![251410, -43128, -97403, -44860, -20212]], ![![166984, -28616, -64714, -29795, -13430]], ![![10020, -1722, -3880, -1788, -805]]]
  g := ![![![-17, -44, 26, 56, -22], ![-68, -293, 66, 384, 56], ![490, 1368, -703, -1764, 384], ![-108, 52, 266, -91, -486], ![-2188, -6630, 2980, 8580, -1165]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1879N1 : Nat.card (O ⧸ I1879N1) = 1879 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1879N1)

lemma isPrimeI1879N1 : Ideal.IsPrime I1879N1 := prime_ideal_of_norm_prime hp1879.out _ NI1879N1

def I1879N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![137, 10, -38, -18, -8]] i)))

def SI1879N2: IdealEqSpanCertificate' Table ![![137, 10, -38, -18, -8]] 
 ![![1879, 0, 0, 0, 0], ![1514, 1, 0, 0, 0], ![184, 0, 1, 0, 0], ![1080, 0, 0, 1, 0], ![1155, 0, 0, 0, 1]] where
  M :=![![![137, 10, -38, -18, -8], ![192, 17, -54, -30, -18], ![432, -78, -43, 90, -30], ![-96, 36, -8, -43, 30], ![-576, 384, -132, -498, 17]]]
  hmulB := by decide  
  f := ![![![-149377, 23846, 59174, 26646, 12356]], ![![-120518, 19233, 47746, 21498, 9970]], ![![-14968, 2390, 5929, 2670, 1238]], ![![-85800, 13692, 33992, 15305, 7098]], ![![-91893, 14670, 36402, 16392, 7601]]]
  g := ![![![11, 10, -38, -18, -8], ![20, 17, -54, -30, -18], ![34, -78, -43, 90, -30], ![-22, 36, -8, -43, 30], ![-21, 384, -132, -498, 17]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1879N2 : Nat.card (O ⧸ I1879N2) = 1879 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1879N2)

lemma isPrimeI1879N2 : Ideal.IsPrime I1879N2 := prime_ideal_of_norm_prime hp1879.out _ NI1879N2
def MulI1879N0 : IdealMulLeCertificate' Table 
  ![![-10337, 11113, -2453, 1995, -913]] ![![37, -44, 26, 56, -22]]
  ![![2683, -55, -915, 527, 1865]] where
 M := ![![![2683, -55, -915, 527, 1865]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI1879N1 : IdealMulLeCertificate' Table 
  ![![2683, -55, -915, 527, 1865]] ![![137, 10, -38, -18, -8]]
  ![![1879, 0, 0, 0, 0]] where
 M := ![![![-1163101, 832397, -310035, -1080425, 54491]]]
 hmul := by decide  
 g := ![![![![-619, 443, -165, -575, 29]]]]
 hle2 := by decide  


def PBC1879 : ContainsPrimesAboveP 1879 ![I1879N0, I1879N1, I1879N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI1879N0
    exact isPrimeI1879N1
    exact isPrimeI1879N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 1879 (by decide) (𝕀 ⊙ MulI1879N0 ⊙ MulI1879N1)
instance hp1889 : Fact (Nat.Prime 1889) := {out := by norm_num}

def I1889N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-616303, 709985, -167143, 123433, -60809]] i)))

def SI1889N0: IdealEqSpanCertificate' Table ![![-616303, 709985, -167143, 123433, -60809]] 
 ![![1889, 0, 0, 0, 0], ![0, 1889, 0, 0, 0], ![0, 0, 1889, 0, 0], ![0, 0, 0, 1889, 0], ![713, 1670, 463, 1118, 1]] where
  M :=![![![-616303, 709985, -167143, 123433, -60809], ![1459416, -1528438, 328359, -278595, 123433], ![-2962392, 3310911, -758498, 584145, -278595], ![2595576, -2845675, 640191, -506858, 236655], ![-855384, 919287, -202789, 165501, -75488]]]
  hmulB := by decide  
  f := ![![![9841, -1389, -4023, -1753, -847]], ![![20328, -2864, -8317, -3633, -1753]], ![![42072, -5967, -17170, -7449, -3633]], ![![-6504, 913, 2669, 1178, 575]], ![![28153, -3979, -11502, -5003, -2420]]]
  g := ![![![22626, 54135, 14816, 36055, -60809], ![-45817, -109932, -30080, -73201, 123433], ![103587, 248049, 67883, 165195, -278595], ![-87951, -210725, -57666, -140332, 236655], ![28040, 67223, 18395, 44765, -75488]]]
  hle1 := by decide   
  hle2 := by decide  


def P1889P0 : CertificateIrreducibleZModOfList' 1889 4 2 10 [685, 1616, 409, 1295, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [1714, 1524, 958, 1651], [732, 1308, 1241, 469], [37, 945, 1579, 1658], [0, 1]]
 g := ![![[538, 66, 1151, 430], [124, 1096, 923], [1517, 1278, 582], [1183, 1639, 967], [1240, 1247, 1377], [558, 341, 750, 966], [837, 716, 1705, 989], [46, 422, 766], [1777, 1073, 594, 1], []], ![[1721, 1325, 1059, 1578, 1187, 1251], [288, 347, 81], [1195, 899, 1324], [607, 1510, 1729], [341, 1320, 1067], [800, 1154, 1273, 1117, 1187, 1065], [1508, 1362, 368, 939, 723, 99], [196, 1549, 1360], [1553, 1806, 1656, 595, 1275, 678], [1640, 1846, 8, 960, 514, 521]], ![[1129, 203, 220, 860, 117, 828], [1523, 1477, 1165], [1001, 533, 287], [926, 106, 290], [68, 1772, 232], [665, 962, 382, 1126, 222, 308], [817, 60, 1255, 1101, 1506, 407], [812, 276, 839], [279, 1624, 676, 715, 1060, 942], [1114, 1048, 374, 1228, 1401, 1530]], ![[1388, 1745, 572, 1057, 1445, 28], [35, 1156, 292], [53, 830, 547], [384, 644, 1351], [1851, 395, 1367], [468, 1466, 1397, 646, 1090, 1068], [691, 1535, 855, 81, 1271, 1670], [767, 467, 1840], [1290, 31, 503, 658, 389, 205], [366, 1589, 615, 1282, 1275, 1223]]]
 h' := ![![[1714, 1524, 958, 1651], [1407, 1372, 41, 1207], [188, 584, 1018, 724], [658, 28, 1820, 689], [729, 1655, 1587, 1702], [1237, 626, 649, 1107], [911, 1414, 975, 1630], [1235, 613, 660, 485], [1160, 1353, 1740, 1779], [0, 0, 0, 1], [0, 1]], ![[732, 1308, 1241, 469], [1131, 1736, 1163, 1596], [1827, 516, 240, 1880], [24, 1636, 479, 1489], [604, 1679, 144, 86], [548, 1855, 947, 823], [1000, 1279, 1357, 1226], [1861, 868, 1109, 1454], [672, 108, 301, 57], [273, 300, 679, 320], [1714, 1524, 958, 1651]], ![[37, 945, 1579, 1658], [184, 1250, 335, 783], [1822, 1041, 81, 1626], [328, 1590, 131, 1709], [1632, 1597, 1447, 1635], [111, 924, 1213, 408], [219, 233, 1764, 839], [240, 1841, 1274, 768], [1201, 1748, 513, 1514], [719, 1080, 1858, 689], [732, 1308, 1241, 469]], ![[0, 1], [615, 1309, 350, 192], [1676, 1637, 550, 1437], [1500, 524, 1348, 1780], [968, 736, 600, 355], [1236, 373, 969, 1440], [1656, 852, 1571, 83], [1406, 456, 735, 1071], [1618, 569, 1224, 428], [177, 509, 1241, 879], [37, 945, 1579, 1658]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [271, 631, 1483], []]
 b := ![[], [], [598, 657, 184, 311], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI1889N0 : CertifiedPrimeIdeal' SI1889N0 1889 where
  n := 4
  hpos := by decide
  P := [685, 1616, 409, 1295, 1]
  hirr := P1889P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![986164372, -1276018446, -166707315, -614050233, -216009984]
  a := ![3, -64, 1, -1, 2]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![82054676, 190291506, 52856493, 127519911, -216009984]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI1889N0 : Ideal.IsPrime I1889N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI1889N0 B_one_repr
lemma NI1889N0 : Nat.card (O ⧸ I1889N0) = 12732914759041 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI1889N0

def I1889N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![9841, -1389, -4023, -1753, -847]] i)))

def SI1889N1: IdealEqSpanCertificate' Table ![![9841, -1389, -4023, -1753, -847]] 
 ![![1889, 0, 0, 0, 0], ![771, 1, 0, 0, 0], ![594, 0, 1, 0, 0], ![823, 0, 0, 1, 0], ![1345, 0, 0, 0, 1]] where
  M :=![![![9841, -1389, -4023, -1753, -847], ![20328, -2864, -8317, -3633, -1753], ![42072, -5967, -17170, -7449, -3633], ![-6504, 913, 2669, 1178, 575], ![8760, -1107, -3721, -1785, -730]]]
  hmulB := by decide  
  f := ![![![-616303, 709985, -167143, 123433, -60809]], ![![-250773, 288973, -68046, 50232, -24754]], ![![-195366, 225009, -52960, 39123, -19269]], ![![-267137, 307820, -72482, 53509, -26368]], ![![-439271, 506008, -119116, 87974, -43337]]]
  g := ![![![3204, -1389, -4023, -1753, -847], ![6626, -2864, -8317, -3633, -1753], ![13689, -5967, -17170, -7449, -3633], ![-2138, 913, 2669, 1178, 575], ![2924, -1107, -3721, -1785, -730]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1889N1 : Nat.card (O ⧸ I1889N1) = 1889 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1889N1)

lemma isPrimeI1889N1 : Ideal.IsPrime I1889N1 := prime_ideal_of_norm_prime hp1889.out _ NI1889N1
def MulI1889N0 : IdealMulLeCertificate' Table 
  ![![-616303, 709985, -167143, 123433, -60809]] ![![9841, -1389, -4023, -1753, -847]]
  ![![1889, 0, 0, 0, 0]] where
 M := ![![![1889, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC1889 : ContainsPrimesAboveP 1889 ![I1889N0, I1889N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI1889N0
    exact isPrimeI1889N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 1889 (by decide) (𝕀 ⊙ MulI1889N0)
instance hp1901 : Fact (Nat.Prime 1901) := {out := by norm_num}

def I1901N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-437, -105, 167, 158, 50]] i)))

def SI1901N0: IdealEqSpanCertificate' Table ![![-437, -105, 167, 158, 50]] 
 ![![1901, 0, 0, 0, 0], ![0, 1901, 0, 0, 0], ![1739, 1488, 1, 0, 0], ![336, 900, 0, 1, 0], ![269, 1727, 0, 0, 1]] where
  M :=![![![-437, -105, 167, 158, 50], ![-1200, 313, 38, -372, 158], ![-3792, 1170, 167, -1500, -372], ![3384, -2147, 693, 2783, -64], ![7896, -2847, -349, 3810, 2219]]]
  hmulB := by decide  
  f := ![![![-23209, 38111, -14495, 4738, -4484]], ![![107616, -90469, 7824, -20472, 4738]], ![![62945, -35857, -7170, -11678, -404]], ![![46920, -36179, 1163, -8869, 1458]], ![![94463, -76769, 5048, -17924, 3667]]]
  g := ![![![-188, -251, 167, 158, 50], ![8, 3, 38, -372, 158], ![163, 918, 167, -1500, -372], ![-1115, -1803, 693, 2783, -64], ![-664, -3548, -349, 3810, 2219]]]
  hle1 := by decide   
  hle2 := by decide  


def P1901P0 : CertificateIrreducibleZModOfList' 1901 2 2 10 [603, 226, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [1675, 1900], [0, 1]]
 g := ![![[1687, 1715], [1645], [1001, 1486], [1641, 439], [1174], [746, 1643], [805, 853], [601], [207, 1233], [1675, 1]], ![[0, 186], [1645], [1642, 415], [1279, 1462], [1174], [123, 258], [28, 1048], [601], [996, 668], [1449, 1900]]]
 h' := ![![[1675, 1900], [1172, 308], [915, 1587], [898, 1626], [1195, 595], [699, 556], [1241, 732], [394, 1242], [645, 1686], [1307, 1047], [0, 1]], ![[0, 1], [0, 1593], [1542, 314], [315, 275], [1696, 1306], [509, 1345], [1196, 1169], [1050, 659], [1710, 215], [409, 854], [1675, 1900]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [953]]
 b := ![[], [1567, 1427]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI1901N0 : CertifiedPrimeIdeal' SI1901N0 1901 where
  n := 2
  hpos := by decide
  P := [603, 226, 1]
  hirr := P1901P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-322, 572, -1071, -1744, -178]
  a := ![1, -3, -2, -1, -3]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![1313, 1826, -1071, -1744, -178]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI1901N0 : Ideal.IsPrime I1901N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI1901N0 B_one_repr
lemma NI1901N0 : Nat.card (O ⧸ I1901N0) = 3613801 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI1901N0

def I1901N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-8083, 8783, -1957, 1572, -726]] i)))

def SI1901N1: IdealEqSpanCertificate' Table ![![-8083, 8783, -1957, 1572, -726]] 
 ![![1901, 0, 0, 0, 0], ![64, 1, 0, 0, 0], ![1607, 0, 1, 0, 0], ![1382, 0, 0, 1, 0], ![949, 0, 0, 0, 1]] where
  M :=![![![-8083, 8783, -1957, 1572, -726], ![17424, -18973, 4244, -3390, 1572], ![-37728, 41004, -9139, 7338, -3390], ![32424, -35265, 7871, -6307, 2918], ![-10488, 11403, -2543, 2040, -943]]]
  hmulB := by decide  
  f := ![![![-1775, -853, 1017, 1308, 336]], ![![-64, -27, 34, 42, 12]], ![![-1517, -715, 860, 1098, 282]], ![![-1274, -631, 743, 965, 244]], ![![-847, -440, 506, 672, 179]]]
  g := ![![![574, 8783, -1957, 1572, -726], ![-1260, -18973, 4244, -3390, 1572], ![2683, 41004, -9139, 7338, -3390], ![-2321, -35265, 7871, -6307, 2918], ![748, 11403, -2543, 2040, -943]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1901N1 : Nat.card (O ⧸ I1901N1) = 1901 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1901N1)

lemma isPrimeI1901N1 : Ideal.IsPrime I1901N1 := prime_ideal_of_norm_prime hp1901.out _ NI1901N1

def I1901N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-661, 649, -303, -848, 56]] i)))

def SI1901N2: IdealEqSpanCertificate' Table ![![-661, 649, -303, -848, 56]] 
 ![![1901, 0, 0, 0, 0], ![405, 1, 0, 0, 0], ![1362, 0, 1, 0, 0], ![533, 0, 0, 1, 0], ![8, 0, 0, 0, 1]] where
  M :=![![![-661, 649, -303, -848, 56], ![-1344, 179, 364, -282, -848], ![20352, -14064, 4945, 18294, -282], ![-9048, 9719, -5205, -12503, 3190], ![-83352, 53895, -16823, -70356, -3215]]]
  hmulB := by decide  
  f := ![![![-103767881, 112779461, -25133297, 20183648, -9323346]], ![![-21989601, 23899034, -5325879, 4277142, -1975682]], ![![-74600874, 81079506, -18068861, 14510442, -6702750]], ![![-28875305, 31382764, -6993676, 5616465, -2594358]], ![![-507536, 551633, -122943, 98720, -45605]]]
  g := ![![![316, 649, -303, -848, 56], ![-217, 179, 364, -282, -848], ![-5664, -14064, 4945, 18294, -282], ![5146, 9719, -5205, -12503, 3190], ![20267, 53895, -16823, -70356, -3215]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1901N2 : Nat.card (O ⧸ I1901N2) = 1901 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1901N2)

lemma isPrimeI1901N2 : Ideal.IsPrime I1901N2 := prime_ideal_of_norm_prime hp1901.out _ NI1901N2

def I1901N3 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-18563, 20192, -4508, 3611, -1671]] i)))

def SI1901N3: IdealEqSpanCertificate' Table ![![-18563, 20192, -4508, 3611, -1671]] 
 ![![1901, 0, 0, 0, 0], ![1845, 1, 0, 0, 0], ![666, 0, 1, 0, 0], ![180, 0, 0, 1, 0], ![1781, 0, 0, 0, 1]] where
  M :=![![![-18563, 20192, -4508, 3611, -1671], ![40104, -43628, 9741, -7803, 3611], ![-86664, 94269, -21046, 16857, -7803], ![74544, -81086, 18104, -14494, 6711], ![-24096, 26220, -5858, 4683, -2164]]]
  hmulB := by decide  
  f := ![![![-2639839, 371794, 1078170, 469525, 227237]], ![![-2564943, 361246, 1047581, 456204, 220790]], ![![-930774, 131091, 380150, 165549, 80121]], ![![-249036, 35074, 101712, 44294, 21437]], ![![-2474455, 348502, 1010624, 440110, 213001]]]
  g := ![![![-16804, 20192, -4508, 3611, -1671], ![36307, -43628, 9741, -7803, 3611], ![-78450, 94269, -21046, 16857, -7803], ![67479, -81086, 18104, -14494, 6711], ![-21824, 26220, -5858, 4683, -2164]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI1901N3 : Nat.card (O ⧸ I1901N3) = 1901 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI1901N3)

lemma isPrimeI1901N3 : Ideal.IsPrime I1901N3 := prime_ideal_of_norm_prime hp1901.out _ NI1901N3
def MulI1901N0 : IdealMulLeCertificate' Table 
  ![![-437, -105, 167, 158, 50]] ![![-8083, 8783, -1957, 1572, -726]]
  ![![767, -58, -156, -74, -34]] where
 M := ![![![767, -58, -156, -74, -34]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI1901N1 : IdealMulLeCertificate' Table 
  ![![767, -58, -156, -74, -34]] ![![-661, 649, -303, -848, 56]]
  ![![-100427, 129749, -67781, -170598, 9378]] where
 M := ![![![-100427, 129749, -67781, -170598, 9378]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI1901N2 : IdealMulLeCertificate' Table 
  ![![-100427, 129749, -67781, -170598, 9378]] ![![-18563, 20192, -4508, 3611, -1671]]
  ![![1901, 0, 0, 0, 0]] where
 M := ![![![-1176719, 842143, -313665, -1093075, 55129]]]
 hmul := by decide  
 g := ![![![![-619, 443, -165, -575, 29]]]]
 hle2 := by decide  


def PBC1901 : ContainsPrimesAboveP 1901 ![I1901N0, I1901N1, I1901N2, I1901N3] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI1901N0
    exact isPrimeI1901N1
    exact isPrimeI1901N2
    exact isPrimeI1901N3
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 1901 (by decide) (𝕀 ⊙ MulI1901N0 ⊙ MulI1901N1 ⊙ MulI1901N2)


lemma PB1906I32_primes (p : ℕ) :
  p ∈ Set.range ![1879, 1889, 1901] ↔ Nat.Prime p ∧ 1877 < p ∧ p ≤ 1905 := by
  rw [← List.mem_ofFn']
  convert primes_range 1877 1905 (by omega)

def PB1906I32 : PrimesBelowBoundCertificateInterval O 1877 1905 1906 where
  m := 3
  g := ![3, 2, 4]
  P := ![1879, 1889, 1901]
  hP := PB1906I32_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I1879N0, I1879N1, I1879N2]
    · exact ![I1889N0, I1889N1]
    · exact ![I1901N0, I1901N1, I1901N2, I1901N3]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC1879
    · exact PBC1889
    · exact PBC1901
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![6634074439, 1879, 1879]
    · exact ![12732914759041, 1889]
    · exact ![3613801, 1901, 1901, 1901]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI1879N0
      exact NI1879N1
      exact NI1879N2
    · dsimp ; intro j
      fin_cases j
      exact NI1889N0
      exact NI1889N1
    · dsimp ; intro j
      fin_cases j
      exact NI1901N0
      exact NI1901N1
      exact NI1901N2
      exact NI1901N3
  β := ![I1879N1, I1879N2, I1889N1, I1901N1, I1901N2, I1901N3]
  Il := ![[I1879N1, I1879N2], [I1889N1], [I1901N1, I1901N2, I1901N3]]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
