
import IdealArithmetic.Examples.NF5_1_1240312500_5.PrimesBelow5_1_1240312500_5F0

open Classical Polynomial

noncomputable section 
instance hp29 : Fact (Nat.Prime 29) := {out := by norm_num}
def I29N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![29, 0, 0, 0, 0]] i)))

def SI29N0: IdealEqSpanCertificate O ℤ timesTableO I29N0
 ![![29, 0, 0, 0, 0]] 
 ![![29, 0, 0, 0, 0], ![0, 29, 0, 0, 0], ![0, 0, 29, 0, 0], ![0, 0, 0, 29, 0], ![0, 0, 0, 0, 29]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![29, 0, 0, 0, 0], ![0, 29, 0, 0, 0], ![0, 0, 29, 0, 0], ![0, 0, 0, 29, 0], ![0, 0, 0, 0, 29]]]
  hmulB := by decide
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide
  hle2 := by decide

lemma NI29N0 : Nat.card (O ⧸ I29N0) = 20511149 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI29N0)

def MemCI29N0 : IdealMemCertificate O ℤ B I29N0
  ![![29, 0, 0, 0, 0], ![0, 29, 0, 0, 0], ![0, 0, 29, 0, 0], ![0, 0, 0, 29, 0], ![0, 0, 0, 0, 29]] ![143803573506551, 7854753614129, -9734734136195, 41337246265464, -58583137294878] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI29N0
 g := ![4958743914019, 270853572901, -335680487455, 1425422285016, -2020108182582]
 hmem := by decide

def P29P0 : CertificateIrreducibleZModOfList' 29 5 2 4 [17, 27, 0, 23, 27, 1] where
 m := 1
 P := ![5]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [26, 1, 2, 20, 13], [22, 19, 25, 6, 13], [4, 21, 9, 18, 22], [8, 16, 22, 14, 10], [0, 1]]
 g := ![![[7, 1, 24, 0, 1], [13, 18, 13, 9], [10, 2, 1], []],![[27, 16, 8, 23, 13, 9, 22, 22], [3, 22, 23, 20], [1, 19, 14, 26, 27, 12, 10, 9], [14, 21, 4, 25, 16, 23, 5, 22]],![[7, 13, 17, 2, 20, 12, 28, 20], [12, 25, 28, 1], [10, 25, 13, 15, 21, 10, 28, 7], [13, 20, 3, 3, 8, 25, 12, 22]],![[17, 22, 1, 16, 13, 22, 25, 16], [24, 25, 27, 9], [13, 2, 22, 2, 25, 12, 27, 5], [8, 18, 11, 4, 25, 6, 17, 5]],![[6, 26, 11, 16, 7, 21, 27, 11], [13, 22, 4, 7], [22, 26, 2, 23, 18, 27, 21, 11], [24, 28, 14, 14, 23, 24, 23, 14]]]
 h' := ![![[26, 1, 2, 20, 13], [27, 14, 23, 28, 1], [4, 15, 16, 4, 3], [0, 0, 0, 1], [0, 1]],![[22, 19, 25, 6, 13], [27, 17, 1, 27, 13], [22, 16, 10, 24, 22], [25, 17, 19, 27, 9], [26, 1, 2, 20, 13]],![[4, 21, 9, 18, 22], [12, 17, 13, 27, 21], [10, 18, 13, 13, 1], [16, 14, 27, 4, 11], [22, 19, 25, 6, 13]],![[8, 16, 22, 14, 10], [26, 16, 13, 7, 21], [12, 20, 13, 13, 26], [15, 22, 5, 18, 7], [4, 21, 9, 18, 22]],![[0, 1], [7, 23, 8, 27, 2], [24, 18, 6, 4, 6], [17, 5, 7, 8, 2], [8, 16, 22, 14, 10]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [21, 27, 15, 12], [], [], []]
 b := ![[], [22, 23, 14, 4, 8], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI29N0 : PrimeIdeal O 29 where 
  r := 5
  n := 5
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I29N0
  hcard := NI29N0
  P := [17, 27, 0, 23, 27, 1]
  f := ofList [17, 27, 0, 23, 27, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P29P0
  hneq := by decide
  hlen := by decide
  c := ![143803573506551, 7854753614129, -9734734136195, 41337246265464, -58583137294878]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI29N0
  hpmem := by 
    show  _ ∈ I29N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI29N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI29N0 : Ideal.IsPrime I29N0 := PrimeIdeal_isPrime PI29N0
def PBC29 : PrimesBelowPCertificate 29 ![I29N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI29N0
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    #unfold I29N
    unfold I29N0
    rw [Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp31 : Fact (Nat.Prime 31) := {out := by norm_num}
def I31N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![31, 0, 0, 0, 0], ![-114, -59, -38, -48, 125]] i)))

def SI31N0: IdealEqSpanCertificate O ℤ timesTableO I31N0
 ![![31, 0, 0, 0, 0], ![-114, -59, -38, -48, 125]] 
 ![![31, 0, 0, 0, 0], ![0, 31, 0, 0, 0], ![0, 0, 31, 0, 0], ![2, 5, 15, 1, 0], ![13, 26, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![31, 0, 0, 0, 0], ![0, 31, 0, 0, 0], ![0, 0, 31, 0, 0], ![0, 0, 0, 31, 0], ![0, 0, 0, 0, 31]], ![![-114, -59, -38, -48, 125], ![-345, -167, -91, -128, 327], ![-939, -305, -151, -194, 549], ![-459, -1083, -522, -630, 1614], ![-706, -627, -315, -393, 1022]]]
  hmulB := by decide
  f := ![![![8821, 1769, -2868, -464, 2741], ![-20305, 7502, 0, 0, 0]], ![![-375, -66, 139, 32, -153], ![930, -341, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![527, 113, -156, -17, 132], ![-1155, 429, 0, 0, 0]], ![![3403, 696, -1080, -160, 1001], ![-7730, 2860, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-2, -5, -15, 31, 0], ![-13, -26, 0, 0, 31]], ![![-53, -99, 22, -48, 125], ![-140, -259, 59, -128, 327], ![-248, -439, 89, -194, 549], ![-651, -1287, 288, -630, 1614], ![-426, -814, 180, -393, 1022]]]
  hle1 := by decide
  hle2 := by decide

lemma NI31N0 : Nat.card (O ⧸ I31N0) = 29791 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI31N0)

def MemCI31N0 : IdealMemCertificate O ℤ B I31N0
  ![![31, 0, 0, 0, 0], ![0, 31, 0, 0, 0], ![0, 0, 31, 0, 0], ![2, 5, 15, 1, 0], ![13, 26, 0, 0, 1]] ![38432857, 190146441, 129891519, 180745686, -410167170] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI31N0
 g := ![161584345, 320992401, -83267541, 180745686, -410167170]
 hmem := by decide

def P31P0 : CertificateIrreducibleZModOfList' 31 3 2 4 [17, 30, 27, 1] where
 m := 1
 P := ![3]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [23, 24, 10], [12, 6, 21], [0, 1]]
 g := ![![[26, 6, 14], [14, 28, 2], [14, 10, 16], [1]],![[28, 22, 29, 20], [7, 6, 28, 7], [0, 6, 23, 28], [28, 13, 9, 8]],![[18, 6, 14, 29], [20, 23, 27, 27], [8, 19, 1, 6], [21, 5, 1, 23]]]
 h' := ![![[23, 24, 10], [10, 10, 13], [10, 9, 8], [14, 1, 4], [0, 1]],![[12, 6, 21], [1, 26, 23], [27, 8, 14], [4, 13, 3], [23, 24, 10]],![[0, 1], [14, 26, 26], [18, 14, 9], [7, 17, 24], [12, 6, 21]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [16, 25], []]
 b := ![[], [30, 25, 13], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI31N0 : PrimeIdeal O 31 where 
  r := 5
  n := 3
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I31N0
  hcard := NI31N0
  P := [17, 30, 27, 1]
  f := ofList [17, 30, 27, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P31P0
  hneq := by decide
  hlen := by decide
  c := ![38432857, 190146441, 129891519, 180745686, -410167170]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI31N0
  hpmem := by 
    show  _ ∈ I31N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI31N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI31N0 : Ideal.IsPrime I31N0 := PrimeIdeal_isPrime PI31N0
def I31N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![31, 0, 0, 0, 0], ![12, 1, 0, 0, 0]] i)))

def SI31N1: IdealEqSpanCertificate O ℤ timesTableO I31N1
 ![![31, 0, 0, 0, 0], ![12, 1, 0, 0, 0]] 
 ![![31, 0, 0, 0, 0], ![12, 1, 0, 0, 0], ![11, 0, 1, 0, 0], ![21, 0, 0, 1, 0], ![24, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![31, 0, 0, 0, 0], ![0, 31, 0, 0, 0], ![0, 0, 31, 0, 0], ![0, 0, 0, 31, 0], ![0, 0, 0, 0, 31]], ![![12, 1, 0, 0, 0], ![0, 12, 1, 0, 0], ![0, 1, 12, 2, 0], ![15, -70, -41, -39, 126], ![3, -27, -16, -20, 63]]]
  hmulB := by decide
  f := ![![![-147833, -29888, -307501, -49972, -5292], ![380277, -13547, 799955, 1302, 0]], ![![-98568, -19926, -204949, -33306, -3528], ![253550, -9021, 533169, 868, 0]], ![![-98563, -19925, -204937, -33304, -3528], ![253537, -9020, 533138, 868, 0]], ![![-98565, -19928, -205003, -33315, -3528], ![253543, -9027, 533309, 868, 0]], ![![-114456, -23136, -238065, -38688, -4097], ![294420, -10497, 619320, 1008, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-12, 31, 0, 0, 0], ![-11, 0, 31, 0, 0], ![-21, 0, 0, 31, 0], ![-24, 0, 0, 0, 31]], ![![0, 1, 0, 0, 0], ![-5, 12, 1, 0, 0], ![-6, 1, 12, 2, 0], ![-29, -70, -41, -39, 126], ![-19, -27, -16, -20, 63]]]
  hle1 := by decide
  hle2 := by decide

lemma NI31N1 : Nat.card (O ⧸ I31N1) = 31 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI31N1)

lemma isPrimeI31N1 : Ideal.IsPrime I31N1 := prime_ideal_of_norm_prime hp31.out _ NI31N1
def I31N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![31, 0, 0, 0, 0], ![-11, 1, 0, 0, 0]] i)))

def SI31N2: IdealEqSpanCertificate O ℤ timesTableO I31N2
 ![![31, 0, 0, 0, 0], ![-11, 1, 0, 0, 0]] 
 ![![31, 0, 0, 0, 0], ![20, 1, 0, 0, 0], ![3, 0, 1, 0, 0], ![22, 0, 0, 1, 0], ![25, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![31, 0, 0, 0, 0], ![0, 31, 0, 0, 0], ![0, 0, 31, 0, 0], ![0, 0, 0, 31, 0], ![0, 0, 0, 0, 31]], ![![-11, 1, 0, 0, 0], ![0, -11, 1, 0, 0], ![0, 1, -11, 2, 0], ![15, -70, -41, -62, 126], ![3, -27, -16, -20, 40]]]
  hmulB := by decide
  f := ![![![4556658, -1758189, 19755478, -3558738, -72576], ![12865837, 1166003, 55713975, 17856, 0]], ![![3037754, -1172117, 13170318, -2372492, -48384], ![8577174, 777356, 37142650, 11904, 0]], ![![569582, -219766, 2469400, -444836, -9072], ![1608229, 145763, 6964150, 2232, 0]], ![![3227638, -1245383, 13993465, -2520773, -51408], ![9113316, 825923, 39464070, 12648, 0]], ![![3674710, -1417892, 15931837, -2869950, -58529], ![10375635, 940328, 44930625, 14400, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-20, 31, 0, 0, 0], ![-3, 0, 31, 0, 0], ![-22, 0, 0, 31, 0], ![-25, 0, 0, 0, 31]], ![![-1, 1, 0, 0, 0], ![7, -11, 1, 0, 0], ![-1, 1, -11, 2, 0], ![-8, -70, -41, -62, 126], ![1, -27, -16, -20, 40]]]
  hle1 := by decide
  hle2 := by decide

lemma NI31N2 : Nat.card (O ⧸ I31N2) = 31 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI31N2)

lemma isPrimeI31N2 : Ideal.IsPrime I31N2 := prime_ideal_of_norm_prime hp31.out _ NI31N2
def MulI31N0 : IdealMulEqCertificate O ℤ timesTableO (I31N0) I31N1
  ![![31, 0, 0, 0, 0], ![-114, -59, -38, -48, 125]] ![![31, 0, 0, 0, 0], ![12, 1, 0, 0, 0]]
  ![![31, 0, 0, 0, 0], ![-216, -127, -75, -98, 256]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![961, 0, 0, 0, 0], ![372, 31, 0, 0, 0]], ![![-3534, -1829, -1178, -1488, 3875], ![-1713, -875, -547, -704, 1827]]]
 hmul := by decide
 f :=  ![![![![-14600739218222, -2949664667385, -30346675025547, -4931570555238, -522561462055], ![37557901588896, -1338755752408, 78946409018928, 128563599626, 0]], ![![3133772, 0, 0, 0, 0], ![837, 0, 0, 0, 0]]], ![![![101735056321626, 20552678640473, 211449615444450, 34362205960436, 3641104671422], ![-261696012534748, 9328184678779, -550082927164838, -895805674862, 0]], ![![-21835502, 0, 0, 0, 0], ![-5832, 0, 0, 0, 0]]]]
 g :=  ![![![![31, 0, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![12, 1, 0, 0, 0], ![0, 0, 0, 0, 0]]], ![![![102, 68, 37, 50, -131], ![31, 0, 0, 0, 0]], ![![105, 66, 38, 50, -131], ![23, 0, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI31N1 : IdealMulEqCertificate O ℤ timesTableO (I31N0*I31N1) I31N2
  ![![31, 0, 0, 0, 0], ![-216, -127, -75, -98, 256]] ![![31, 0, 0, 0, 0], ![-11, 1, 0, 0, 0]]
  ![![31, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI31N0
 hI2 := rfl
 M :=  ![![![961, 0, 0, 0, 0], ![-341, 31, 0, 0, 0]], ![![-6696, -3937, -2325, -3038, 7936], ![1674, 1054, 620, 806, -2108]]]
 hmul := by decide
 f :=  ![![![![563831392958194, -52239528321607, 43308908032610, -7833996751278, -159773815536], ![1589032983817983, 8136498881581, 122645541933525, 39309421176, 0]], ![![4740, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![31, 0, 0, 0, 0]], ![![-11, 1, 0, 0, 0]]], ![![![-216, -127, -75, -98, 256]], ![![54, 34, 20, 26, -68]]]]
 hle1 := by decide
 hle2 := by decide

def PBC31 : PrimesBelowPCertificate 31 ![I31N0, I31N1, I31N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI31N0
    exact isPrimeI31N1
    exact isPrimeI31N2
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI31N1, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp37 : Fact (Nat.Prime 37) := {out := by norm_num}
def I37N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, 0, 0, 0, 0], ![-23, 7, -4, -5, 13]] i)))

def SI37N0: IdealEqSpanCertificate O ℤ timesTableO I37N0
 ![![37, 0, 0, 0, 0], ![-23, 7, -4, -5, 13]] 
 ![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![33, 15, 1, 0, 0], ![30, 34, 0, 1, 0], ![0, 4, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![0, 0, 37, 0, 0], ![0, 0, 0, 37, 0], ![0, 0, 0, 0, 37]], ![![-23, 7, -4, -5, 13], ![-36, -28, 4, -13, 33], ![-96, -13, -23, 11, 45], ![168, -1038, -594, -747, 1824], ![-26, -420, -242, -302, 761]]]
  hmulB := by decide
  f := ![![![1088942435, 1424073975, -272985885, 469841931, -1185610019], ![-858036586, 1667286452, 35409, 0, 0]], ![![976281881, 1276741162, -244743126, 421232703, -1062948367], ![-769265261, 1494791194, 31746, 0, 0]], ![![1365994032, 1786390626, -342439673, 589380351, -1487256039], ![-1076340519, 2091481860, 44418, 0, 0]], ![![1780050198, 2327876180, -446238994, 768031619, -1938068790], ![-1402597728, 2725445788, 57882, 0, 0]], ![![105543989, 138026071, -26458716, 45538671, -114913338], ![-83163809, 161599048, 3432, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![-33, -15, 37, 0, 0], ![-30, -34, 0, 37, 0], ![0, -4, 0, 0, 37]], ![![7, 5, -4, -5, 13], ![6, 6, 4, -13, 33], ![9, -6, -23, 11, 45], ![1140, 702, -594, -747, 1824], ![460, 282, -242, -302, 761]]]
  hle1 := by decide
  hle2 := by decide

lemma NI37N0 : Nat.card (O ⧸ I37N0) = 1369 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI37N0)

def MemCI37N0 : IdealMemCertificate O ℤ B I37N0
  ![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![33, 15, 1, 0, 0], ![30, 34, 0, 1, 0], ![0, 4, 0, 0, 1]] ![6876, -314832, -195654, -248450, 595308] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI37N0
 g := ![376134, 234758, -195654, -248450, 595308]
 hmem := by decide

def P37P0 : CertificateIrreducibleZModOfList' 37 2 2 5 [33, 4, 1] where
 m := 1
 P := ![2]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [33, 36], [0, 1]]
 g := ![![[36, 9], [25], [20, 3], [16], [1]],![[0, 28], [25], [8, 34], [16], [1]]]
 h' := ![![[33, 36], [25, 34], [6, 5], [6, 15], [4, 33], [0, 1]],![[0, 1], [0, 3], [23, 32], [20, 22], [20, 4], [33, 36]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [23]]
 b := ![[], [23, 30]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI37N0 : PrimeIdeal O 37 where 
  r := 5
  n := 2
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I37N0
  hcard := NI37N0
  P := [33, 4, 1]
  f := ofList [33, 4, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P37P0
  hneq := by decide
  hlen := by decide
  c := ![6876, -314832, -195654, -248450, 595308]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI37N0
  hpmem := by 
    show  _ ∈ I37N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI37N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI37N0 : Ideal.IsPrime I37N0 := PrimeIdeal_isPrime PI37N0
def I37N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, 0, 0, 0, 0], ![14, 1, 0, 0, 0]] i)))

def SI37N1: IdealEqSpanCertificate O ℤ timesTableO I37N1
 ![![37, 0, 0, 0, 0], ![14, 1, 0, 0, 0]] 
 ![![37, 0, 0, 0, 0], ![14, 1, 0, 0, 0], ![26, 0, 1, 0, 0], ![33, 0, 0, 1, 0], ![19, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![0, 0, 37, 0, 0], ![0, 0, 0, 37, 0], ![0, 0, 0, 0, 37]], ![![14, 1, 0, 0, 0], ![0, 14, 1, 0, 0], ![0, 1, 14, 2, 0], ![15, -70, -41, -37, 126], ![3, -27, -16, -20, 65]]]
  hmulB := by decide
  f := ![![![6546235, 3106300, 48958442, 7012610, -38556], ![-17312892, 2335440, -129523828, 11322, 0]], ![![2909414, 1380567, 21759115, 3116688, -17136], ![-7694556, 1037961, -57565636, 5032, 0]], ![![5091456, 2415987, 38078451, 5454204, -29988], ![-13465424, 1816442, -100739863, 8806, 0]], ![![5818897, 2761156, 43518628, 6233433, -34272], ![-15389294, 2075952, -115132326, 10064, 0]], ![![3361565, 1595132, 25140822, 3601070, -19799], ![-8890364, 1199264, -66512236, 5814, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-14, 37, 0, 0, 0], ![-26, 0, 37, 0, 0], ![-33, 0, 0, 37, 0], ![-19, 0, 0, 0, 37]], ![![0, 1, 0, 0, 0], ![-6, 14, 1, 0, 0], ![-12, 1, 14, 2, 0], ![24, -70, -41, -37, 126], ![6, -27, -16, -20, 65]]]
  hle1 := by decide
  hle2 := by decide

lemma NI37N1 : Nat.card (O ⧸ I37N1) = 37 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI37N1)

lemma isPrimeI37N1 : Ideal.IsPrime I37N1 := prime_ideal_of_norm_prime hp37.out _ NI37N1
def I37N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, 0, 0, 0, 0], ![15, 1, 0, 0, 0]] i)))

def SI37N2: IdealEqSpanCertificate O ℤ timesTableO I37N2
 ![![37, 0, 0, 0, 0], ![15, 1, 0, 0, 0]] 
 ![![37, 0, 0, 0, 0], ![15, 1, 0, 0, 0], ![34, 0, 1, 0, 0], ![15, 0, 0, 1, 0], ![10, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![0, 0, 37, 0, 0], ![0, 0, 0, 37, 0], ![0, 0, 0, 0, 37]], ![![15, 1, 0, 0, 0], ![0, 15, 1, 0, 0], ![0, 1, 15, 2, 0], ![15, -70, -41, -36, 126], ![3, -27, -16, -20, 66]]]
  hmulB := by decide
  f := ![![![486136, 352151, 6541922, 877344, -16380], ![-1203943, 310356, -16144284, 4810, 0]], ![![291570, 211238, 3924296, 526292, -9828], ![-722091, 186184, -9684454, 2886, 0]], ![![486082, 352136, 6541533, 877292, -16380], ![-1203810, 310320, -16143322, 4810, 0]], ![![194460, 140861, 2616794, 350941, -6552], ![-481591, 124146, -6457776, 1924, 0]], ![![131380, 95175, 1768087, 237120, -4427], ![-325370, 83881, -4363320, 1300, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-15, 37, 0, 0, 0], ![-34, 0, 37, 0, 0], ![-15, 0, 0, 37, 0], ![-10, 0, 0, 0, 37]], ![![0, 1, 0, 0, 0], ![-7, 15, 1, 0, 0], ![-15, 1, 15, 2, 0], ![47, -70, -41, -36, 126], ![16, -27, -16, -20, 66]]]
  hle1 := by decide
  hle2 := by decide

lemma NI37N2 : Nat.card (O ⧸ I37N2) = 37 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI37N2)

lemma isPrimeI37N2 : Ideal.IsPrime I37N2 := prime_ideal_of_norm_prime hp37.out _ NI37N2
def I37N3 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![37, 0, 0, 0, 0], ![-7, 1, 0, 0, 0]] i)))

def SI37N3: IdealEqSpanCertificate O ℤ timesTableO I37N3
 ![![37, 0, 0, 0, 0], ![-7, 1, 0, 0, 0]] 
 ![![37, 0, 0, 0, 0], ![30, 1, 0, 0, 0], ![25, 0, 1, 0, 0], ![17, 0, 0, 1, 0], ![21, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![37, 0, 0, 0, 0], ![0, 37, 0, 0, 0], ![0, 0, 37, 0, 0], ![0, 0, 0, 37, 0], ![0, 0, 0, 0, 37]], ![![-7, 1, 0, 0, 0], ![0, -7, 1, 0, 0], ![0, 1, -7, 2, 0], ![15, -70, -41, -58, 126], ![3, -27, -16, -20, 44]]]
  hmulB := by decide
  f := ![![![3218443, -4604855, 31609895, -8987448, -102816], ![17076462, 1675249, 167143356, 30192, 0]], ![![2682036, -3837380, 26341593, -7489544, -85680], ![14230386, 1396047, 139286204, 25160, 0]], ![![2279723, -3261765, 22390338, -6366108, -72828], ![12095788, 1186665, 118393192, 21386, 0]], ![![1475119, -2110554, 14487868, -4119247, -47124], ![7826708, 767846, 76607372, 13838, 0]], ![![1826685, -2613565, 17940751, -5100984, -58355], ![9692052, 950825, 94865148, 17136, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-30, 37, 0, 0, 0], ![-25, 0, 37, 0, 0], ![-17, 0, 0, 37, 0], ![-21, 0, 0, 0, 37]], ![![-1, 1, 0, 0, 0], ![5, -7, 1, 0, 0], ![3, 1, -7, 2, 0], ![40, -70, -41, -58, 126], ![17, -27, -16, -20, 44]]]
  hle1 := by decide
  hle2 := by decide

lemma NI37N3 : Nat.card (O ⧸ I37N3) = 37 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI37N3)

lemma isPrimeI37N3 : Ideal.IsPrime I37N3 := prime_ideal_of_norm_prime hp37.out _ NI37N3
def MulI37N0 : IdealMulEqCertificate O ℤ timesTableO (I37N0) I37N1
  ![![37, 0, 0, 0, 0], ![-23, 7, -4, -5, 13]] ![![37, 0, 0, 0, 0], ![14, 1, 0, 0, 0]]
  ![![37, 0, 0, 0, 0], ![65, 66, 30, 37, -96]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![1369, 0, 0, 0, 0], ![518, 37, 0, 0, 0]], ![![-851, 259, -148, -185, 481], ![-358, 70, -52, -83, 215]]]
 hmul := by decide
 f :=  ![![![![956796558190499995995, 430278743326995661724, 6749584028828259549173, 965489436151375664876, -120934193135955678], ![-2528714666790278699866, 319413187115186612337, -17860897588893409676452, 35512403672000618, 0]], ![![175561962556, 0, 0, 0, 0], ![181153258, 8880, 0, 0, 0]]], ![![![1538633294724806322859, 691935181860730479866, 10854067798841576998003, 1552612391266372025909, -194475381873827752], ![-4066449179688425206380, 513651267098036600663, -28722272743031568689248, 57107821090811848, 0]], ![![282322797426, 0, 0, 0, 0], ![291314210, 14280, 0, 0, 0]]]]
 g :=  ![![![![261337, -153409, 28655, 6882, -306], ![216783, -88985, 0, 0, 0]], ![![97488, -57200, 10695, 2576, -138], ![80845, -33189, 0, 0, 0]]], ![![![-172390, 101123, -18924, -4572, 289], ![-142931, 58682, 0, 0, 0]], ![![-71074, 41626, -7816, -1907, 179], ![-58872, 24180, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI37N1 : IdealMulEqCertificate O ℤ timesTableO (I37N0*I37N1) I37N2
  ![![37, 0, 0, 0, 0], ![65, 66, 30, 37, -96]] ![![37, 0, 0, 0, 0], ![15, 1, 0, 0, 0]]
  ![![37, 0, 0, 0, 0], ![92, 86, 41, 48, -124]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI37N0
 hI2 := rfl
 M :=  ![![![1369, 0, 0, 0, 0], ![555, 37, 0, 0, 0]], ![![2405, 2442, 1110, 1369, -3552], ![1242, 1087, 535, 648, -1674]]]
 hmul := by decide
 f :=  ![![![![17376572972498186900, 10158676499882887346, 187753880983658246110, 25067477733628343787, -9013974060952542], ![-42864860289609854350, 8725320654941437037, -463700692777663780544, 2646960160043752, 0]], ![![-625934579, 0, 0, 0, 0], ![-259, 0, 0, 0, 0]]], ![![![43209238011705517680, 25260945956494472960, 466875841622180148793, 62333730215950297674, -22414485943084240], ![-106589369119196139060, 21696709558582907824, -1153055532419075370890, 6582030400577282, 0]], ![![-1556472398, 0, 0, 0, 0], ![-644, 0, 0, 0, 0]]]]
 g :=  ![![![![-55, -86, -41, -48, 124], ![37, 0, 0, 0, 0]], ![![-77, -85, -41, -48, 124], ![37, 0, 0, 0, 0]]], ![![![-27, -20, -11, -11, 28], ![37, 0, 0, 0, 0]], ![![-46, -45, -21, -24, 62], ![32, 0, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI37N2 : IdealMulEqCertificate O ℤ timesTableO (I37N0*I37N1*I37N2) I37N3
  ![![37, 0, 0, 0, 0], ![92, 86, 41, 48, -124]] ![![37, 0, 0, 0, 0], ![-7, 1, 0, 0, 0]]
  ![![37, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI37N1
 hI2 := rfl
 M :=  ![![![1369, 0, 0, 0, 0], ![-259, 37, 0, 0, 0]], ![![3404, 3182, 1517, 1776, -4588], ![-296, -481, -185, -222, 592]]]
 hmul := by decide
 f :=  ![![![![376426877609, -538602461342, 3697237167136, -1051212797280, -12025858272], ![1997252208496, 195944337374, 19549847429316, 3531402324, 0]], ![![-510, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![37, 0, 0, 0, 0]], ![![-7, 1, 0, 0, 0]]], ![![![92, 86, 41, 48, -124]], ![![-8, -13, -5, -6, 16]]]]
 hle1 := by decide
 hle2 := by decide

def PBC37 : PrimesBelowPCertificate 37 ![I37N0, I37N1, I37N2, I37N3] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI37N0
    exact isPrimeI37N1
    exact isPrimeI37N2
    exact isPrimeI37N3
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI37N2, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp41 : Fact (Nat.Prime 41) := {out := by norm_num}
def I41N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![41, 0, 0, 0, 0], ![1, -18, -4, -5, 13]] i)))

def SI41N0: IdealEqSpanCertificate O ℤ timesTableO I41N0
 ![![41, 0, 0, 0, 0], ![1, -18, -4, -5, 13]] 
 ![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![28, 33, 1, 0, 0], ![30, 3, 0, 1, 0], ![36, 32, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![0, 0, 41, 0, 0], ![0, 0, 0, 41, 0], ![0, 0, 0, 0, 41]], ![![1, -18, -4, -5, 13], ![-36, -4, -21, -13, 33], ![-96, -38, 1, -39, 45], ![-207, 712, 431, 552, -1326], ![-101, 255, 158, 198, -490]]]
  hmulB := by decide
  f := ![![![217305673, -5906320, 119138970, 69574874, -176087562], ![-68047536, 245566630, 11316, 0, 0]], ![![181080744, -4921731, 99278464, 57976720, -146733708], ![-56703984, 204630590, 9430, 0, 0]], ![![293710129, -7982975, 161028112, 94037330, -237999772], ![-91972981, 331907610, 15295, 0, 0]], ![![172253961, -4681815, 94439136, 55150646, -139581177], ![-53939931, 194655870, 8970, 0, 0]], ![![332136293, -9027378, 182095460, 106340259, -269137346], ![-104005801, 375331160, 17296, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![-28, -33, 41, 0, 0], ![-30, -3, 0, 41, 0], ![-36, -32, 0, 0, 41]], ![![-5, -7, -4, -5, 13], ![-6, -8, -21, -13, 33], ![-14, -34, 1, -39, 45], ![461, 665, 431, 552, -1326], ![175, 247, 158, 198, -490]]]
  hle1 := by decide
  hle2 := by decide

lemma NI41N0 : Nat.card (O ⧸ I41N0) = 1681 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI41N0)

def MemCI41N0 : IdealMemCertificate O ℤ B I41N0
  ![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![28, 33, 1, 0, 0], ![30, 3, 0, 1, 0], ![36, 32, 0, 0, 1]] ![6016, -310882, -193364, -245590, 588168] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI41N0
 g := ![-204540, -293036, -193364, -245590, 588168]
 hmem := by decide

def P41P0 : CertificateIrreducibleZModOfList' 41 2 2 5 [23, 14, 1] where
 m := 1
 P := ![2]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [27, 40], [0, 1]]
 g := ![![[22, 25], [18], [1], [32, 32], [1]],![[0, 16], [18], [1], [35, 9], [1]]]
 h' := ![![[27, 40], [29, 5], [22, 31], [2, 1], [18, 27], [0, 1]],![[0, 1], [0, 36], [39, 10], [29, 40], [9, 14], [27, 40]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [11]]
 b := ![[], [18, 26]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI41N0 : PrimeIdeal O 41 where 
  r := 5
  n := 2
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I41N0
  hcard := NI41N0
  P := [23, 14, 1]
  f := ofList [23, 14, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P41P0
  hneq := by decide
  hlen := by decide
  c := ![6016, -310882, -193364, -245590, 588168]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI41N0
  hpmem := by 
    show  _ ∈ I41N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI41N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI41N0 : Ideal.IsPrime I41N0 := PrimeIdeal_isPrime PI41N0
def I41N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![41, 0, 0, 0, 0], ![-28, -1, -4, -5, 13]] i)))

def SI41N1: IdealEqSpanCertificate O ℤ timesTableO I41N1
 ![![41, 0, 0, 0, 0], ![-28, -1, -4, -5, 13]] 
 ![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![11, 18, 1, 0, 0], ![24, 8, 0, 1, 0], ![1, 18, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![0, 0, 41, 0, 0], ![0, 0, 0, 41, 0], ![0, 0, 0, 0, 41]], ![![-28, -1, -4, -5, 13], ![-36, -33, -4, -13, 33], ![-96, -21, -28, -5, 45], ![48, -478, -266, -344, 816], ![-50, -204, -114, -142, 348]]]
  hmulB := by decide
  f := ![![![1257681085, 2062247361, 106983780, 642578949, -1619842965], ![-1511612313, 2607972198, 31980, 0, 0]], ![![677202984, 1110424645, 57605808, 345998988, -872210376], ![-813933189, 1404272181, 17220, 0, 0]], ![![633555459, 1038854840, 53892961, 323698438, -815994110], ![-761473046, 1313763126, 16110, 0, 0]], ![![868340748, 1423837411, 73864812, 443655776, -1118388159], ![-1043662437, 1800622200, 22080, 0, 0]], ![![327983781, 537802219, 27899716, 167574653, -422429996], ![-394205107, 680118816, 8340, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![-11, -18, 41, 0, 0], ![-24, -8, 0, 41, 0], ![-1, -18, 0, 0, 41]], ![![3, -3, -4, -5, 13], ![7, -11, -4, -13, 33], ![7, -7, -28, -5, 45], ![254, -186, -266, -344, 816], ![104, -80, -114, -142, 348]]]
  hle1 := by decide
  hle2 := by decide

lemma NI41N1 : Nat.card (O ⧸ I41N1) = 1681 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI41N1)

def MemCI41N1 : IdealMemCertificate O ℤ B I41N1
  ![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![11, 18, 1, 0, 0], ![24, 8, 0, 1, 0], ![1, 18, 0, 0, 1]] ![354209, -13656491, -8601188, -9931671, 25029603] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI41N1
 g := ![7519458, -5607673, -8601188, -9931671, 25029603]
 hmem := by decide

def P41P1 : CertificateIrreducibleZModOfList' 41 2 2 5 [5, 28, 1] where
 m := 1
 P := ![2]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [13, 40], [0, 1]]
 g := ![![[22, 33], [8], [10], [17, 5], [1]],![[0, 8], [8], [10], [0, 36], [1]]]
 h' := ![![[13, 40], [1, 22], [0, 34], [38, 16], [36, 13], [0, 1]],![[0, 1], [0, 19], [32, 7], [0, 25], [0, 28], [13, 40]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [3]]
 b := ![[], [21, 22]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI41N1 : PrimeIdeal O 41 where 
  r := 5
  n := 2
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I41N1
  hcard := NI41N1
  P := [5, 28, 1]
  f := ofList [5, 28, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P41P1
  hneq := by decide
  hlen := by decide
  c := ![354209, -13656491, -8601188, -9931671, 25029603]
  a := ![-526, 2412, 1421, 1723, -4419]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI41N1
  hpmem := by 
    show  _ ∈ I41N1.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI41N1]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI41N1 : Ideal.IsPrime I41N1 := PrimeIdeal_isPrime PI41N1
def I41N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![41, 0, 0, 0, 0], ![-10, 1, 0, 0, 0]] i)))

def SI41N2: IdealEqSpanCertificate O ℤ timesTableO I41N2
 ![![41, 0, 0, 0, 0], ![-10, 1, 0, 0, 0]] 
 ![![41, 0, 0, 0, 0], ![31, 1, 0, 0, 0], ![23, 0, 1, 0, 0], ![38, 0, 0, 1, 0], ![25, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![41, 0, 0, 0, 0], ![0, 41, 0, 0, 0], ![0, 0, 41, 0, 0], ![0, 0, 0, 41, 0], ![0, 0, 0, 0, 41]], ![![-10, 1, 0, 0, 0], ![0, -10, 1, 0, 0], ![0, 1, -10, 2, 0], ![15, -70, -41, -61, 126], ![3, -27, -16, -20, 41]]]
  hmulB := by decide
  f := ![![![-3786239, 601228, -1961314, 426072, -61236], ![-15493695, -36490, -8126733, 19926, 0]], ![![-2944869, 467627, -1525480, 331392, -47628], ![-12050719, -28372, -6320847, 15498, 0]], ![![-2243707, 356291, -1162285, 252492, -36288], ![-9181489, -21606, -4815942, 11808, 0]], ![![-3505772, 556684, -1816030, 394511, -56700], ![-14345994, -33820, -7524750, 18450, 0]], ![![-2308675, 366600, -1195923, 259800, -37339], ![-9447345, -22257, -4955325, 12150, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-31, 41, 0, 0, 0], ![-23, 0, 41, 0, 0], ![-38, 0, 0, 41, 0], ![-25, 0, 0, 0, 41]], ![![-1, 1, 0, 0, 0], ![7, -10, 1, 0, 0], ![3, 1, -10, 2, 0], ![56, -70, -41, -61, 126], ![23, -27, -16, -20, 41]]]
  hle1 := by decide
  hle2 := by decide

lemma NI41N2 : Nat.card (O ⧸ I41N2) = 41 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI41N2)

lemma isPrimeI41N2 : Ideal.IsPrime I41N2 := prime_ideal_of_norm_prime hp41.out _ NI41N2
def MulI41N0 : IdealMulEqCertificate O ℤ timesTableO (I41N0) I41N1
  ![![41, 0, 0, 0, 0], ![1, -18, -4, -5, 13]] ![![41, 0, 0, 0, 0], ![-28, -1, -4, -5, 13]]
  ![![41, 0, 0, 0, 0], ![-268, -170, -91, -123, 323]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![1681, 0, 0, 0, 0], ![-1148, -41, -164, -205, 533]], ![![41, -738, -164, -205, 533], ![114, 415, 28, 123, -317]]]
 hmul := by decide
 f :=  ![![![![18073362411703478645157573, 29636153639577852537105816, 1537203740627733405172453, 9234459129337347673648393, -23278305841785637674786957], ![-21722667993163078447870222, 37478931607054372643158140, 10675359168183110350, 0, 0]], ![![28788775076064, 1362072569, 0, 0, 0], ![-1312, 0, 0, 0, 0]]], ![![![-118145742004450615009773340, -193731818249740229145730092, -10048715474818104903523951, -60365747169372573347369929, 152170506717852194985987569], ![142001287303721250502150444, -245000132425947579512000056, -69784924429572767550, 0, 0]], ![![-188192496519536, -8903881340, 0, 0, 0], ![8576, 0, 0, 0, 0]]]]
 g :=  ![![![![41, 0, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![240, 169, 87, 118, -310], ![41, 0, 0, 0, 0]]], ![![![269, 152, 87, 118, -310], ![41, 0, 0, 0, 0]], ![![42, 35, 14, 21, -55], ![6, 0, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI41N1 : IdealMulEqCertificate O ℤ timesTableO (I41N0*I41N1) I41N2
  ![![41, 0, 0, 0, 0], ![-268, -170, -91, -123, 323]] ![![41, 0, 0, 0, 0], ![-10, 1, 0, 0, 0]]
  ![![41, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI41N0
 hI2 := rfl
 M :=  ![![![1681, 0, 0, 0, 0], ![-410, 41, 0, 0, 0]], ![![-10988, -6970, -3731, -5043, 13243], ![1804, 1230, 615, 861, -2255]]]
 hmul := by decide
 f :=  ![![![![-85892823251251, 9036893656555, -1016337154657, 213483436899, -30677706933], ![-352145602869477, 1359632038988, -4071947032428, 9982329570, 0]], ![![38571, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![41, 0, 0, 0, 0]], ![![-10, 1, 0, 0, 0]]], ![![![-268, -170, -91, -123, 323]], ![![44, 30, 15, 21, -55]]]]
 hle1 := by decide
 hle2 := by decide

def PBC41 : PrimesBelowPCertificate 41 ![I41N0, I41N1, I41N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI41N0
    exact isPrimeI41N1
    exact isPrimeI41N2
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI41N1, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp43 : Fact (Nat.Prime 43) := {out := by norm_num}
def I43N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![43, 0, 0, 0, 0], ![24, 4, -3, 1, -5]] i)))

def SI43N0: IdealEqSpanCertificate O ℤ timesTableO I43N0
 ![![43, 0, 0, 0, 0], ![24, 4, -3, 1, -5]] 
 ![![43, 0, 0, 0, 0], ![0, 43, 0, 0, 0], ![0, 0, 43, 0, 0], ![0, 0, 0, 43, 0], ![21, 25, 35, 17, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![43, 0, 0, 0, 0], ![0, 43, 0, 0, 0], ![0, 0, 43, 0, 0], ![0, 0, 0, 43, 0], ![0, 0, 0, 0, 43]], ![![24, 4, -3, 1, -5], ![0, 86, 43, 43, -129], ![258, 516, 387, 473, -1161], ![1806, -602, -172, -86, 258], ![808, -23, 71, 134, -326]]]
  hmulB := by decide
  f := ![![![-23, -4, 3, -1, 5], ![43, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 0, 1, 0], ![0, 0, 0, 0, 0]], ![![-9, -1, 2, 0, 2], ![17, 0, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![-21, -25, -35, -17, 43]], ![![3, 3, 4, 2, -5], ![63, 77, 106, 52, -129], ![573, 687, 954, 470, -1161], ![-84, -164, -214, -104, 258], ![178, 189, 267, 132, -326]]]
  hle1 := by decide
  hle2 := by decide

lemma NI43N0 : Nat.card (O ⧸ I43N0) = 3418801 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI43N0)

def MemCI43N0 : IdealMemCertificate O ℤ B I43N0
  ![![43, 0, 0, 0, 0], ![0, 43, 0, 0, 0], ![0, 0, 43, 0, 0], ![0, 0, 0, 43, 0], ![21, 25, 35, 17, 1]] ![-106449221159, -92942355445, -65064274865, -118626097088, 247995284838] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI43N0
 g := ![-123589539599, -146344755265, -203369749865, -100803393938, 247995284838]
 hmem := by decide

def P43P0 : CertificateIrreducibleZModOfList' 43 4 2 5 [39, 38, 36, 7, 1] where
 m := 1
 P := ![2]
 exp := ![2] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [30, 2, 10, 6], [2, 21, 39, 23], [4, 19, 37, 14], [0, 1]]
 g := ![![[29, 26, 1, 4], [27, 11, 7, 25], [26, 38, 40], [36, 1], []],![[36, 1, 9, 41, 24, 9], [5, 28, 41, 31, 24, 41], [39, 10, 41], [0, 8, 6, 33, 42, 31], [10, 40, 36]],![[7, 17, 24, 35, 24, 38], [8, 33, 28, 0, 39, 6], [21, 21, 15], [13, 14, 28, 18, 0, 35], [31, 26, 13]],![[19, 8, 9, 24, 4, 6], [21, 8, 31, 26, 30, 1], [5, 17, 10], [9, 2, 41, 4, 20, 1], [35, 8, 24]]]
 h' := ![![[30, 2, 10, 6], [22, 17, 18, 2], [28, 40, 1, 5], [15, 12, 42, 13], [0, 0, 1], [0, 1]],![[2, 21, 39, 23], [42, 35, 14, 25], [9, 32, 24, 10], [5, 27, 27, 27], [37, 29, 29, 16], [30, 2, 10, 6]],![[4, 19, 37, 14], [17, 5, 21, 21], [33, 4, 34, 41], [11, 17, 27, 31], [42, 42, 7, 40], [2, 21, 39, 23]],![[0, 1], [29, 29, 33, 38], [30, 10, 27, 30], [28, 30, 33, 15], [27, 15, 6, 30], [4, 19, 37, 14]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [13, 37, 21], []]
 b := ![[], [], [5, 35, 12, 29], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI43N0 : PrimeIdeal O 43 where 
  r := 5
  n := 4
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I43N0
  hcard := NI43N0
  P := [39, 38, 36, 7, 1]
  f := ofList [39, 38, 36, 7, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P43P0
  hneq := by decide
  hlen := by decide
  c := ![-106449221159, -92942355445, -65064274865, -118626097088, 247995284838]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI43N0
  hpmem := by 
    show  _ ∈ I43N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI43N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI43N0 : Ideal.IsPrime I43N0 := PrimeIdeal_isPrime PI43N0
def I43N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![43, 0, 0, 0, 0], ![0, 1, 0, 0, 0]] i)))

def SI43N1: IdealEqSpanCertificate O ℤ timesTableO I43N1
 ![![43, 0, 0, 0, 0], ![0, 1, 0, 0, 0]] 
 ![![43, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![38, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![43, 0, 0, 0, 0], ![0, 43, 0, 0, 0], ![0, 0, 43, 0, 0], ![0, 0, 0, 43, 0], ![0, 0, 0, 0, 43]], ![![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 1, 0, 2, 0], ![15, -70, -41, -51, 126], ![3, -27, -16, -20, 51]]]
  hmulB := by decide
  f := ![![![-344, -24183, 0, -50439, -2898], ![-559, 40549, 1109658, 989, 0]], ![![0, 0, 0, 0, 0], ![1, 0, 0, 0, 0]], ![![0, 0, 0, 0, 0], ![0, 1, 0, 0, 0]], ![![0, -1, 0, -1, 0], ![21, 0, 22, 0, 0]], ![![-304, -21371, 0, -44574, -2561], ![-495, 35834, 980628, 874, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 43, 0, 0, 0], ![0, 0, 43, 0, 0], ![0, 0, 0, 43, 0], ![-38, 0, 0, 0, 43]], ![![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 1, 0, 2, 0], ![-111, -70, -41, -51, 126], ![-45, -27, -16, -20, 51]]]
  hle1 := by decide
  hle2 := by decide

lemma NI43N1 : Nat.card (O ⧸ I43N1) = 43 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI43N1)

lemma isPrimeI43N1 : Ideal.IsPrime I43N1 := prime_ideal_of_norm_prime hp43.out _ NI43N1
def MulI43N0 : IdealMulEqCertificate O ℤ timesTableO (I43N0) I43N1
  ![![43, 0, 0, 0, 0], ![24, 4, -3, 1, -5]] ![![43, 0, 0, 0, 0], ![0, 1, 0, 0, 0]]
  ![![43, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![1849, 0, 0, 0, 0], ![0, 43, 0, 0, 0]], ![![1032, 172, -129, 43, -215], ![0, 86, 43, 43, -129]]]
 hmul := by decide
 f :=  ![![![![-480001214, -2979562087276, 0, -5965195180975, -4032160814], ![-69292141530, 56418105073, 128286785774380, 1376053637, 0]], ![![-31348, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![43, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]]], ![![![24, 4, -3, 1, -5]], ![![0, 2, 1, 1, -3]]]]
 hle1 := by decide
 hle2 := by decide

def PBC43 : PrimesBelowPCertificate 43 ![I43N0, I43N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI43N0
    exact isPrimeI43N1
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI43N0, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp47 : Fact (Nat.Prime 47) := {out := by norm_num}
def I47N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![47, 0, 0, 0, 0], ![26, 3, 10, 12, -31]] i)))

def SI47N0: IdealEqSpanCertificate O ℤ timesTableO I47N0
 ![![47, 0, 0, 0, 0], ![26, 3, 10, 12, -31]] 
 ![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![0, 0, 47, 0, 0], ![12, 11, 34, 1, 0], ![22, 36, 28, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![0, 0, 47, 0, 0], ![0, 0, 0, 47, 0], ![0, 0, 0, 0, 47]], ![![26, 3, 10, 12, -31], ![87, 33, 7, 28, -69], ![213, -3, -11, -34, 9], ![-285, 1153, 620, 752, -1878], ![44, 471, 253, 311, -800]]]
  hmulB := by decide
  f := ![![![27927, 14703, -2490, 6812, -15931], ![28153, -23500, 0, 0, 0]], ![![-1421, -737, 115, -352, 826], ![-1363, 1175, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![6785, 3580, -613, 1651, -3859], ![6892, -5725, 0, 0, 0]], ![![11986, 6318, -1076, 2920, -6827], ![12130, -10100, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-12, -11, -34, 47, 0], ![-22, -36, -28, 0, 47]], ![![12, 21, 10, 12, -31], ![27, 47, 21, 28, -69], ![9, 1, 19, -34, 9], ![681, 1287, 588, 752, -1878], ![296, 550, 257, 311, -800]]]
  hle1 := by decide
  hle2 := by decide

lemma NI47N0 : Nat.card (O ⧸ I47N0) = 103823 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI47N0)

def MemCI47N0 : IdealMemCertificate O ℤ B I47N0
  ![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![0, 0, 47, 0, 0], ![12, 11, 34, 1, 0], ![22, 36, 28, 0, 1]] ![38448185, 189509272, 129495860, 180243352, -408962988] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI47N0
 g := ![146227951, 275095744, 116003948, 180243352, -408962988]
 hmem := by decide

def P47P0 : CertificateIrreducibleZModOfList' 47 3 2 5 [44, 19, 29, 1] where
 m := 1
 P := ![3]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [24, 10, 12], [41, 36, 35], [0, 1]]
 g := ![![[8, 17, 36], [13, 44, 28], [37, 43, 32], [23, 18, 1], []],![[42, 26, 44, 16], [26, 31, 37, 12], [40, 26, 46, 17], [31, 12, 37, 42], [12, 3]],![[7, 44, 9, 45], [15, 36, 35, 11], [46, 7, 19, 11], [36, 14, 37, 22], [36, 3]]]
 h' := ![![[24, 10, 12], [39, 33, 41], [17, 4, 13], [22, 40, 28], [0, 0, 1], [0, 1]],![[41, 36, 35], [26, 33, 39], [32, 2, 46], [23, 0, 31], [1, 26, 36], [24, 10, 12]],![[0, 1], [11, 28, 14], [32, 41, 35], [7, 7, 35], [3, 21, 10], [41, 36, 35]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [4, 11], []]
 b := ![[], [26, 10, 3], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI47N0 : PrimeIdeal O 47 where 
  r := 5
  n := 3
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I47N0
  hcard := NI47N0
  P := [44, 19, 29, 1]
  f := ofList [44, 19, 29, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P47P0
  hneq := by decide
  hlen := by decide
  c := ![38448185, 189509272, 129495860, 180243352, -408962988]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI47N0
  hpmem := by 
    show  _ ∈ I47N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI47N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI47N0 : Ideal.IsPrime I47N0 := PrimeIdeal_isPrime PI47N0
def I47N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![47, 0, 0, 0, 0], ![-20, 2, -4, -5, 13]] i)))

def SI47N1: IdealEqSpanCertificate O ℤ timesTableO I47N1
 ![![47, 0, 0, 0, 0], ![-20, 2, -4, -5, 13]] 
 ![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![44, 26, 1, 0, 0], ![39, 37, 0, 1, 0], ![27, 26, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![0, 0, 47, 0, 0], ![0, 0, 0, 47, 0], ![0, 0, 0, 0, 47]], ![![-20, 2, -4, -5, 13], ![-36, -25, -1, -13, 33], ![-96, -18, -20, 1, 45], ![93, -688, -389, -489, 1194], ![-41, -285, -162, -202, 509]]]
  hmulB := by decide
  f := ![![![21040549, 19599262, -496656, 8294931, -20960799], ![-14757201, 35665292, 1034, 0, 0]], ![![168242796, 156718229, -3971350, 66327299, -167605155], ![-118000785, 285184250, 8272, 0, 0]], ![![112320544, 104626632, -2651313, 44280757, -111894849], ![-78778491, 190391812, 5522, 0, 0]], ![![149905629, 139637143, -3538502, 59098134, -149337483], ![-105139587, 254101354, 7370, 0, 0]], ![![105157597, 97954342, -2482232, 41456868, -104759049], ![-73754594, 178250072, 5170, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![-44, -26, 47, 0, 0], ![-39, -37, 0, 47, 0], ![-27, -26, 0, 0, 47]], ![![0, -1, -4, -5, 13], ![-8, -8, -1, -13, 33], ![-10, -15, -20, 1, 45], ![86, -75, -389, -489, 1194], ![26, -39, -162, -202, 509]]]
  hle1 := by decide
  hle2 := by decide

lemma NI47N1 : Nat.card (O ⧸ I47N1) = 2209 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI47N1)

def MemCI47N1 : IdealMemCertificate O ℤ B I47N1
  ![![47, 0, 0, 0, 0], ![0, 47, 0, 0, 0], ![44, 26, 1, 0, 0], ![39, 37, 0, 1, 0], ![27, 26, 0, 0, 1]] ![363155, -13697495, -8625345, -9960962, 25104726] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI47N1
 g := ![1926133, -1566081, -8625345, -9960962, 25104726]
 hmem := by decide

def P47P1 : CertificateIrreducibleZModOfList' 47 2 2 5 [9, 11, 1] where
 m := 1
 P := ![2]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [36, 46], [0, 1]]
 g := ![![[43, 21], [30, 7], [26, 28], [42, 27], [1]],![[0, 26], [0, 40], [0, 19], [27, 20], [1]]]
 h' := ![![[36, 46], [12, 31], [1, 30], [45, 34], [38, 36], [0, 1]],![[0, 1], [0, 16], [0, 17], [0, 13], [18, 11], [36, 46]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [37]]
 b := ![[], [43, 42]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI47N1 : PrimeIdeal O 47 where 
  r := 5
  n := 2
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I47N1
  hcard := NI47N1
  P := [9, 11, 1]
  f := ofList [9, 11, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P47P1
  hneq := by decide
  hlen := by decide
  c := ![363155, -13697495, -8625345, -9960962, 25104726]
  a := ![-526, 2412, 1421, 1723, -4419]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI47N1
  hpmem := by 
    show  _ ∈ I47N1.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI47N1]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI47N1 : Ideal.IsPrime I47N1 := PrimeIdeal_isPrime PI47N1
def MulI47N0 : IdealMulEqCertificate O ℤ timesTableO (I47N0) I47N1
  ![![47, 0, 0, 0, 0], ![26, 3, 10, 12, -31]] ![![47, 0, 0, 0, 0], ![-20, 2, -4, -5, 13]]
  ![![47, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![2209, 0, 0, 0, 0], ![-940, 94, -188, -235, 611]], ![![1222, 141, 470, 564, -1457], ![799, 376, 47, 235, -564]]]
 hmul := by decide
 f :=  ![![![![3115202289014202759, 2901982341945461778, -73592703764804056, 1228240374119652349, -3103538661666970733], ![-2184955633055378627, 5280929041825077320, 1819638649686, 0, 0]], ![![-2067764760, -748, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![47, 0, 0, 0, 0]], ![![-20, 2, -4, -5, 13]]], ![![![26, 3, 10, 12, -31]], ![![17, 8, 1, 5, -12]]]]
 hle1 := by decide
 hle2 := by decide

def PBC47 : PrimesBelowPCertificate 47 ![I47N0, I47N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI47N0
    exact isPrimeI47N1
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI47N0, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp53 : Fact (Nat.Prime 53) := {out := by norm_num}
def I53N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![53, 0, 0, 0, 0], ![129, 79, 41, 53, -139]] i)))

def SI53N0: IdealEqSpanCertificate O ℤ timesTableO I53N0
 ![![53, 0, 0, 0, 0], ![129, 79, 41, 53, -139]] 
 ![![53, 0, 0, 0, 0], ![0, 53, 0, 0, 0], ![0, 0, 53, 0, 0], ![0, 0, 0, 53, 0], ![25, 49, 10, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![53, 0, 0, 0, 0], ![0, 53, 0, 0, 0], ![0, 0, 53, 0, 0], ![0, 0, 0, 53, 0], ![0, 0, 0, 0, 53]], ![![129, 79, 41, 53, -139], ![378, 213, 130, 159, -411], ![1152, 475, 270, 371, -927], ![1203, 134, -17, 0, -60], ![1055, 340, 157, 212, -562]]]
  hmulB := by decide
  f := ![![![-128, -79, -41, -53, 139], ![53, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 0, 1, 0], ![0, 0, 0, 0, 0]], ![![-19, -11, -6, -8, 21], ![8, 0, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![-25, -49, -10, 0, 53]], ![![68, 130, 27, 1, -139], ![201, 384, 80, 3, -411], ![459, 866, 180, 7, -927], ![51, 58, 11, 0, -60], ![285, 526, 109, 4, -562]]]
  hle1 := by decide
  hle2 := by decide

lemma NI53N0 : Nat.card (O ⧸ I53N0) = 7890481 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI53N0)

def MemCI53N0 : IdealMemCertificate O ℤ B I53N0
  ![![53, 0, 0, 0, 0], ![0, 53, 0, 0, 0], ![0, 0, 53, 0, 0], ![0, 0, 0, 53, 0], ![25, 49, 10, 0, 1]] ![-106449464531, -92931601387, -65057593775, -118617613752, 247974954402] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI53N0
 g := ![-118977798577, -231013289945, -48015229015, -2238068184, 247974954402]
 hmem := by decide

def P53P0 : CertificateIrreducibleZModOfList' 53 4 2 5 [39, 28, 2, 7, 1] where
 m := 1
 P := ![2]
 exp := ![2] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [46, 51, 11, 50], [19, 5, 42, 40], [34, 49, 0, 16], [0, 1]]
 g := ![![[26, 47, 42, 29], [26, 3, 40], [27, 7, 1, 42], [47, 46, 1], []],![[48, 42, 30, 14, 31, 19], [52, 31, 38], [27, 12, 21, 40, 35, 12], [42, 35, 37], [37, 37, 5, 14, 9, 26]],![[34, 11, 2, 52, 42, 47], [43, 15, 44], [13, 13, 37, 1, 33, 29], [10, 12, 29], [31, 25, 38, 5, 50, 29]],![[4, 4, 20, 9, 33, 40], [43, 29, 52], [33, 19, 19, 40, 42, 52], [48, 10, 29], [35, 46, 18, 18, 1, 15]]]
 h' := ![![[46, 51, 11, 50], [42, 5, 26, 20], [7, 38, 35, 26], [22, 17, 10, 28], [0, 0, 0, 1], [0, 1]],![[19, 5, 42, 40], [40, 4, 23, 33], [1, 36, 34, 41], [49, 42, 43, 46], [16, 36, 16, 39], [46, 51, 11, 50]],![[34, 49, 0, 16], [15, 1, 16, 20], [46, 16, 25, 16], [51, 13, 41, 13], [32, 21, 41, 33], [19, 5, 42, 40]],![[0, 1], [25, 43, 41, 33], [18, 16, 12, 23], [11, 34, 12, 19], [44, 49, 49, 33], [34, 49, 0, 16]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [5, 32, 31], []]
 b := ![[], [], [40, 5, 14, 35], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI53N0 : PrimeIdeal O 53 where 
  r := 5
  n := 4
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I53N0
  hcard := NI53N0
  P := [39, 28, 2, 7, 1]
  f := ofList [39, 28, 2, 7, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P53P0
  hneq := by decide
  hlen := by decide
  c := ![-106449464531, -92931601387, -65057593775, -118617613752, 247974954402]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI53N0
  hpmem := by 
    show  _ ∈ I53N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI53N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI53N0 : Ideal.IsPrime I53N0 := PrimeIdeal_isPrime PI53N0
def I53N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![53, 0, 0, 0, 0], ![2, 1, 0, 0, 0]] i)))

def SI53N1: IdealEqSpanCertificate O ℤ timesTableO I53N1
 ![![53, 0, 0, 0, 0], ![2, 1, 0, 0, 0]] 
 ![![53, 0, 0, 0, 0], ![2, 1, 0, 0, 0], ![49, 0, 1, 0, 0], ![3, 0, 0, 1, 0], ![44, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![53, 0, 0, 0, 0], ![0, 53, 0, 0, 0], ![0, 0, 53, 0, 0], ![0, 0, 0, 53, 0], ![0, 0, 0, 0, 53]], ![![2, 1, 0, 0, 0], ![0, 2, 1, 0, 0], ![0, 1, 2, 2, 0], ![15, -70, -41, -49, 126], ![3, -27, -16, -20, 53]]]
  hmulB := by decide
  f := ![![![-784839, -7942184, -15162396, -15170932, -34020], ![20690935, -566888, 402380293, 14310, 0]], ![![-43605, -441239, -842365, -842839, -1890], ![1149571, -31482, 22354711, 795, 0]], ![![-741236, -7500946, -14320031, -14328093, -32130], ![19541416, -535405, 380025582, 13515, 0]], ![![-43606, -441235, -842356, -842830, -1890], ![1149598, -31483, 22354473, 795, 0]], ![![-651564, -6593510, -12587649, -12594736, -28243], ![17177368, -470651, 334051564, 11880, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-2, 53, 0, 0, 0], ![-49, 0, 53, 0, 0], ![-3, 0, 0, 53, 0], ![-44, 0, 0, 0, 53]], ![![0, 1, 0, 0, 0], ![-1, 2, 1, 0, 0], ![-2, 1, 2, 2, 0], ![-61, -70, -41, -49, 126], ![-27, -27, -16, -20, 53]]]
  hle1 := by decide
  hle2 := by decide

lemma NI53N1 : Nat.card (O ⧸ I53N1) = 53 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI53N1)

lemma isPrimeI53N1 : Ideal.IsPrime I53N1 := prime_ideal_of_norm_prime hp53.out _ NI53N1
def MulI53N0 : IdealMulEqCertificate O ℤ timesTableO (I53N0) I53N1
  ![![53, 0, 0, 0, 0], ![129, 79, 41, 53, -139]] ![![53, 0, 0, 0, 0], ![2, 1, 0, 0, 0]]
  ![![53, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![2809, 0, 0, 0, 0], ![106, 53, 0, 0, 0]], ![![6837, 4187, 2173, 2809, -7367], ![636, 371, 212, 265, -689]]]
 hmul := by decide
 f :=  ![![![![-49524014105111, -29354493411126, -9208691573537, -9209058692356, -20651052166], ![1312321234230331, -88950145591, 244252875843207, 8686408200, 0]], ![![-131882, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![53, 0, 0, 0, 0]], ![![2, 1, 0, 0, 0]]], ![![![129, 79, 41, 53, -139]], ![![12, 7, 4, 5, -13]]]]
 hle1 := by decide
 hle2 := by decide

def PBC53 : PrimesBelowPCertificate 53 ![I53N0, I53N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI53N0
    exact isPrimeI53N1
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI53N0, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp59 : Fact (Nat.Prime 59) := {out := by norm_num}
def I59N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![59, 0, 0, 0, 0], ![99, 56, 26, 32, -83]] i)))

def SI59N0: IdealEqSpanCertificate O ℤ timesTableO I59N0
 ![![59, 0, 0, 0, 0], ![99, 56, 26, 32, -83]] 
 ![![59, 0, 0, 0, 0], ![0, 59, 0, 0, 0], ![0, 0, 59, 0, 0], ![47, 58, 28, 1, 0], ![2, 16, 51, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![59, 0, 0, 0, 0], ![0, 59, 0, 0, 0], ![0, 0, 59, 0, 0], ![0, 0, 0, 59, 0], ![0, 0, 0, 0, 59]], ![![99, 56, 26, 32, -83], ![231, 126, 72, 80, -201], ![597, 130, 62, 84, -171], ![258, -365, -325, -410, 1032], ![391, -36, -75, -101, 268]]]
  hmulB := by decide
  f := ![![![2806, 1120, 1870, 1440, -3085], ![12095, -5900, 0, 0, 0]], ![![-132, -55, -80, -64, 140], ![-472, 236, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![2176, 878, 1430, 1107, -2379], ![9129, -4468, 0, 0, 0]], ![![61, 24, 43, 32, -68], ![281, -136, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-47, -58, -28, 59, 0], ![-2, -16, -51, 0, 59]], ![![-21, -8, 57, 32, -83], ![-53, -22, 137, 80, -201], ![-51, -34, 109, 84, -171], ![296, 117, -703, -410, 1032], ![78, 26, -185, -101, 268]]]
  hle1 := by decide
  hle2 := by decide

lemma NI59N0 : Nat.card (O ⧸ I59N0) = 205379 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI59N0)

def MemCI59N0 : IdealMemCertificate O ℤ B I59N0
  ![![59, 0, 0, 0, 0], ![0, 59, 0, 0, 0], ![0, 0, 59, 0, 0], ![47, 58, 28, 1, 0], ![2, 16, 51, 0, 1]] ![38499280, 187290438, 128117580, 178493334, -404768700] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI59N0
 g := ![-127816102, -62525826, 267347592, 178493334, -404768700]
 hmem := by decide

def P59P0 : CertificateIrreducibleZModOfList' 59 3 2 5 [8, 9, 36, 1] where
 m := 1
 P := ![3]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [12, 41, 36], [11, 17, 23], [0, 1]]
 g := ![![[28, 3, 9], [38, 38, 27], [17, 57], [7, 12, 57], [1]],![[39, 29, 6, 53], [17, 41, 58, 53], [57, 45], [9, 25, 21, 3], [14, 23, 45, 46]],![[57, 34, 4, 58], [24, 9, 33, 43], [43, 1], [24, 34, 17, 37], [26, 40, 20, 13]]]
 h' := ![![[12, 41, 36], [50, 25, 3], [50, 1, 33], [3, 23, 36], [51, 50, 23], [0, 1]],![[11, 17, 23], [9, 21, 7], [28, 30, 7], [22, 46, 24], [23, 56, 8], [12, 41, 36]],![[0, 1], [16, 13, 49], [25, 28, 19], [29, 49, 58], [2, 12, 28], [11, 17, 23]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [14, 23], []]
 b := ![[], [35, 5, 1], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI59N0 : PrimeIdeal O 59 where 
  r := 5
  n := 3
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I59N0
  hcard := NI59N0
  P := [8, 9, 36, 1]
  f := ofList [8, 9, 36, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P59P0
  hneq := by decide
  hlen := by decide
  c := ![38499280, 187290438, 128117580, 178493334, -404768700]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI59N0
  hpmem := by 
    show  _ ∈ I59N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI59N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI59N0 : Ideal.IsPrime I59N0 := PrimeIdeal_isPrime PI59N0
def I59N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![59, 0, 0, 0, 0], ![23, 1, 0, 0, 0]] i)))

def SI59N1: IdealEqSpanCertificate O ℤ timesTableO I59N1
 ![![59, 0, 0, 0, 0], ![23, 1, 0, 0, 0]] 
 ![![59, 0, 0, 0, 0], ![23, 1, 0, 0, 0], ![2, 0, 1, 0, 0], ![54, 0, 0, 1, 0], ![41, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![59, 0, 0, 0, 0], ![0, 59, 0, 0, 0], ![0, 0, 59, 0, 0], ![0, 0, 0, 59, 0], ![0, 0, 0, 0, 59]], ![![23, 1, 0, 0, 0], ![0, 23, 1, 0, 0], ![0, 1, 23, 2, 0], ![15, -70, -41, -28, 126], ![3, -27, -16, -20, 74]]]
  hmulB := by decide
  f := ![![![12866142, 2803250, 69814577, 6081956, -41454], ![-33017108, 2092612, -179145948, 19411, 0]], ![![5201180, 1133229, 28222879, 2458660, -16758], ![-13347274, 845942, -72420612, 7847, 0]], ![![547452, 119265, 2970756, 258800, -1764], ![-1404872, 89091, -7623036, 826, 0]], ![![11771153, 2564679, 63872914, 5564343, -37926], ![-30207146, 1914509, -163899492, 17759, 0]], ![![8940876, 1948032, 48515215, 4226444, -28807], ![-22944086, 1454160, -124491252, 13489, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-23, 59, 0, 0, 0], ![-2, 0, 59, 0, 0], ![-54, 0, 0, 59, 0], ![-41, 0, 0, 0, 59]], ![![0, 1, 0, 0, 0], ![-9, 23, 1, 0, 0], ![-3, 1, 23, 2, 0], ![-33, -70, -41, -28, 126], ![-22, -27, -16, -20, 74]]]
  hle1 := by decide
  hle2 := by decide

lemma NI59N1 : Nat.card (O ⧸ I59N1) = 59 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI59N1)

lemma isPrimeI59N1 : Ideal.IsPrime I59N1 := prime_ideal_of_norm_prime hp59.out _ NI59N1
def I59N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![59, 0, 0, 0, 0], ![-20, 1, 0, 0, 0]] i)))

def SI59N2: IdealEqSpanCertificate O ℤ timesTableO I59N2
 ![![59, 0, 0, 0, 0], ![-20, 1, 0, 0, 0]] 
 ![![59, 0, 0, 0, 0], ![39, 1, 0, 0, 0], ![13, 0, 1, 0, 0], ![22, 0, 0, 1, 0], ![15, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![59, 0, 0, 0, 0], ![0, 59, 0, 0, 0], ![0, 0, 59, 0, 0], ![0, 0, 0, 59, 0], ![0, 0, 0, 0, 59]], ![![-20, 1, 0, 0, 0], ![0, -20, 1, 0, 0], ![0, 1, -20, 2, 0], ![15, -70, -41, -71, 126], ![3, -27, -16, -20, 31]]]
  hmulB := by decide
  f := ![![![-56319974, 75324036, -1824672129, 182603407, -70686], ![-166119102, -55497170, -5385625492, 33099, 0]], ![![-37546689, 50216054, -1216448779, 121735674, -47124], ![-110746185, -36998133, -3590419040, 22066, 0]], ![![-13251713, 17723275, -429333824, 42965428, -16632], ![-39086713, -13058115, -1267203652, 7788, 0]], ![![-20981937, 28061895, -679779830, 68028722, -26334], ![-61887467, -20675419, -2006409548, 12331, 0]], ![![-14318630, 19150182, -463899694, 46424595, -17971], ![-42233648, -14109439, -1369226820, 8415, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-39, 59, 0, 0, 0], ![-13, 0, 59, 0, 0], ![-22, 0, 0, 59, 0], ![-15, 0, 0, 0, 59]], ![![-1, 1, 0, 0, 0], ![13, -20, 1, 0, 0], ![3, 1, -20, 2, 0], ![50, -70, -41, -71, 126], ![21, -27, -16, -20, 31]]]
  hle1 := by decide
  hle2 := by decide

lemma NI59N2 : Nat.card (O ⧸ I59N2) = 59 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI59N2)

lemma isPrimeI59N2 : Ideal.IsPrime I59N2 := prime_ideal_of_norm_prime hp59.out _ NI59N2
def MulI59N0 : IdealMulEqCertificate O ℤ timesTableO (I59N0) I59N1
  ![![59, 0, 0, 0, 0], ![99, 56, 26, 32, -83]] ![![59, 0, 0, 0, 0], ![23, 1, 0, 0, 0]]
  ![![59, 0, 0, 0, 0], ![231, 138, 85, 100, -258]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![3481, 0, 0, 0, 0], ![1357, 59, 0, 0, 0]], ![![5841, 3304, 1534, 1888, -4897], ![2508, 1414, 670, 816, -2110]]]
 hmul := by decide
 f :=  ![![![![1414748323592505552, 308247451992696458, 7676831888086085277, 668773742856916396, -4558444942300656], ![-3630528882840551722, 230099448372027676, -19698941999097712860, 2134483097754329, 0]], ![![-40738296060, 0, 0, 0, 0], ![-3363, 0, 0, 0, 0]]], ![![![5539124524057284942, 1206872623446705301, 30056885079307320117, 2618431121867384640, -17847551928773472], ![-14214508145996383320, 900901931598021889, -77126716395822276672, 8357081945807791, 0]], ![![-159501510630, 0, 0, 0, 0], ![-13167, 0, 0, 0, 0]]]]
 g :=  ![![![![-172, -138, -85, -100, 258], ![59, 0, 0, 0, 0]], ![![-208, -137, -85, -100, 258], ![59, 0, 0, 0, 0]]], ![![![-132, -82, -59, -68, 175], ![59, 0, 0, 0, 0]], ![![-165, -100, -65, -76, 196], ![53, 0, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI59N1 : IdealMulEqCertificate O ℤ timesTableO (I59N0*I59N1) I59N2
  ![![59, 0, 0, 0, 0], ![231, 138, 85, 100, -258]] ![![59, 0, 0, 0, 0], ![-20, 1, 0, 0, 0]]
  ![![59, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI59N0
 hI2 := rfl
 M :=  ![![![3481, 0, 0, 0, 0], ![-1180, 59, 0, 0, 0]], ![![13629, 8142, 5015, 5900, -15222], ![-3894, -2478, -1534, -1770, 4602]]]
 hmul := by decide
 f :=  ![![![![-305277067861582, 413849214383122, -10035684117478786, 1004089184143977, -5819249874], ![-900565306708110, -305209329959413, -29620534199079150, 2724858433, 0]], ![![-13876, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![59, 0, 0, 0, 0]], ![![-20, 1, 0, 0, 0]]], ![![![231, 138, 85, 100, -258]], ![![-66, -42, -26, -30, 78]]]]
 hle1 := by decide
 hle2 := by decide

def PBC59 : PrimesBelowPCertificate 59 ![I59N0, I59N1, I59N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI59N0
    exact isPrimeI59N1
    exact isPrimeI59N2
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI59N1, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl
instance hp61 : Fact (Nat.Prime 61) := {out := by norm_num}
def I61N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![61, 0, 0, 0, 0], ![340, 188, 114, 142, -369]] i)))

def SI61N0: IdealEqSpanCertificate O ℤ timesTableO I61N0
 ![![61, 0, 0, 0, 0], ![340, 188, 114, 142, -369]] 
 ![![61, 0, 0, 0, 0], ![0, 61, 0, 0, 0], ![0, 0, 61, 0, 0], ![37, 53, 13, 1, 0], ![52, 6, 8, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![61, 0, 0, 0, 0], ![0, 61, 0, 0, 0], ![0, 0, 61, 0, 0], ![0, 0, 0, 61, 0], ![0, 0, 0, 0, 61]], ![![340, 188, 114, 142, -369], ![1023, 477, 270, 366, -927], ![2709, 702, 303, 414, -1161], ![852, 2451, 1017, 1173, -3060], ![1821, 1482, 673, 823, -2153]]]
  hmulB := by decide
  f := ![![![111296, -22243, -31674, -11402, 52389], ![153476, -57645, 0, 0, 0]], ![![-3481, 470, 804, 200, -1170], ![-4331, 1647, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![64639, -12997, -18461, -6677, 30591], ![89301, -33534, 0, 0, 0]], ![![94466, -18952, -26944, -9728, 44617], ![130418, -48978, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-37, -53, -13, 61, 0], ![-52, -6, -8, 0, 61]], ![![234, -84, 20, 142, -369], ![585, -219, 48, 366, -927], ![783, -234, 69, 414, -1161], ![1911, -678, 168, 1173, -3060], ![1366, -479, 118, 823, -2153]]]
  hle1 := by decide
  hle2 := by decide

lemma NI61N0 : Nat.card (O ⧸ I61N0) = 226981 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI61N0)

def MemCI61N0 : IdealMemCertificate O ℤ B I61N0
  ![![61, 0, 0, 0, 0], ![0, 61, 0, 0, 0], ![0, 0, 61, 0, 0], ![37, 53, 13, 1, 0], ![52, 6, 8, 0, 1]] ![38642595, 180963778, 124187096, 173502598, -392808276] where
 hieq := ideal_eq_of_IdealEqSpanCertificate _ _ SI61N0
 g := ![230247161, -109144660, 16575730, 173502598, -392808276]
 hmem := by decide

def P61P0 : CertificateIrreducibleZModOfList' 61 3 2 5 [3, 13, 56, 1] where
 m := 1
 P := ![3]
 exp := ![1] 
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [14, 59, 27], [52, 1, 34], [0, 1]]
 g := ![![[36, 21, 41], [11, 19], [47, 60, 60], [33, 56, 25], [1]],![[55, 8, 12, 58], [3, 12], [2, 19, 56, 41], [16, 21, 38, 3], [55, 48, 40, 41]],![[9, 51, 5, 34], [28, 58], [8, 49, 60, 52], [35, 12, 39, 22], [32, 12, 30, 20]]]
 h' := ![![[14, 59, 27], [23, 57, 23], [42, 43, 43], [23, 22, 50], [58, 48, 5], [0, 1]],![[52, 1, 34], [30, 19, 37], [51, 38, 45], [33, 25, 34], [17, 39, 20], [14, 59, 27]],![[0, 1], [34, 46, 1], [22, 41, 34], [12, 14, 38], [29, 35, 36], [52, 1, 34]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [0, 13], []]
 b := ![[], [48, 38, 56], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI61N0 : PrimeIdeal O 61 where 
  r := 5
  n := 3
  hpos := by decide
  TT := timesTableO
  T := Table
  heq := timesTableT_eq_Table
  I := I61N0
  hcard := NI61N0
  P := [3, 13, 56, 1]
  f := ofList [3, 13, 56, 1]
  hfeq := by decide
  hirr := irreducible_ofList_ofCertificateIrreducibleZModOfList' P61P0
  hneq := by decide
  hlen := by decide
  c := ![38642595, 180963778, 124187096, 173502598, -392808276]
  a := ![-85, 395, 229, 286, -714]
  z := ![1, 0, 0, 0, 0]
  hBz := B_one_repr
  hpol := by decide
  hcmem := mem_of_certificate O ℤ _ _ _ _ MemCI61N0
  hpmem := by 
    show  _ ∈ I61N0.carrier
    rw [ideal_eq_of_IdealEqSpanCertificate O ℤ SI61N0]
    apply Submodule.subset_span
    use 0 ; dsimp ; congr ; norm_num
        
        
lemma isPrimeI61N0 : Ideal.IsPrime I61N0 := PrimeIdeal_isPrime PI61N0
def I61N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![61, 0, 0, 0, 0], ![-18, 1, 0, 0, 0]] i)))

def SI61N1: IdealEqSpanCertificate O ℤ timesTableO I61N1
 ![![61, 0, 0, 0, 0], ![-18, 1, 0, 0, 0]] 
 ![![61, 0, 0, 0, 0], ![43, 1, 0, 0, 0], ![42, 0, 1, 0, 0], ![21, 0, 0, 1, 0], ![24, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![61, 0, 0, 0, 0], ![0, 61, 0, 0, 0], ![0, 0, 61, 0, 0], ![0, 0, 0, 61, 0], ![0, 0, 0, 0, 61]], ![![-18, 1, 0, 0, 0], ![0, -18, 1, 0, 0], ![0, 1, -18, 2, 0], ![15, -70, -41, -69, 126], ![3, -27, -16, -20, 33]]]
  hmulB := by decide
  f := ![![![-369877097, 133451305, -2417125718, 268761120, -100800], ![-1253431721, -72880482, -8195530560, 48800, 0]], ![![-265849238, 95918163, -1737309650, 193172115, -72450], ![-900904302, -52382835, -5890539420, 35075, 0]], ![![-265849089, 95918095, -1737308570, 193171995, -72450], ![-900903797, -52382834, -5890535760, 35075, 0]], ![![-127145232, 45873896, -830886975, 92386636, -34650], ![-430867086, -25052630, -2817213660, 16775, 0]], ![![-145525404, 52505440, -951000283, 105742080, -39659], ![-493153426, -28674257, -3224471040, 19200, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-43, 61, 0, 0, 0], ![-42, 0, 61, 0, 0], ![-21, 0, 0, 61, 0], ![-24, 0, 0, 0, 61]], ![![-1, 1, 0, 0, 0], ![12, -18, 1, 0, 0], ![11, 1, -18, 2, 0], ![52, -70, -41, -69, 126], ![24, -27, -16, -20, 33]]]
  hle1 := by decide
  hle2 := by decide

lemma NI61N1 : Nat.card (O ⧸ I61N1) = 61 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI61N1)

lemma isPrimeI61N1 : Ideal.IsPrime I61N1 := prime_ideal_of_norm_prime hp61.out _ NI61N1
def I61N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![61, 0, 0, 0, 0], ![-8, 1, 0, 0, 0]] i)))

def SI61N2: IdealEqSpanCertificate O ℤ timesTableO I61N2
 ![![61, 0, 0, 0, 0], ![-8, 1, 0, 0, 0]] 
 ![![61, 0, 0, 0, 0], ![53, 1, 0, 0, 0], ![58, 0, 1, 0, 0], ![53, 0, 0, 1, 0], ![20, 0, 0, 0, 1]] where
  T := Table 
  heq := timesTableT_eq_Table
  hieq := rfl 
  M :=![![![61, 0, 0, 0, 0], ![0, 61, 0, 0, 0], ![0, 0, 61, 0, 0], ![0, 0, 0, 61, 0], ![0, 0, 0, 0, 61]], ![![-8, 1, 0, 0, 0], ![0, -8, 1, 0, 0], ![0, 1, -8, 2, 0], ![15, -70, -41, -59, 126], ![3, -27, -16, -20, 43]]]
  hmulB := by decide
  f := ![![![889933, -2138125, 16920338, -4216564, -28728], ![6811809, 553514, 129015488, 13908, 0]], ![![796253, -1913058, 15139253, -3772716, -25704], ![6094755, 495259, 115434936, 12444, 0]], ![![866512, -2081858, 16475051, -4105598, -27972], ![6632538, 538936, 125620228, 13542, 0]], ![![772839, -1856793, 14693978, -3661753, -24948], ![5915537, 480684, 112039768, 12078, 0]], ![![291780, -701026, 5547652, -1382480, -9419], ![2233370, 181468, 42300160, 4560, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-53, 61, 0, 0, 0], ![-58, 0, 61, 0, 0], ![-53, 0, 0, 61, 0], ![-20, 0, 0, 0, 61]], ![![-1, 1, 0, 0, 0], ![6, -8, 1, 0, 0], ![5, 1, -8, 2, 0], ![110, -70, -41, -59, 126], ![42, -27, -16, -20, 43]]]
  hle1 := by decide
  hle2 := by decide

lemma NI61N2 : Nat.card (O ⧸ I61N2) = 61 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate O ℤ SI61N2)

lemma isPrimeI61N2 : Ideal.IsPrime I61N2 := prime_ideal_of_norm_prime hp61.out _ NI61N2
def MulI61N0 : IdealMulEqCertificate O ℤ timesTableO (I61N0) I61N1
  ![![61, 0, 0, 0, 0], ![340, 188, 114, 142, -369]] ![![61, 0, 0, 0, 0], ![-18, 1, 0, 0, 0]]
  ![![61, 0, 0, 0, 0], ![297, 170, 101, 127, -331]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := rfl
 hI2 := rfl
 M :=  ![![![3721, 0, 0, 0, 0], ![-1098, 61, 0, 0, 0]], ![![20740, 11468, 6954, 8662, -22509], ![-5097, -2907, -1782, -2190, 5715]]]
 hmul := by decide
 f :=  ![![![![-100403082704495775033, 36642923414358046545, -665467735878347821141, 73977688699287121100, -447602541106860], ![-340254710815269903631, -20075754477629128275, -2256312029311650683040, 216695342124100, 0]], ![![-384551720, 0, 0, 0, 0], ![3172, 0, 0, 0, 0]]], ![![![-488848809011233748987, 178409357434965426797, -3240070935640365240476, 360187197842193290231, -2179315248461914], ![-1656653418023573357289, -97746089084488817847, -10985673134489637080280, 1055059835437750, 0]], ![![-1872329467, 0, 0, 0, 0], ![15444, 0, 0, 0, 0]]]]
 g :=  ![![![![-236, -170, -101, -127, 331], ![61, 0, 0, 0, 0]], ![![-18, 1, 0, 0, 0], ![0, 0, 0, 0, 0]]], ![![![-254, -152, -88, -112, 293], ![122, 0, 0, 0, 0]], ![![-30, -17, -11, -13, 34], ![-11, 0, 0, 0, 0]]]]
 hle1 := by decide
 hle2 := by decide

def MulI61N1 : IdealMulEqCertificate O ℤ timesTableO (I61N0*I61N1) I61N2
  ![![61, 0, 0, 0, 0], ![297, 170, 101, 127, -331]] ![![61, 0, 0, 0, 0], ![-8, 1, 0, 0, 0]]
  ![![61, 0, 0, 0, 0]] where
 T := Table
 heq := timesTableT_eq_Table
 hI1 := ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI61N0
 hI2 := rfl
 M :=  ![![![3721, 0, 0, 0, 0], ![-488, 61, 0, 0, 0]], ![![18117, 10370, 6161, 7747, -20191], ![-1464, -915, -549, -671, 1769]]]
 hmul := by decide
 f :=  ![![![![8920768463, -21435906383, 169636749174, -42273630994, -288021858], ![68282271359, 5548805188, 1293459188168, 139436868, 0]], ![![-870, 0, 0, 0, 0], ![0, 0, 0, 0, 0]]]]
 g :=  ![![![![61, 0, 0, 0, 0]], ![![-8, 1, 0, 0, 0]]], ![![![297, 170, 101, 127, -331]], ![![-24, -15, -9, -11, 29]]]]
 hle1 := by decide
 hle2 := by decide

def PBC61 : PrimesBelowPCertificate 61 ![I61N0, I61N1, I61N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI61N0
    exact isPrimeI61N1
    exact isPrimeI61N2
  hPprod := by 
    simp only [Fin.prod_univ_succ, Fin.prod_univ_zero, mul_one, ← Ideal.mul_assoc]
    dsimp
    rw [ideal_eq_mul_of_IdealMulEqCertificate O ℤ timesTableO _ _ _ _ _ MulI61N1, Set.range_unique]
    dsimp ; congr 
    erw [B_int_repr]
    rfl

