
import IdealArithmetic.Examples.NF5_1_67500000_1.RI5_1_67500000_1
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp67 : Fact (Nat.Prime 67) := {out := by norm_num}

def I67N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![67, 0, 0, 0, 0], ![-48, -98, 0, 13, -3]] i)))

def SI67N0: IdealEqSpanCertificate' Table ![![67, 0, 0, 0, 0], ![-48, -98, 0, 13, -3]] 
 ![![67, 0, 0, 0, 0], ![0, 67, 0, 0, 0], ![0, 0, 67, 0, 0], ![0, 0, 0, 67, 0], ![16, 55, 0, 18, 1]] where
  M :=![![![67, 0, 0, 0, 0], ![0, 67, 0, 0, 0], ![0, 0, 67, 0, 0], ![0, 0, 0, 67, 0], ![0, 0, 0, 0, 67]], ![![-48, -98, 0, 13, -3], ![-5, -80, -134, -14, 29], ![160, 282, 268, -21, -57], ![-179, -184, -134, 8, -7], ![99, -24, 0, -165, 2]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 0, 1, 0], ![0, 0, 0, 0, 0]], ![![16, 33, 0, -4, 1], ![22, 0, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![-16, -55, 0, -18, 67]], ![![0, 1, 0, 1, -3], ![-7, -25, -2, -8, 29], ![16, 51, 4, 15, -57], ![-1, 3, -2, 2, -7], ![1, -2, 0, -3, 2]]]
  hle1 := by decide   
  hle2 := by decide  


def P67P0 : CertificateIrreducibleZModOfList' 67 4 2 6 [46, 30, 41, 31, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [64, 50, 57, 53], [38, 52, 9, 10], [1, 31, 1, 4], [0, 1]]
 g := ![![[19, 36, 65, 55], [15, 2, 42, 47], [15, 37, 29], [35, 20, 23], [1], []], ![[25, 0, 26, 53, 4, 5], [16, 1, 45, 37, 21, 12], [34, 7, 23], [43, 3, 59], [11, 12, 60], [26, 33, 62]], ![[4, 57, 66, 58, 62, 64], [29, 58, 55, 38, 8, 22], [66, 2, 19], [41, 44, 36], [49, 57, 40], [39, 28, 33]], ![[8, 13, 23, 43, 23, 37], [12, 21, 42, 19, 52, 49], [2, 44, 17], [60, 16, 4], [11, 55, 65], [48, 48, 16]]]
 h' := ![![[64, 50, 57, 53], [47, 8, 41, 51], [9, 28, 16, 28], [37, 53, 38, 37], [21, 37, 26, 36], [0, 0, 1], [0, 1]], ![[38, 52, 9, 10], [41, 35, 19, 58], [3, 5, 54, 39], [19, 9, 57, 31], [56, 23, 24, 27], [19, 15, 64, 23], [64, 50, 57, 53]], ![[1, 31, 1, 4], [49, 60, 11, 44], [34, 15, 9, 37], [16, 38, 4, 32], [48, 65, 52, 6], [52, 20, 34, 24], [38, 52, 9, 10]], ![[0, 1], [10, 31, 63, 48], [48, 19, 55, 30], [26, 34, 35, 34], [46, 9, 32, 65], [4, 32, 35, 20], [1, 31, 1, 4]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [7, 51, 5], []]
 b := ![[], [], [18, 32, 10, 33], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI67N0 : CertifiedPrimeIdeal' SI67N0 67 where
  n := 4
  hpos := by decide
  P := [46, 30, 41, 31, 1]
  hirr := P67P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![138290753535, 341023508075, 240647924087, 269983861364, 82606897006]
  a := ![-5, -7, -3, -8, -10]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-17662979083, -62721728765, 3591760061, -18163287832, 82606897006]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI67N0 : Ideal.IsPrime I67N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI67N0 B_one_repr
lemma NI67N0 : Nat.card (O ⧸ I67N0) = 20151121 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI67N0

def I67N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![67, 0, 0, 0, 0], ![32, 1, 0, 0, 0]] i)))

def SI67N1: IdealEqSpanCertificate' Table ![![67, 0, 0, 0, 0], ![32, 1, 0, 0, 0]] 
 ![![67, 0, 0, 0, 0], ![32, 1, 0, 0, 0], ![48, 0, 1, 0, 0], ![20, 0, 0, 1, 0], ![23, 0, 0, 0, 1]] where
  M :=![![![67, 0, 0, 0, 0], ![0, 67, 0, 0, 0], ![0, 0, 67, 0, 0], ![0, 0, 0, 67, 0], ![0, 0, 0, 0, 67]], ![![32, 1, 0, 0, 0], ![0, 32, 1, 0, 0], ![0, 1, 32, 2, 0], ![1, 1, 0, 33, 2], ![6, 15, 12, 9, 31]]]
  hmulB := by decide  
  f := ![![![-67031851, -4728854, -135399347, -8367764, 5928], ![140354146, -3341223, 283596796, -198588, 0]], ![![-32928240, -2322973, -66512463, -4110512, 2912], ![68946552, -1641299, 139311760, -97552, 0]], ![![-48215900, -3401478, -97392482, -6018916, 4264], ![100956506, -2403289, 203990612, -142844, 0]], ![![-19991984, -1410360, -40382263, -2495649, 1768], ![41860068, -996507, 84581504, -59228, 0]], ![![-23010975, -1623344, -46480373, -2872516, 2035], ![48181360, -1146977, 97354124, -68172, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-32, 67, 0, 0, 0], ![-48, 0, 67, 0, 0], ![-20, 0, 0, 67, 0], ![-23, 0, 0, 0, 67]], ![![0, 1, 0, 0, 0], ![-16, 32, 1, 0, 0], ![-24, 1, 32, 2, 0], ![-11, 1, 0, 33, 2], ![-29, 15, 12, 9, 31]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI67N1 : Nat.card (O ⧸ I67N1) = 67 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI67N1)

lemma isPrimeI67N1 : Ideal.IsPrime I67N1 := prime_ideal_of_norm_prime hp67.out _ NI67N1
def MulI67N0 : IdealMulLeCertificate' Table 
  ![![67, 0, 0, 0, 0], ![-48, -98, 0, 13, -3]] ![![67, 0, 0, 0, 0], ![32, 1, 0, 0, 0]]
  ![![67, 0, 0, 0, 0]] where
 M := ![![![4489, 0, 0, 0, 0], ![2144, 67, 0, 0, 0]], ![![-3216, -6566, 0, 871, -201], ![-1541, -3216, -134, 402, -67]]]
 hmul := by decide  
 g := ![![![![67, 0, 0, 0, 0]], ![![32, 1, 0, 0, 0]]], ![![![-48, -98, 0, 13, -3]], ![![-23, -48, -2, 6, -1]]]]
 hle2 := by decide  


def PBC67 : ContainsPrimesAboveP 67 ![I67N0, I67N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI67N0
    exact isPrimeI67N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 67 (by decide) (𝕀 ⊙ MulI67N0)
instance hp71 : Fact (Nat.Prime 71) := {out := by norm_num}

def I71N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![71, 0, 0, 0, 0], ![-39, 46, 101, 35, -34]] i)))

def SI71N0: IdealEqSpanCertificate' Table ![![71, 0, 0, 0, 0], ![-39, 46, 101, 35, -34]] 
 ![![71, 0, 0, 0, 0], ![0, 71, 0, 0, 0], ![0, 0, 71, 0, 0], ![53, 16, 47, 1, 0], ![39, 36, 12, 0, 1]] where
  M :=![![![71, 0, 0, 0, 0], ![0, 71, 0, 0, 0], ![0, 0, 71, 0, 0], ![0, 0, 0, 71, 0], ![0, 0, 0, 0, 71]], ![![-39, 46, 101, 35, -34], ![-169, -413, -362, -69, 104], ![555, 960, 835, 143, -242], ![-570, -842, -791, -148, 212], ![951, 1440, 1377, 180, -395]]]
  hmulB := by decide  
  f := ![![![862148, 940126, 322995, -68471, -51646], ![586247, 226916, 0, 0, 0]], ![![-12662, -13844, -4793, 992, 774], ![-8591, -3337, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![640729, 698656, 240011, -50895, -38372], ![435698, 168636, 0, 0, 0]], ![![467142, 509402, 175021, -37097, -27987], ![317645, 122952, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-53, -16, -47, 71, 0], ![-39, -36, -12, 0, 71]], ![![-8, 10, -16, 35, -34], ![-8, -43, 23, -69, 104], ![34, 104, -42, 143, -242], ![-14, -86, 51, -148, 212], ![96, 180, -33, 180, -395]]]
  hle1 := by decide   
  hle2 := by decide  


def P71P0 : CertificateIrreducibleZModOfList' 71 3 2 6 [62, 62, 6, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [40, 46, 58], [25, 24, 13], [0, 1]]
 g := ![![[36, 28, 45], [36, 6, 4], [66, 38, 43], [59, 37], [65, 1], []], ![[48, 21, 59, 48], [14, 0, 5, 8], [1, 37, 10, 43], [4, 30], [52, 8], [62, 27]], ![[55, 6, 56, 52], [60, 62, 11, 26], [61, 8, 13, 44], [24, 36], [58, 57], [36, 27]]]
 h' := ![![[40, 46, 58], [40, 60, 51], [26, 43, 2], [39, 44, 55], [17, 26, 45], [0, 0, 1], [0, 1]], ![[25, 24, 13], [34, 44, 18], [27, 6, 57], [2, 50, 38], [45, 65, 32], [28, 8, 24], [40, 46, 58]], ![[0, 1], [26, 38, 2], [17, 22, 12], [13, 48, 49], [62, 51, 65], [26, 63, 46], [25, 24, 13]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [25, 55], []]
 b := ![[], [66, 68, 37], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI71N0 : CertifiedPrimeIdeal' SI71N0 71 where
  n := 3
  hpos := by decide
  P := [62, 62, 6, 1]
  hirr := P71P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-140620007, -263888582, -231882571, -91316013, 39336181]
  a := ![9, -56, 5, -57, 15]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![44577713, -3083590, 50534308, -91316013, 39336181]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI71N0 : Ideal.IsPrime I71N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI71N0 B_one_repr
lemma NI71N0 : Nat.card (O ⧸ I71N0) = 357911 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI71N0

def I71N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![71, 0, 0, 0, 0], ![11, 1, 0, 0, 0]] i)))

def SI71N1: IdealEqSpanCertificate' Table ![![71, 0, 0, 0, 0], ![11, 1, 0, 0, 0]] 
 ![![71, 0, 0, 0, 0], ![11, 1, 0, 0, 0], ![21, 0, 1, 0, 0], ![21, 0, 0, 1, 0], ![11, 0, 0, 0, 1]] where
  M :=![![![71, 0, 0, 0, 0], ![0, 71, 0, 0, 0], ![0, 0, 71, 0, 0], ![0, 0, 0, 71, 0], ![0, 0, 0, 0, 71]], ![![11, 1, 0, 0, 0], ![0, 11, 1, 0, 0], ![0, 1, 11, 2, 0], ![1, 1, 0, 12, 2], ![6, 15, 12, 9, 10]]]
  hmulB := by decide  
  f := ![![![1457732, 2711118, 29766047, 5398272, -2640], ![-9417511, 821399, -192200976, 93720, 0]], ![![231912, 431309, 4735507, 858816, -420], ![-1498241, 130711, -30577428, 14910, 0]], ![![463826, 862654, 9471410, 1717704, -840], ![-2996495, 261423, -61157412, 29820, 0]], ![![430680, 801007, 8794508, 1594943, -780], ![-2782359, 242708, -56786616, 27690, 0]], ![![225830, 420030, 4611641, 836352, -409], ![-1458949, 127265, -29777616, 14520, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-11, 71, 0, 0, 0], ![-21, 0, 71, 0, 0], ![-21, 0, 0, 71, 0], ![-11, 0, 0, 0, 71]], ![![0, 1, 0, 0, 0], ![-2, 11, 1, 0, 0], ![-4, 1, 11, 2, 0], ![-4, 1, 0, 12, 2], ![-10, 15, 12, 9, 10]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N1 : Nat.card (O ⧸ I71N1) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N1)

lemma isPrimeI71N1 : Ideal.IsPrime I71N1 := prime_ideal_of_norm_prime hp71.out _ NI71N1

def I71N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![265, -6, -96, -16, 22]] i)))

def SI71N2: IdealEqSpanCertificate' Table ![![265, -6, -96, -16, 22]] 
 ![![71, 0, 0, 0, 0], ![37, 1, 0, 0, 0], ![51, 0, 1, 0, 0], ![32, 0, 0, 1, 0], ![13, 0, 0, 0, 1]] where
  M :=![![![265, -6, -96, -16, 22], ![116, 483, 258, -10, -54], ![-334, -446, -165, 20, 34], ![54, -226, -148, 3, 30], ![-126, 54, 60, 0, -11]]]
  hmulB := by decide  
  f := ![![![3235, 7970, 5628, 6300, 1922]], ![![1937, 4773, 3370, 3774, 1152]], ![![3717, 9160, 6467, 7244, 2212]], ![![5186, 12786, 9024, 10119, 3094]], ![![8903, 21952, 15492, 17376, 5315]]]
  g := ![![![79, -6, -96, -16, 22], ![-421, 483, 258, -10, -54], ![331, -446, -165, 20, 34], ![218, -226, -148, 3, 30], ![-71, 54, 60, 0, -11]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N2 : Nat.card (O ⧸ I71N2) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N2)

lemma isPrimeI71N2 : Ideal.IsPrime I71N2 := prime_ideal_of_norm_prime hp71.out _ NI71N2
def MulI71N0 : IdealMulLeCertificate' Table 
  ![![71, 0, 0, 0, 0], ![-39, 46, 101, 35, -34]] ![![71, 0, 0, 0, 0], ![11, 1, 0, 0, 0]]
  ![![-3235, -7970, -5628, -6300, -1922]] where
 M := ![![![5041, 0, 0, 0, 0], ![781, 71, 0, 0, 0]], ![![-2769, 3266, 7171, 2485, -2414], ![-598, 93, 749, 316, -270]]]
 hmul := by decide  
 g := ![![![![-18815, 426, 6816, 1136, -1562]], ![![-3031, -417, 798, 186, -188]]], ![![![32559, 32340, 8273, -2289, -1516]], ![![4884, 5233, 1481, -346, -278]]]]
 hle2 := by decide  

def MulI71N1 : IdealMulLeCertificate' Table 
  ![![-3235, -7970, -5628, -6300, -1922]] ![![265, -6, -96, -16, 22]]
  ![![71, 0, 0, 0, 0]] where
 M := ![![![-71, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC71 : ContainsPrimesAboveP 71 ![I71N0, I71N1, I71N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI71N0
    exact isPrimeI71N1
    exact isPrimeI71N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 71 (by decide) (𝕀 ⊙ MulI71N0 ⊙ MulI71N1)
instance hp73 : Fact (Nat.Prime 73) := {out := by norm_num}

def I73N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![11, 9, -3, -6, -2]] i)))

def SI73N0: IdealEqSpanCertificate' Table ![![11, 9, -3, -6, -2]] 
 ![![73, 0, 0, 0, 0], ![0, 73, 0, 0, 0], ![0, 0, 73, 0, 0], ![0, 0, 0, 73, 0], ![31, 32, 38, 3, 1]] where
  M :=![![![11, 9, -3, -6, -2], ![-18, -28, -15, -30, -10], ![-90, -213, -148, -150, -50], ![-216, -555, -399, -433, -120], ![-465, -1137, -789, -921, -307]]]
  hmulB := by decide  
  f := ![![![-7, -15, -9, 0, 2]], ![![12, 14, 9, 0, -2]], ![![-12, -9, -10, 0, 2]], ![![0, -3, 3, -1, 0]], ![![-4, -5, -5, 0, 1]]]
  g := ![![![1, 1, 1, 0, -2], ![4, 4, 5, 0, -10], ![20, 19, 24, 0, -50], ![48, 45, 57, -1, -120], ![124, 119, 149, 0, -307]]]
  hle1 := by decide   
  hle2 := by decide  


def P73P0 : CertificateIrreducibleZModOfList' 73 4 2 6 [38, 68, 27, 60, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [49, 31, 4, 27], [19, 24, 58, 69], [18, 17, 11, 50], [0, 1]]
 g := ![![[16, 20, 60, 57], [48, 14, 3], [33, 47, 25], [59, 36, 35, 23], [1], []], ![[13, 20, 11, 48, 28, 27], [22, 44, 24], [32, 49, 19], [30, 43, 20, 36, 45, 46], [15, 24, 37], [49, 57, 72]], ![[52, 21, 5, 37, 26, 6], [58, 57, 71], [18, 71, 2], [60, 55, 69, 62, 10, 38], [22, 0, 8], [69, 36, 16]], ![[35, 29, 35, 28, 24, 69], [47, 33, 61], [20, 5, 27], [20, 30, 24, 19, 34, 32], [64, 51, 41], [62, 20, 18]]]
 h' := ![![[49, 31, 4, 27], [28, 5, 8, 35], [63, 18, 51, 52], [21, 6, 16, 5], [35, 5, 46, 13], [0, 0, 1], [0, 1]], ![[19, 24, 58, 69], [58, 27, 71, 1], [23, 52, 58, 43], [12, 67, 72, 26], [68, 30, 19, 27], [28, 22, 61, 16], [49, 31, 4, 27]], ![[18, 17, 11, 50], [36, 71, 34, 20], [14, 20, 43, 12], [48, 0, 68, 32], [44, 31, 20, 63], [2, 35, 51, 9], [19, 24, 58, 69]], ![[0, 1], [3, 43, 33, 17], [16, 56, 67, 39], [51, 0, 63, 10], [48, 7, 61, 43], [12, 16, 33, 48], [18, 17, 11, 50]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [33, 71, 49], []]
 b := ![[], [], [57, 9, 27, 67], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI73N0 : CertifiedPrimeIdeal' SI73N0 73 where
  n := 4
  hpos := by decide
  P := [38, 68, 27, 60, 1]
  hirr := P73P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![383071746, 945109216, 666653676, 748957244, 229607880]
  a := ![0, -4, 0, -5, -1]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-92257158, -87703328, -110389668, 823748, 229607880]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI73N0 : Ideal.IsPrime I73N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI73N0 B_one_repr
lemma NI73N0 : Nat.card (O ⧸ I73N0) = 28398241 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI73N0

def I73N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![7, 15, 9, 0, -2]] i)))

def SI73N1: IdealEqSpanCertificate' Table ![![7, 15, 9, 0, -2]] 
 ![![73, 0, 0, 0, 0], ![68, 1, 0, 0, 0], ![48, 0, 1, 0, 0], ![13, 0, 0, 1, 0], ![29, 0, 0, 0, 1]] where
  M :=![![![7, 15, 9, 0, -2], ![-12, -14, -9, 0, 2], ![12, 9, 10, 0, -2], ![0, 3, -3, 1, 0], ![3, -3, 3, -3, 1]]]
  hmulB := by decide  
  f := ![![![-11, -9, 3, 6, 2]], ![![-10, -8, 3, 6, 2]], ![![-6, -3, 4, 6, 2]], ![![1, 6, 6, 7, 2]], ![![2, 12, 12, 15, 5]]]
  g := ![![![-19, 15, 9, 0, -2], ![18, -14, -9, 0, 2], ![-14, 9, 10, 0, -2], ![-1, 3, -3, 1, 0], ![1, -3, 3, -3, 1]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI73N1 : Nat.card (O ⧸ I73N1) = 73 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI73N1)

lemma isPrimeI73N1 : Ideal.IsPrime I73N1 := prime_ideal_of_norm_prime hp73.out _ NI73N1
def MulI73N0 : IdealMulLeCertificate' Table 
  ![![11, 9, -3, -6, -2]] ![![7, 15, 9, 0, -2]]
  ![![73, 0, 0, 0, 0]] where
 M := ![![![-73, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC73 : ContainsPrimesAboveP 73 ![I73N0, I73N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI73N0
    exact isPrimeI73N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 73 (by decide) (𝕀 ⊙ MulI73N0)
instance hp79 : Fact (Nat.Prime 79) := {out := by norm_num}

def I79N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1827, -4575, -3223, -3570, -1084]] i)))

def SI79N0: IdealEqSpanCertificate' Table ![![-1827, -4575, -3223, -3570, -1084]] 
 ![![79, 0, 0, 0, 0], ![0, 79, 0, 0, 0], ![0, 0, 79, 0, 0], ![0, 0, 0, 79, 0], ![57, 47, 51, 46, 1]] where
  M :=![![![-1827, -4575, -3223, -3570, -1084], ![-10074, -24880, -17583, -19772, -6056], ![-56108, -138269, -97552, -109442, -33488], ![-150148, -370271, -261271, -293083, -89670], ![-334527, -824913, -582117, -653115, -199843]]]
  hmulB := by decide  
  f := ![![![-215, -313, -315, -28, 76]], ![![428, 582, 599, 26, -132]], ![![-766, -927, -1002, 36, 184]], ![![356, 223, 341, -169, 10]], ![![-192, -347, -321, -75, 99]]]
  g := ![![![759, 587, 659, 586, -1084], ![4242, 3288, 3687, 3276, -6056], ![23452, 18173, 20384, 18114, -33488], ![62798, 48661, 54581, 48503, -89670], ![139956, 108452, 121644, 108097, -199843]]]
  hle1 := by decide   
  hle2 := by decide  


def P79P0 : CertificateIrreducibleZModOfList' 79 4 2 6 [43, 44, 70, 43, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [49, 21, 30, 67], [25, 29, 19, 23], [41, 28, 30, 68], [0, 1]]
 g := ![![[65, 65, 71, 10], [7, 18, 61, 21], [49, 46, 19, 76], [51, 65, 62, 32], [1], []], ![[13, 22, 12, 63, 39, 2], [60, 77, 65, 13, 50, 1], [13, 67, 68, 33, 34, 13], [40, 55, 51, 18, 67, 36], [64, 74, 18], [51, 40, 65]], ![[1, 46, 11, 5, 24, 21], [77, 46, 45, 15, 40, 62], [25, 45, 39, 78, 44, 38], [29, 49, 78, 60, 31, 1], [7, 10, 9], [22, 10, 55]], ![[9, 50, 0, 17, 71, 28], [32, 63, 52, 5, 31, 24], [20, 78, 54, 40, 73, 14], [4, 4, 60, 19, 59, 3], [31, 8, 23], [50, 62, 42]]]
 h' := ![![[49, 21, 30, 67], [15, 68, 6, 22], [26, 19, 15, 69], [19, 49, 60, 32], [36, 35, 9, 36], [0, 0, 1], [0, 1]], ![[25, 29, 19, 23], [72, 46, 59, 48], [14, 24, 35, 21], [62, 43, 64, 60], [64, 33, 38, 32], [50, 69, 75, 52], [49, 21, 30, 67]], ![[41, 28, 30, 68], [4, 34, 27, 72], [41, 34, 37, 48], [43, 33, 13, 73], [40, 6, 67, 56], [74, 52, 53, 3], [25, 29, 19, 23]], ![[0, 1], [10, 10, 66, 16], [23, 2, 71, 20], [46, 33, 21, 72], [35, 5, 44, 34], [5, 37, 29, 24], [41, 28, 30, 68]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [23, 69, 7], []]
 b := ![[], [], [30, 0, 10, 10], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI79N0 : CertifiedPrimeIdeal' SI79N0 79 where
  n := 4
  hpos := by decide
  P := [43, 44, 70, 43, 1]
  hirr := P79P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![2844226799149, 7013832506918, 4949396528086, 5552795357606, 1699023915876]
  a := ![9, 27, 5, 26, 17]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-1189875144377, -922029006826, -1034187635210, -919016516110, 1699023915876]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI79N0 : Ideal.IsPrime I79N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI79N0 B_one_repr
lemma NI79N0 : Nat.card (O ⧸ I79N0) = 38950081 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI79N0

def I79N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![215, 313, 315, 28, -76]] i)))

def SI79N1: IdealEqSpanCertificate' Table ![![215, 313, 315, 28, -76]] 
 ![![79, 0, 0, 0, 0], ![67, 1, 0, 0, 0], ![14, 0, 1, 0, 0], ![11, 0, 0, 1, 0], ![67, 0, 0, 0, 1]] where
  M :=![![![215, 313, 315, 28, -76], ![-428, -582, -599, -26, 132], ![766, 927, 1002, -36, -184], ![-356, -223, -341, 169, -10], ![339, -93, 141, -387, 151]]]
  hmulB := by decide  
  f := ![![![1827, 4575, 3223, 3570, 1084]], ![![1677, 4195, 2956, 3278, 996]], ![![1034, 2561, 1806, 2018, 616]], ![![2155, 5324, 3756, 4207, 1286]], ![![5784, 14322, 10102, 11295, 3449]]]
  g := ![![![-258, 313, 315, 28, -76], ![486, -582, -599, -26, 132], ![-793, 927, 1002, -36, -184], ![230, -223, -341, 169, -10], ![-16, -93, 141, -387, 151]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI79N1 : Nat.card (O ⧸ I79N1) = 79 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI79N1)

lemma isPrimeI79N1 : Ideal.IsPrime I79N1 := prime_ideal_of_norm_prime hp79.out _ NI79N1
def MulI79N0 : IdealMulLeCertificate' Table 
  ![![-1827, -4575, -3223, -3570, -1084]] ![![215, 313, 315, 28, -76]]
  ![![79, 0, 0, 0, 0]] where
 M := ![![![-79, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC79 : ContainsPrimesAboveP 79 ![I79N0, I79N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI79N0
    exact isPrimeI79N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 79 (by decide) (𝕀 ⊙ MulI79N0)
instance hp83 : Fact (Nat.Prime 83) := {out := by norm_num}

def I83N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![83, 0, 0, 0, 0], ![2, 10, 41, 15, -14]] i)))

def SI83N0: IdealEqSpanCertificate' Table ![![83, 0, 0, 0, 0], ![2, 10, 41, 15, -14]] 
 ![![83, 0, 0, 0, 0], ![0, 83, 0, 0, 0], ![0, 0, 83, 0, 0], ![7, 11, 18, 1, 0], ![37, 17, 46, 0, 1]] where
  M :=![![![83, 0, 0, 0, 0], ![0, 83, 0, 0, 0], ![0, 0, 83, 0, 0], ![0, 0, 0, 83, 0], ![0, 0, 0, 0, 83]], ![![2, 10, 41, 15, -14], ![-69, -152, -158, -29, 44], ![235, 404, 376, 51, -102], ![-246, -358, -331, -43, 80], ![375, 540, 525, 36, -138]]]
  hmulB := by decide  
  f := ![![![14400, 30500, 25032, 2965, -6408], ![18094, 17845, 0, 0, 0]], ![![-2881, -6105, -5031, -602, 1290], ![-3569, -3569, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![831, 1755, 1411, 158, -358], ![1121, 1032, 0, 0, 0]], ![![5829, 12345, 10125, 1197, -2591], ![7343, 7224, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-7, -11, -18, 83, 0], ![-37, -17, -46, 0, 83]], ![![5, 1, 5, 15, -14], ![-18, -7, -20, -29, 44], ![44, 19, 50, 51, -102], ![-35, -15, -39, -43, 80], ![63, 30, 75, 36, -138]]]
  hle1 := by decide   
  hle2 := by decide  


def P83P0 : CertificateIrreducibleZModOfList' 83 3 2 6 [59, 11, 1, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [57, 50, 73], [25, 32, 10], [0, 1]]
 g := ![![[75, 1, 9], [64, 77, 64], [14, 70], [71, 33], [73, 82, 1], []], ![[36, 44, 52, 50], [44, 13, 76, 66], [5, 10], [63, 1], [37, 22, 17, 52], [62, 17]], ![[29, 39, 25, 69], [78, 31, 55, 44], [48, 68], [77, 27], [65, 75, 13, 17], [42, 17]]]
 h' := ![![[57, 50, 73], [42, 26, 80], [25, 14, 8], [42, 65, 53], [9, 3, 45], [0, 0, 1], [0, 1]], ![[25, 32, 10], [12, 45, 59], [41, 35, 33], [81, 79, 50], [35, 51, 82], [6, 31, 32], [57, 50, 73]], ![[0, 1], [26, 12, 27], [76, 34, 42], [70, 22, 63], [31, 29, 39], [56, 52, 50], [25, 32, 10]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [71, 29], []]
 b := ![[], [27, 35, 61], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI83N0 : CertifiedPrimeIdeal' SI83N0 83 where
  n := 3
  hpos := by decide
  P := [59, 11, 1, 1]
  hirr := P83P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-290594569, -719635092, -506396882, -573213802, -177017435]
  a := ![-11, -9, -5, -7, -21]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![123753580, 103554375, 216316308, -573213802, -177017435]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI83N0 : Ideal.IsPrime I83N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI83N0 B_one_repr
lemma NI83N0 : Nat.card (O ⧸ I83N0) = 571787 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI83N0

def I83N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![83, 0, 0, 0, 0], ![9, 1, 0, 0, 0]] i)))

def SI83N1: IdealEqSpanCertificate' Table ![![83, 0, 0, 0, 0], ![9, 1, 0, 0, 0]] 
 ![![83, 0, 0, 0, 0], ![9, 1, 0, 0, 0], ![2, 0, 1, 0, 0], ![28, 0, 0, 1, 0], ![22, 0, 0, 0, 1]] where
  M :=![![![83, 0, 0, 0, 0], ![0, 83, 0, 0, 0], ![0, 0, 83, 0, 0], ![0, 0, 0, 83, 0], ![0, 0, 0, 0, 83]], ![![9, 1, 0, 0, 0], ![0, 9, 1, 0, 0], ![0, 1, 9, 2, 0], ![1, 1, 0, 10, 2], ![6, 15, 12, 9, 8]]]
  hmulB := by decide  
  f := ![![![-18092, 39983, 389084, 84660, -366], ![165170, 10043, -3589335, 15189, 0]], ![![-6082, 13343, 129937, 28274, -122], ![55528, 3403, -1198686, 5063, 0]], ![![-6090, 13354, 130045, 28298, -122], ![55601, 3404, -1199682, 5063, 0]], ![![-6032, 13326, 129690, 28219, -122], ![55069, 3357, -1196403, 5063, 0]], ![![-4792, 10592, 103130, 22440, -97], ![43748, 2720, -951390, 4026, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-9, 83, 0, 0, 0], ![-2, 0, 83, 0, 0], ![-28, 0, 0, 83, 0], ![-22, 0, 0, 0, 83]], ![![0, 1, 0, 0, 0], ![-1, 9, 1, 0, 0], ![-1, 1, 9, 2, 0], ![-4, 1, 0, 10, 2], ![-7, 15, 12, 9, 8]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI83N1 : Nat.card (O ⧸ I83N1) = 83 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI83N1)

lemma isPrimeI83N1 : Ideal.IsPrime I83N1 := prime_ideal_of_norm_prime hp83.out _ NI83N1

def I83N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![3, 7, 5, 6, 2]] i)))

def SI83N2: IdealEqSpanCertificate' Table ![![3, 7, 5, 6, 2]] 
 ![![83, 0, 0, 0, 0], ![38, 1, 0, 0, 0], ![50, 0, 1, 0, 0], ![27, 0, 0, 1, 0], ![36, 0, 0, 0, 1]] where
  M :=![![![3, 7, 5, 6, 2], ![18, 44, 31, 34, 10], ![94, 233, 164, 186, 58], ![258, 635, 449, 501, 152], ![567, 1401, 987, 1113, 343]]]
  hmulB := by decide  
  f := ![![![375, 285, 89, -8, -22]], ![![170, 132, 41, -4, -10]], ![![226, 171, 56, -4, -14]], ![![121, 88, 24, -3, -6]], ![![165, 129, 45, -3, -11]]]
  g := ![![![-9, 7, 5, 6, 2], ![-54, 44, 31, 34, 10], ![-290, 233, 164, 186, 58], ![-787, 635, 449, 501, 152], ![-1740, 1401, 987, 1113, 343]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI83N2 : Nat.card (O ⧸ I83N2) = 83 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI83N2)

lemma isPrimeI83N2 : Ideal.IsPrime I83N2 := prime_ideal_of_norm_prime hp83.out _ NI83N2
def MulI83N0 : IdealMulLeCertificate' Table 
  ![![83, 0, 0, 0, 0], ![2, 10, 41, 15, -14]] ![![83, 0, 0, 0, 0], ![9, 1, 0, 0, 0]]
  ![![-375, -285, -89, 8, 22]] where
 M := ![![![6889, 0, 0, 0, 0], ![747, 83, 0, 0, 0]], ![![166, 830, 3403, 1245, -1162], ![-51, -62, 211, 106, -82]]]
 hmul := by decide  
 g := ![![![![-249, -581, -415, -498, -166]], ![![-45, -107, -76, -88, -28]]], ![![![28, 82, 39, 89, 40]], ![![7, 18, 11, 16, 6]]]]
 hle2 := by decide  

def MulI83N1 : IdealMulLeCertificate' Table 
  ![![-375, -285, -89, 8, 22]] ![![3, 7, 5, 6, 2]]
  ![![83, 0, 0, 0, 0]] where
 M := ![![![-83, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC83 : ContainsPrimesAboveP 83 ![I83N0, I83N1, I83N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI83N0
    exact isPrimeI83N1
    exact isPrimeI83N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 83 (by decide) (𝕀 ⊙ MulI83N0 ⊙ MulI83N1)
instance hp89 : Fact (Nat.Prime 89) := {out := by norm_num}

def I89N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![89, 0, 0, 0, 0], ![-23, -53, -55, -24, 20]] i)))

def SI89N0: IdealEqSpanCertificate' Table ![![89, 0, 0, 0, 0], ![-23, -53, -55, -24, 20]] 
 ![![89, 0, 0, 0, 0], ![0, 89, 0, 0, 0], ![0, 0, 89, 0, 0], ![0, 0, 0, 89, 0], ![30, 73, 64, 70, 1]] where
  M :=![![![89, 0, 0, 0, 0], ![0, 89, 0, 0, 0], ![0, 0, 89, 0, 0], ![0, 0, 0, 89, 0], ![0, 0, 0, 0, 89]], ![![-23, -53, -55, -24, 20], ![96, 198, 187, 46, -68], ![-362, -691, -618, -192, 160], ![336, 515, 521, -17, -238], ![-927, -1695, -1497, -561, 245]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![0, 0, 0, 1, 0], ![0, 0, 0, 0, 0]], ![![13, 30, 31, 14, -11], ![49, 0, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![-30, -73, -64, -70, 89]], ![![-7, -17, -15, -16, 20], ![24, 58, 51, 54, -68], ![-58, -139, -122, -128, 160], ![84, 201, 177, 187, -238], ![-93, -220, -193, -199, 245]]]
  hle1 := by decide   
  hle2 := by decide  


def P89P0 : CertificateIrreducibleZModOfList' 89 4 2 6 [24, 55, 70, 60, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [35, 12, 49, 53], [34, 62, 80, 83], [49, 14, 49, 42], [0, 1]]
 g := ![![[69, 13, 1, 87], [25, 7, 84], [23, 12, 73], [4, 21, 78, 10], [29, 1], []], ![[73, 3, 74, 1, 38, 68], [39, 84, 44], [9, 58, 64], [11, 24, 54, 47, 81, 45], [44, 88, 16, 30, 68, 40], [75, 58, 50]], ![[54, 30, 31, 21, 81, 41], [78, 33, 47], [1, 2, 68], [31, 0, 86, 85, 53, 54], [79, 87, 76, 19, 21, 70], [54, 84, 36]], ![[23, 74, 38, 2, 50, 39], [65, 43, 57], [58, 20, 47], [67, 51, 17, 38, 79, 72], [21, 70, 78, 32, 65, 79], [67, 3, 73]]]
 h' := ![![[35, 12, 49, 53], [5, 10, 56, 49], [31, 15, 47, 66], [82, 66, 65, 42], [16, 72, 51, 59], [0, 0, 1], [0, 1]], ![[34, 62, 80, 83], [41, 12, 62, 39], [49, 78, 77, 20], [40, 19, 10, 8], [18, 75, 55, 33], [48, 40, 75, 73], [35, 12, 49, 53]], ![[49, 14, 49, 42], [85, 45, 76, 39], [55, 28, 74, 74], [41, 83, 79, 54], [30, 62, 57, 13], [38, 31, 20, 14], [34, 62, 80, 83]], ![[0, 1], [87, 22, 73, 51], [57, 57, 69, 18], [84, 10, 24, 74], [51, 58, 15, 73], [81, 18, 82, 2], [49, 14, 49, 42]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [3, 71, 7], []]
 b := ![[], [], [11, 30, 43, 16], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI89N0 : CertifiedPrimeIdeal' SI89N0 89 where
  n := 4
  hpos := by decide
  P := [24, 55, 70, 60, 1]
  hirr := P89P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![3803377522, 11000279748, 7043420892, 10435258078, 3923816932]
  a := ![6, -4, 4, -14, 12]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-1279900342, -3094812992, -2742481604, -2968898058, 3923816932]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI89N0 : Ideal.IsPrime I89N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI89N0 B_one_repr
lemma NI89N0 : Nat.card (O ⧸ I89N0) = 62742241 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI89N0

def I89N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![89, 0, 0, 0, 0], ![39, 1, 0, 0, 0]] i)))

def SI89N1: IdealEqSpanCertificate' Table ![![89, 0, 0, 0, 0], ![39, 1, 0, 0, 0]] 
 ![![89, 0, 0, 0, 0], ![39, 1, 0, 0, 0], ![81, 0, 1, 0, 0], ![3, 0, 0, 1, 0], ![10, 0, 0, 0, 1]] where
  M :=![![![89, 0, 0, 0, 0], ![0, 89, 0, 0, 0], ![0, 0, 89, 0, 0], ![0, 0, 0, 89, 0], ![0, 0, 0, 0, 89]], ![![39, 1, 0, 0, 0], ![0, 39, 1, 0, 0], ![0, 1, 39, 2, 0], ![1, 1, 0, 40, 2], ![6, 15, 12, 9, 38]]]
  hmulB := by decide  
  f := ![![![-8444693, -1209424, -56773602, -2981678, -3480], ![19267254, -1060791, 129587471, 154860, 0]], ![![-3940943, -564412, -26494509, -1391458, -1624], ![8991582, -495018, 60474521, 72268, 0]], ![![-7881829, -1128823, -52989018, -2782916, -3248], ![17983034, -990035, 120949042, 144536, 0]], ![![-281503, -40337, -1892449, -99389, -116], ![642272, -35308, 4319571, 5162, 0]], ![![-948898, -135915, -6379057, -335020, -391], ![2164988, -119137, 14560390, 17400, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-39, 89, 0, 0, 0], ![-81, 0, 89, 0, 0], ![-3, 0, 0, 89, 0], ![-10, 0, 0, 0, 89]], ![![0, 1, 0, 0, 0], ![-18, 39, 1, 0, 0], ![-36, 1, 39, 2, 0], ![-2, 1, 0, 40, 2], ![-22, 15, 12, 9, 38]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI89N1 : Nat.card (O ⧸ I89N1) = 89 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI89N1)

lemma isPrimeI89N1 : Ideal.IsPrime I89N1 := prime_ideal_of_norm_prime hp89.out _ NI89N1
def MulI89N0 : IdealMulLeCertificate' Table 
  ![![89, 0, 0, 0, 0], ![-23, -53, -55, -24, 20]] ![![89, 0, 0, 0, 0], ![39, 1, 0, 0, 0]]
  ![![89, 0, 0, 0, 0]] where
 M := ![![![7921, 0, 0, 0, 0], ![3471, 89, 0, 0, 0]], ![![-2047, -4717, -4895, -2136, 1780], ![-801, -1869, -1958, -890, 712]]]
 hmul := by decide  
 g := ![![![![89, 0, 0, 0, 0]], ![![39, 1, 0, 0, 0]]], ![![![-23, -53, -55, -24, 20]], ![![-9, -21, -22, -10, 8]]]]
 hle2 := by decide  


def PBC89 : ContainsPrimesAboveP 89 ![I89N0, I89N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI89N0
    exact isPrimeI89N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 89 (by decide) (𝕀 ⊙ MulI89N0)
instance hp97 : Fact (Nat.Prime 97) := {out := by norm_num}

def I97N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![97, 0, 0, 0, 0], ![-4, -24, -61, -19, 20]] i)))

def SI97N0: IdealEqSpanCertificate' Table ![![97, 0, 0, 0, 0], ![-4, -24, -61, -19, 20]] 
 ![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![0, 0, 97, 0, 0], ![80, 62, 53, 1, 0], ![37, 48, 57, 0, 1]] where
  M :=![![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![0, 0, 97, 0, 0], ![0, 0, 0, 97, 0], ![0, 0, 0, 0, 97]], ![![-4, -24, -61, -19, 20], ![101, 216, 216, 39, -58], ![-309, -514, -480, -51, 136], ![332, 492, 451, 87, -90], ![-441, -582, -597, 36, 196]]]
  hmulB := by decide  
  f := ![![![27449, 52368, 37198, 3442, -8504], ![-39770, -27936, 0, 0, 0]], ![![-4572, -8711, -6159, -561, 1404], ![6693, 4656, 0, 0, 0]], ![![0, 0, 1, 0, 0], ![0, 0, 0, 0, 0]], ![![19712, 37598, 26681, 2461, -6096], ![-28620, -20064, 0, 0, 0]], ![![8209, 15672, 11160, 1041, -2555], ![-11829, -8352, 0, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![-80, -62, -53, 97, 0], ![-37, -48, -57, 0, 97]], ![![8, 2, -2, -19, 20], ![-9, 6, 15, 39, -58], ![-13, -40, -57, -51, 136], ![-34, -6, 10, 87, -90], ![-109, -126, -141, 36, 196]]]
  hle1 := by decide   
  hle2 := by decide  


def P97P0 : CertificateIrreducibleZModOfList' 97 3 2 6 [94, 62, 80, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [80, 15, 70], [34, 81, 27], [0, 1]]
 g := ![![[59, 52, 95], [55, 75], [0, 35], [42, 6], [89, 95], [1]], ![[69, 73, 44, 96], [41, 25], [6, 44], [33, 91], [17, 93], [72, 85, 58, 8]], ![[59, 32, 7, 91], [20, 85], [66, 86], [79, 70], [16, 35], [11, 1, 83, 89]]]
 h' := ![![[80, 15, 70], [92, 71, 17], [11, 51, 47], [60, 82, 36], [82, 21, 54], [3, 35, 17], [0, 1]], ![[34, 81, 27], [18, 24, 42], [34, 78, 5], [4, 64, 23], [83, 21, 24], [56, 66, 44], [80, 15, 70]], ![[0, 1], [7, 2, 38], [74, 65, 45], [78, 48, 38], [36, 55, 19], [52, 93, 36], [34, 81, 27]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [35], []]
 b := ![[], [28, 48], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI97N0 : CertifiedPrimeIdeal' SI97N0 97 where
  n := 3
  hpos := by decide
  P := [94, 62, 80, 1]
  hirr := P97P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![876627121, 2164555809, 1526068712, 1717074658, 527085435]
  a := ![19, 19, 10, 20, 25]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-1608159862, -1336022411, -1232193381, 1717074658, 527085435]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI97N0 : Ideal.IsPrime I97N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI97N0 B_one_repr
lemma NI97N0 : Nat.card (O ⧸ I97N0) = 912673 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI97N0

def I97N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![97, 0, 0, 0, 0], ![-44, -34, -3, -1, 1]] i)))

def SI97N1: IdealEqSpanCertificate' Table ![![97, 0, 0, 0, 0], ![-44, -34, -3, -1, 1]] 
 ![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![35, 88, 1, 0, 0], ![12, 26, 0, 1, 0], ![73, 62, 0, 0, 1]] where
  M :=![![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![0, 0, 97, 0, 0], ![0, 0, 0, 97, 0], ![0, 0, 0, 0, 97]], ![![-44, -34, -3, -1, 1], ![5, -33, -22, 2, -3], ![-16, -60, -69, -69, 7], ![-16, -8, 23, -73, -71], ![-222, -528, -429, -297, -1]]]
  hmulB := by decide  
  f := ![![![72111749, -261017562, -186913283, 18079783, -26473119], ![64101771, -833855456, 317772, 0, 0]], ![![97863272, -354228387, -253661060, 24536184, -35926820], ![86992898, -1131629936, 431262, 0, 0]], ![![114785171, -415479368, -297522557, 28778826, -42139062], ![102035148, -1327304352, 505830, 0, 0]], ![![35152464, -127238624, -91114915, 8813384, -12904895], ![31247867, -406480864, 154908, 0, 0]], ![![116821433, -422849930, -302800572, 29289356, -42886603], ![103845212, -1350850560, 514800, 0, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![-35, -88, 97, 0, 0], ![-12, -26, 0, 97, 0], ![-73, -62, 0, 0, 97]], ![![0, 2, -3, -1, 1], ![10, 21, -22, 2, -3], ![28, 76, -69, -69, 7], ![54, 44, 23, -73, -71], ![190, 464, -429, -297, -1]]]
  hle1 := by decide   
  hle2 := by decide  


def P97P1 : CertificateIrreducibleZModOfList' 97 2 2 6 [91, 27, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [70, 96], [0, 1]]
 g := ![![[44, 16], [9], [62], [16], [32], [70, 1]], ![[0, 81], [9], [62], [16], [32], [43, 96]]]
 h' := ![![[70, 96], [86, 93], [56, 3], [84, 81], [52, 4], [32, 56], [0, 1]], ![[0, 1], [0, 4], [72, 94], [31, 16], [41, 93], [72, 41], [70, 96]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [55]]
 b := ![[], [56, 76]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI97N1 : CertifiedPrimeIdeal' SI97N1 97 where
  n := 2
  hpos := by decide
  P := [91, 27, 1]
  hirr := P97P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-976, -2161, -1921, -439, 928]
  a := ![1, -3, 1, -4, 3]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![39, 1245, -1921, -439, 928]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI97N1 : Ideal.IsPrime I97N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI97N1 B_one_repr
lemma NI97N1 : Nat.card (O ⧸ I97N1) = 9409 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI97N1
def MulI97N0 : IdealMulLeCertificate' Table 
  ![![97, 0, 0, 0, 0], ![-4, -24, -61, -19, 20]] ![![97, 0, 0, 0, 0], ![-44, -34, -3, -1, 1]]
  ![![97, 0, 0, 0, 0]] where
 M := ![![![9409, 0, 0, 0, 0], ![-4268, -3298, -291, -97, 97]], ![![-388, -2328, -5917, -1843, 1940], ![-3104, -5820, -4268, -388, 970]]]
 hmul := by decide  
 g := ![![![![97, 0, 0, 0, 0]], ![![-44, -34, -3, -1, 1]]], ![![![-4, -24, -61, -19, 20]], ![![-32, -60, -44, -4, 10]]]]
 hle2 := by decide  


def PBC97 : ContainsPrimesAboveP 97 ![I97N0, I97N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI97N0
    exact isPrimeI97N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 97 (by decide) (𝕀 ⊙ MulI97N0)
instance hp101 : Fact (Nat.Prime 101) := {out := by norm_num}

def I101N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1, 8, 50, 12, -14]] i)))

def SI101N0: IdealEqSpanCertificate' Table ![![-1, 8, 50, 12, -14]] 
 ![![101, 0, 0, 0, 0], ![0, 101, 0, 0, 0], ![0, 0, 101, 0, 0], ![76, 25, 22, 1, 0], ![58, 93, 73, 0, 1]] where
  M :=![![![-1, 8, 50, 12, -14], ![-72, -149, -160, -14, 38], ![214, 324, 307, 8, -66], ![-158, -156, -154, 21, 22], ![192, 168, 186, -54, -13]]]
  hmulB := by decide  
  f := ![![![7, 16, 10, 8, 2]], ![![20, 55, 40, 46, 14]], ![![130, 316, 223, 252, 78]], ![![42, 103, 72, 79, 24]], ![![124, 307, 217, 244, 75]]]
  g := ![![![-1, 10, 8, 12, -14], ![-12, -33, -26, -14, 38], ![34, 62, 49, 8, -66], ![-30, -27, -22, 21, 22], ![50, 27, 23, -54, -13]]]
  hle1 := by decide   
  hle2 := by decide  


def P101P0 : CertificateIrreducibleZModOfList' 101 3 2 6 [92, 50, 43, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [47, 72, 91], [11, 28, 10], [0, 1]]
 g := ![![[95, 78, 80], [], [30, 19, 22], [28, 17], [38, 31], [1]], ![[12, 4, 99, 50], [30, 22], [48, 22, 96, 10], [29, 65], [3, 9], [3, 89, 61, 10]], ![[91, 54, 100, 83], [66, 22], [60, 98, 5, 62], [13, 9], [94, 85], [5, 19, 43, 91]]]
 h' := ![![[47, 72, 91], [79, 44, 79], [68, 33], [7, 16, 27], [19, 4, 57], [9, 51, 58], [0, 1]], ![[11, 28, 10], [77, 26, 55], [3, 53, 74], [95, 4, 91], [6, 64, 41], [22, 65, 3], [47, 72, 91]], ![[0, 1], [10, 31, 68], [27, 15, 27], [95, 81, 84], [68, 33, 3], [63, 86, 40], [11, 28, 10]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [74, 71], []]
 b := ![[], [98, 49, 98], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI101N0 : CertifiedPrimeIdeal' SI101N0 101 where
  n := 3
  hpos := by decide
  P := [92, 50, 43, 1]
  hirr := P101P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![361804097, 899444058, 631085170, 721137155, 225285046]
  a := ![13, 9, 10, 5, 23]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-668427251, -377034595, -313660798, 721137155, 225285046]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI101N0 : Ideal.IsPrime I101N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI101N0 B_one_repr
lemma NI101N0 : Nat.card (O ⧸ I101N0) = 1030301 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI101N0

def I101N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![101, 0, 0, 0, 0], ![21, 1, 0, 0, 0]] i)))

def SI101N1: IdealEqSpanCertificate' Table ![![101, 0, 0, 0, 0], ![21, 1, 0, 0, 0]] 
 ![![101, 0, 0, 0, 0], ![21, 1, 0, 0, 0], ![64, 0, 1, 0, 0], ![75, 0, 0, 1, 0], ![74, 0, 0, 0, 1]] where
  M :=![![![101, 0, 0, 0, 0], ![0, 101, 0, 0, 0], ![0, 0, 101, 0, 0], ![0, 0, 0, 101, 0], ![0, 0, 0, 0, 101]], ![![21, 1, 0, 0, 0], ![0, 21, 1, 0, 0], ![0, 1, 21, 2, 0], ![1, 1, 0, 22, 2], ![6, 15, 12, 9, 20]]]
  hmulB := by decide  
  f := ![![![382421080, 74193589, 1282215810, 122002344, -12408], ![-1839293123, 24434526, -6168011016, 626604, 0]], ![![81119206, 15737948, 271983942, 25879168, -2632], ![-390151081, 5183118, -1308360060, 132916, 0]], ![![243358904, 47214110, 815955691, 77637872, -7896], ![-1170459428, 15549254, -3925098764, 398748, 0]], ![![283918646, 55083103, 951948092, 90577497, -9212], ![-1365535637, 18140852, -4579280864, 465206, 0]], ![![280189708, 54359661, 939445247, 89387856, -9091], ![-1347600930, 17902517, -4519136784, 459096, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-21, 101, 0, 0, 0], ![-64, 0, 101, 0, 0], ![-75, 0, 0, 101, 0], ![-74, 0, 0, 0, 101]], ![![0, 1, 0, 0, 0], ![-5, 21, 1, 0, 0], ![-15, 1, 21, 2, 0], ![-18, 1, 0, 22, 2], ![-32, 15, 12, 9, 20]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI101N1 : Nat.card (O ⧸ I101N1) = 101 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI101N1)

lemma isPrimeI101N1 : Ideal.IsPrime I101N1 := prime_ideal_of_norm_prime hp101.out _ NI101N1

def I101N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![101, 0, 0, 0, 0], ![36, 1, 0, 0, 0]] i)))

def SI101N2: IdealEqSpanCertificate' Table ![![101, 0, 0, 0, 0], ![36, 1, 0, 0, 0]] 
 ![![101, 0, 0, 0, 0], ![36, 1, 0, 0, 0], ![17, 0, 1, 0, 0], ![80, 0, 0, 1, 0], ![68, 0, 0, 0, 1]] where
  M :=![![![101, 0, 0, 0, 0], ![0, 101, 0, 0, 0], ![0, 0, 101, 0, 0], ![0, 0, 0, 101, 0], ![0, 0, 0, 0, 101]], ![![36, 1, 0, 0, 0], ![0, 36, 1, 0, 0], ![0, 1, 36, 2, 0], ![1, 1, 0, 37, 2], ![6, 15, 12, 9, 35]]]
  hmulB := by decide  
  f := ![![![3170125, 280147, 9639743, 482376, -2880], ![-8897999, 208565, -27050628, 145440, 0]], ![![1188720, 105029, 3614849, 180888, -1080], ![-3336534, 78275, -10143834, 54540, 0]], ![![660349, 58333, 2008297, 100496, -600], ![-1853487, 43532, -5635598, 30300, 0]], ![![2509684, 221782, 7631463, 381881, -2280], ![-7044254, 165117, -21415080, 115140, 0]], ![![2134276, 188612, 6490124, 324768, -1939], ![-5990548, 140420, -18212304, 97920, 0]]]
  g := ![![![1, 0, 0, 0, 0], ![-36, 101, 0, 0, 0], ![-17, 0, 101, 0, 0], ![-80, 0, 0, 101, 0], ![-68, 0, 0, 0, 101]], ![![0, 1, 0, 0, 0], ![-13, 36, 1, 0, 0], ![-8, 1, 36, 2, 0], ![-31, 1, 0, 37, 2], ![-38, 15, 12, 9, 35]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI101N2 : Nat.card (O ⧸ I101N2) = 101 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI101N2)

lemma isPrimeI101N2 : Ideal.IsPrime I101N2 := prime_ideal_of_norm_prime hp101.out _ NI101N2
def MulI101N0 : IdealMulLeCertificate' Table 
  ![![-1, 8, 50, 12, -14]] ![![101, 0, 0, 0, 0], ![21, 1, 0, 0, 0]]
  ![![101, 0, 0, 0, 0], ![70, 40, 61, 12, -18]] where
 M := ![![![-101, 808, 5050, 1212, -1414], ![-93, 19, 890, 238, -256]]]
 hmul := by decide  
 g := ![![![![-71, -32, -11, 0, 4], ![101, 0, 0, 0, 0]], ![![-3, -1, 7, 2, -2], ![3, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI101N1 : IdealMulLeCertificate' Table 
  ![![101, 0, 0, 0, 0], ![70, 40, 61, 12, -18]] ![![101, 0, 0, 0, 0], ![36, 1, 0, 0, 0]]
  ![![101, 0, 0, 0, 0]] where
 M := ![![![10201, 0, 0, 0, 0], ![3636, 101, 0, 0, 0]], ![![7070, 4040, 6161, 1212, -1818], ![2424, 1313, 2020, 404, -606]]]
 hmul := by decide  
 g := ![![![![101, 0, 0, 0, 0]], ![![36, 1, 0, 0, 0]]], ![![![70, 40, 61, 12, -18]], ![![24, 13, 20, 4, -6]]]]
 hle2 := by decide  


def PBC101 : ContainsPrimesAboveP 101 ![I101N0, I101N1, I101N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI101N0
    exact isPrimeI101N1
    exact isPrimeI101N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 101 (by decide) (𝕀 ⊙ MulI101N0 ⊙ MulI101N1)
instance hp103 : Fact (Nat.Prime 103) := {out := by norm_num}

def I103N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![103, 0, 0, 0, 0]] i)))

def SI103N0: IdealEqSpanCertificate' Table ![![103, 0, 0, 0, 0]] 
 ![![103, 0, 0, 0, 0], ![0, 103, 0, 0, 0], ![0, 0, 103, 0, 0], ![0, 0, 0, 103, 0], ![0, 0, 0, 0, 103]] where
  M :=![![![103, 0, 0, 0, 0], ![0, 103, 0, 0, 0], ![0, 0, 103, 0, 0], ![0, 0, 0, 103, 0], ![0, 0, 0, 0, 103]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P103P0 : CertificateIrreducibleZModOfList' 103 5 2 6 [47, 72, 60, 2, 53, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [68, 100, 29, 29, 4], [53, 1, 62, 29, 70], [19, 61, 43, 16, 75], [13, 43, 72, 29, 57], [0, 1]]
 g := ![![[38, 30, 73, 78, 16], [19, 22, 7, 72, 14], [34, 63, 76, 29, 15], [18, 45, 39, 58], [50, 1], []], ![[39, 69, 71, 16, 52, 66, 36, 8], [71, 89, 39, 80, 10, 29, 5, 72], [57, 12, 102, 32, 9, 25, 84, 19], [36, 41, 1, 15], [9, 88, 93, 38], [64, 99, 49, 6, 86, 39, 60, 64]], ![[86, 77, 65, 63, 15, 94, 82, 21], [51, 9, 17, 24, 68, 50, 25, 88], [81, 87, 45, 60, 55, 70, 35, 20], [54, 66, 56, 76], [46, 60, 72, 68], [18, 14, 51, 93, 76, 49, 71, 10]], ![[49, 55, 11, 27, 73, 90, 33, 21], [93, 29, 92, 83, 3, 5, 69, 99], [79, 54, 43, 37, 102, 56, 55, 102], [50, 12, 16, 55], [63, 83, 84, 79], [46, 102, 23, 79, 30, 83, 5, 90]], ![[75, 26, 59, 51, 86, 47, 51, 51], [10, 101, 59, 79, 98, 53, 41, 73], [66, 73, 56, 86, 96, 41, 10, 24], [39, 22, 72, 4], [44, 73, 95, 60], [52, 94, 23, 71, 68, 47, 84, 102]]]
 h' := ![![[68, 100, 29, 29, 4], [34, 98, 71, 90, 4], [50, 23, 80, 58, 23], [30, 40, 3, 0, 85], [19, 61, 18, 46, 26], [0, 0, 0, 1], [0, 1]], ![[53, 1, 62, 29, 70], [40, 36, 99, 101, 65], [62, 18, 21, 41, 11], [67, 37, 28, 6, 44], [27, 92, 90, 58, 85], [55, 5, 71, 95, 55], [68, 100, 29, 29, 4]], ![[19, 61, 43, 16, 75], [43, 59, 22, 20, 89], [61, 17, 30, 18, 90], [55, 60, 24, 12, 85], [92, 26, 43, 20, 30], [20, 87, 58, 50, 45], [53, 1, 62, 29, 70]], ![[13, 43, 72, 29, 57], [47, 81, 97, 24, 98], [71, 3, 82, 42, 33], [101, 2, 63, 78, 35], [59, 58, 19, 11, 63], [62, 71, 75, 64, 39], [19, 61, 43, 16, 75]], ![[0, 1], [94, 35, 20, 74, 53], [86, 42, 96, 47, 49], [28, 67, 88, 7, 60], [25, 72, 36, 71, 2], [62, 43, 2, 99, 67], [13, 43, 72, 29, 57]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [95, 9, 83, 11], [], [], []]
 b := ![[], [1, 22, 41, 53, 23], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI103N0 : CertifiedPrimeIdeal' SI103N0 103 where
  n := 5
  hpos := by decide
  P := [47, 72, 60, 2, 53, 1]
  hirr := P103P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![742663854164939, 1831402256079880, 1292351569656472, 1449905355337894, 443634681290386]
  a := ![7, 7, 3, 6, 13]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![7210328681213, 17780604427960, 12547102618024, 14076751022698, 4307132828062]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI103N0 : Ideal.IsPrime I103N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI103N0 B_one_repr
lemma NI103N0 : Nat.card (O ⧸ I103N0) = 11592740743 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI103N0

def PBC103 : ContainsPrimesAboveP 103 ![I103N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI103N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![103, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 103 (by decide) 𝕀



lemma PB512I2_primes (p : ℕ) :
  p ∈ Set.range ![67, 71, 73, 79, 83, 89, 97, 101, 103] ↔ Nat.Prime p ∧ 61 < p ∧ p ≤ 103 := by
  rw [← List.mem_ofFn']
  convert primes_range 61 103 (by omega)

def PB512I2 : PrimesBelowBoundCertificateInterval O 61 103 512 where
  m := 9
  g := ![2, 3, 2, 2, 3, 2, 2, 3, 1]
  P := ![67, 71, 73, 79, 83, 89, 97, 101, 103]
  hP := PB512I2_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I67N0, I67N1]
    · exact ![I71N0, I71N1, I71N2]
    · exact ![I73N0, I73N1]
    · exact ![I79N0, I79N1]
    · exact ![I83N0, I83N1, I83N2]
    · exact ![I89N0, I89N1]
    · exact ![I97N0, I97N1]
    · exact ![I101N0, I101N1, I101N2]
    · exact ![I103N0]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC67
    · exact PBC71
    · exact PBC73
    · exact PBC79
    · exact PBC83
    · exact PBC89
    · exact PBC97
    · exact PBC101
    · exact PBC103
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![20151121, 67]
    · exact ![357911, 71, 71]
    · exact ![28398241, 73]
    · exact ![38950081, 79]
    · exact ![571787, 83, 83]
    · exact ![62742241, 89]
    · exact ![912673, 9409]
    · exact ![1030301, 101, 101]
    · exact ![11592740743]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI67N0
      exact NI67N1
    · dsimp ; intro j
      fin_cases j
      exact NI71N0
      exact NI71N1
      exact NI71N2
    · dsimp ; intro j
      fin_cases j
      exact NI73N0
      exact NI73N1
    · dsimp ; intro j
      fin_cases j
      exact NI79N0
      exact NI79N1
    · dsimp ; intro j
      fin_cases j
      exact NI83N0
      exact NI83N1
      exact NI83N2
    · dsimp ; intro j
      fin_cases j
      exact NI89N0
      exact NI89N1
    · dsimp ; intro j
      fin_cases j
      exact NI97N0
      exact NI97N1
    · dsimp ; intro j
      fin_cases j
      exact NI101N0
      exact NI101N1
      exact NI101N2
    · dsimp ; intro j
      fin_cases j
      exact NI103N0
  β := ![I67N1, I71N1, I71N2, I73N1, I79N1, I83N1, I83N2, I89N1, I101N1, I101N2]
  Il := ![[I67N1], [I71N1, I71N2], [I73N1], [I79N1], [I83N1, I83N2], [I89N1], [], [I101N1, I101N2], []]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
