
import IdealArithmetic.Examples.NF5_3_364500000_2.RI5_3_364500000_2
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp199 : Fact (Nat.Prime 199) := {out := by norm_num}

def I199N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![33155, 13734, -14886, -4455, 5310]] i)))

def SI199N0: IdealEqSpanCertificate' Table ![![33155, 13734, -14886, -4455, 5310]] 
 ![![199, 0, 0, 0, 0], ![0, 199, 0, 0, 0], ![0, 0, 199, 0, 0], ![43, 108, 53, 1, 0], ![154, 48, 42, 0, 1]] where
  M :=![![![33155, 13734, -14886, -4455, 5310], ![-127440, -49051, 57618, 12708, -17820], ![213840, 75807, -97399, -13662, 25416], ![-241272, -70704, 111492, -2089, -18414], ![281124, 79578, -130230, 5733, 19529]]]
  hmulB := by decide  
  f := ![![![-10027, 36, 2898, 81, -936]], ![![22464, 3329, -3834, -1692, 324]], ![![-3888, 5841, 5669, -2538, -3384]], ![![9137, 3447, 73, -1612, -954]], ![![-3070, 2166, 2568, -927, -1405]]]
  g := ![![![-2980, 1206, -9, -4455, 5310], ![10404, -2845, 666, 12708, -17820], ![-15642, 1665, -2215, -13662, 25416], ![13489, 5220, 5003, -2089, -18414], ![-14939, -7422, -6303, 5733, 19529]]]
  hle1 := by decide   
  hle2 := by decide  


def P199P0 : CertificateIrreducibleZModOfList' 199 3 2 7 [119, 18, 71, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [144, 65, 84], [183, 133, 115], [0, 1]]
 g := ![![[161, 143, 7], [36, 98, 35], [69, 90, 65], [131, 114], [107, 70], [59, 66], [1]], ![[180, 155, 187, 156], [102, 58, 188, 137], [168, 97, 33, 75], [51, 26], [72, 180], [145, 100], [100, 89, 182, 82]], ![[180, 73, 49, 125], [128, 6, 197, 103], [84, 32, 32, 72], [135, 188], [128, 175], [38, 193], [179, 132, 142, 117]]]
 h' := ![![[144, 65, 84], [94, 145, 112], [147, 168, 45], [58, 149, 142], [181, 145, 121], [175, 144, 104], [80, 181, 128], [0, 1]], ![[183, 133, 115], [188, 188, 12], [135, 114, 197], [114, 10, 159], [51, 176, 15], [103, 1, 58], [29, 185, 189], [144, 65, 84]], ![[0, 1], [30, 65, 75], [128, 116, 156], [51, 40, 97], [14, 77, 63], [108, 54, 37], [75, 32, 81], [183, 133, 115]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [75, 127], []]
 b := ![[], [32, 105, 143], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI199N0 : CertifiedPrimeIdeal' SI199N0 199 where
  n := 3
  hpos := by decide
  P := [119, 18, 71, 1]
  hirr := P199P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![10314431, 5946085, 1583830, -2740502, -2113544]
  a := ![0, -7, 2, -4, -9]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![2279607, 2026987, 1183916, -2740502, -2113544]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI199N0 : Ideal.IsPrime I199N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI199N0 B_one_repr
lemma NI199N0 : Nat.card (O ⧸ I199N0) = 7880599 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI199N0

def I199N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![10027, -36, -2898, -81, 936]] i)))

def SI199N1: IdealEqSpanCertificate' Table ![![10027, -36, -2898, -81, 936]] 
 ![![199, 0, 0, 0, 0], ![0, 199, 0, 0, 0], ![15, 146, 1, 0, 0], ![198, 184, 0, 1, 0], ![120, 24, 0, 0, 1]] where
  M :=![![![10027, -36, -2898, -81, 936], ![-22464, -3329, 3834, 1692, -324], ![3888, -5841, -5669, 2538, 3384], ![-29376, -15300, -3528, 7021, 5238], ![-18252, -20376, -10674, 9135, 8875]]]
  hmulB := by decide  
  f := ![![![-33155, -13734, 14886, 4455, -5310]], ![![127440, 49051, -57618, -12708, 17820]], ![![89925, 34571, -40661, -8919, 12546]], ![![86058, 32044, -39024, -7307, 11286]], ![![-6036, -2766, 2682, 1125, -1151]]]
  g := ![![![-215, 2088, -2898, -81, 936], ![-1890, -4355, 3834, 1692, -324], ![-4119, 1375, -5669, 2538, 3384], ![-10026, -4612, -3528, 7021, 5238], ![-13728, -1788, -10674, 9135, 8875]]]
  hle1 := by decide   
  hle2 := by decide  


def P199P1 : CertificateIrreducibleZModOfList' 199 2 2 7 [57, 5, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [194, 198], [0, 1]]
 g := ![![[35, 7], [60, 124], [34, 106], [18], [158], [29], [194, 1]], ![[0, 192], [37, 75], [101, 93], [18], [158], [29], [189, 198]]]
 h' := ![![[194, 198], [162, 112], [52, 129], [157, 107], [136, 139], [171, 122], [86, 167], [0, 1]], ![[0, 1], [0, 87], [4, 70], [20, 92], [38, 60], [158, 77], [47, 32], [194, 198]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [1]]
 b := ![[], [51, 100]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI199N1 : CertifiedPrimeIdeal' SI199N1 199 where
  n := 2
  hpos := by decide
  P := [57, 5, 1]
  hirr := P199P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![124821, 50364, -178834, 12603, 138014]
  a := ![3, -62, -1, -65, 5]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-81657, 103160, -178834, 12603, 138014]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI199N1 : Ideal.IsPrime I199N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI199N1 B_one_repr
lemma NI199N1 : Nat.card (O ⧸ I199N1) = 39601 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI199N1
def MulI199N0 : IdealMulLeCertificate' Table 
  ![![33155, 13734, -14886, -4455, 5310]] ![![10027, -36, -2898, -81, 936]]
  ![![199, 0, 0, 0, 0]] where
 M := ![![![-199, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC199 : ContainsPrimesAboveP 199 ![I199N0, I199N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI199N0
    exact isPrimeI199N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 199 (by decide) (𝕀 ⊙ MulI199N0)
instance hp211 : Fact (Nat.Prime 211) := {out := by norm_num}

def I211N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![211, 0, 0, 0, 0]] i)))

def SI211N0: IdealEqSpanCertificate' Table ![![211, 0, 0, 0, 0]] 
 ![![211, 0, 0, 0, 0], ![0, 211, 0, 0, 0], ![0, 0, 211, 0, 0], ![0, 0, 0, 211, 0], ![0, 0, 0, 0, 211]] where
  M :=![![![211, 0, 0, 0, 0], ![0, 211, 0, 0, 0], ![0, 0, 211, 0, 0], ![0, 0, 0, 211, 0], ![0, 0, 0, 0, 211]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P211P0 : CertificateIrreducibleZModOfList' 211 5 2 7 [107, 151, 18, 99, 144, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 1, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [23, 118, 207, 195, 133], [121, 79, 99, 146, 130], [95, 60, 140, 210, 33], [39, 164, 187, 82, 126], [0, 1]]
 g := ![![[55, 117, 89, 194, 24], [141, 32, 182, 91, 117], [27, 208, 3, 21], [87, 127, 16, 14], [72, 190, 51, 111, 204], [67, 1], []], ![[26, 93, 27, 33, 23, 60, 164, 94], [80, 4, 133, 43, 86, 46, 103, 140], [181, 9, 118, 20], [38, 131, 32, 169], [4, 192, 34, 60, 81, 189, 119, 131], [11, 177, 128, 109], [139, 123, 165, 16, 44, 15, 176, 198]], ![[66, 37, 8, 205, 175, 151, 179, 149], [189, 95, 33, 120, 5, 17, 29, 104], [157, 16, 118, 80], [132, 87, 204, 45], [115, 205, 37, 76, 196, 60, 75, 181], [92, 24, 149, 49], [163, 112, 25, 119, 44, 167, 23, 68]], ![[47, 86, 78, 140, 129, 51, 29, 35], [100, 31, 166, 43, 198, 7, 66, 192], [103, 70, 110, 70], [165, 166, 41, 120], [57, 133, 64, 205, 8, 190, 153, 60], [180, 7, 201, 143], [86, 130, 191, 98, 19, 156, 167, 67]], ![[110, 135, 117, 134, 163, 152, 121, 46], [199, 74, 72, 178, 9, 47, 77, 66], [52, 94, 72, 93], [173, 197, 179, 13], [41, 148, 36, 209, 53, 121, 143, 93], [41, 92, 23, 100], [84, 196, 143, 136, 66, 123, 199, 96]]]
 h' := ![![[23, 118, 207, 195, 133], [105, 98, 155, 68, 92], [166, 190, 41, 52, 31], [34, 27, 113, 42, 134], [103, 51, 100, 124, 15], [5, 115, 120, 101, 170], [0, 0, 0, 1], [0, 1]], ![[121, 79, 99, 146, 130], [189, 71, 23, 202, 23], [184, 184, 169, 136, 177], [136, 159, 82, 143, 130], [68, 13, 54, 77, 13], [192, 173, 203, 19, 84], [37, 141, 149, 197, 98], [23, 118, 207, 195, 133]], ![[95, 60, 140, 210, 33], [177, 98, 208, 133, 190], [97, 80, 196, 96, 185], [207, 4, 65, 131, 162], [163, 80, 121, 134, 195], [94, 93, 63, 73, 4], [77, 139, 121, 168, 7], [121, 79, 99, 146, 130]], ![[39, 164, 187, 82, 126], [49, 197, 177, 109, 109], [56, 123, 143, 24, 206], [152, 147, 170, 156, 80], [100, 20, 200, 142, 139], [40, 177, 96, 73, 134], [164, 123, 166, 105, 96], [95, 60, 140, 210, 33]], ![[0, 1], [153, 169, 70, 121, 8], [56, 56, 84, 114, 34], [61, 85, 203, 161, 127], [209, 47, 158, 156, 60], [153, 75, 151, 156, 30], [113, 19, 197, 162, 10], [39, 164, 187, 82, 126]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [23, 128, 186, 155], [], [], []]
 b := ![[], [49, 151, 168, 0, 167], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI211N0 : CertifiedPrimeIdeal' SI211N0 211 where
  n := 5
  hpos := by decide
  P := [107, 151, 18, 99, 144, 1]
  hirr := P211P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![215052547024, 125893467766, 36709655299, -57091720625, -45208295786]
  a := ![1, -6, 1, -5, -4]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![1019206384, 596651506, 173979409, -270576875, -214257326]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI211N0 : Ideal.IsPrime I211N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI211N0 B_one_repr
lemma NI211N0 : Nat.card (O ⧸ I211N0) = 418227202051 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI211N0

def PBC211 : ContainsPrimesAboveP 211 ![I211N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI211N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![211, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 211 (by decide) 𝕀

instance hp223 : Fact (Nat.Prime 223) := {out := by norm_num}

def I223N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-63791, -50112, -23322, 7833, 9214]] i)))

def SI223N0: IdealEqSpanCertificate' Table ![![-63791, -50112, -23322, 7833, 9214]] 
 ![![223, 0, 0, 0, 0], ![0, 223, 0, 0, 0], ![0, 0, 223, 0, 0], ![0, 0, 0, 223, 0], ![160, 48, 39, 170, 1]] where
  M :=![![![-63791, -50112, -23322, 7833, 9214], ![-221136, -172801, -79034, 27068, 31332], ![-375984, -295343, -137205, 46294, 54136], ![-539064, -421648, -193848, 65805, 76922], ![-538956, -423132, -195890, 66533, 77207]]]
  hmulB := by decide  
  f := ![![![-1769, -26, 486, 29, -148]], ![![3552, 403, -702, -212, 116]], ![![-1392, 575, 847, -238, -424]], ![![3312, 1620, 316, -743, -534]], ![![1780, 1413, 593, -637, -567]]]
  g := ![![![-6897, -2208, -1716, -6989, 9214], ![-23472, -7519, -5834, -23764, 31332], ![-40528, -12977, -10083, -41062, 54136], ![-57608, -18448, -14322, -58345, 76922], ![-57812, -18516, -14381, -58559, 77207]]]
  hle1 := by decide   
  hle2 := by decide  


def P223P0 : CertificateIrreducibleZModOfList' 223 4 2 7 [137, 98, 192, 32, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 1, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [118, 23, 29, 35], [43, 195, 222, 86], [30, 4, 195, 102], [0, 1]]
 g := ![![[214, 10, 188, 47], [111, 165, 48, 82], [75, 144, 129, 166], [41, 157, 57, 72], [138, 8, 11, 53], [163, 191, 1], []], ![[180, 6, 180, 128, 187, 125], [220, 182, 171, 52, 98, 207], [3, 64, 122, 50, 188, 208], [31, 110, 183, 14, 25, 182], [159, 219, 35, 137, 57, 159], [95, 167, 78], [40, 159, 21, 195, 100, 59]], ![[136, 38, 155, 158, 134, 19], [60, 170, 58, 48, 90, 39], [210, 89, 66, 16, 79, 213], [12, 138, 192, 117, 42, 86], [38, 138, 51, 104, 143, 148], [121, 73, 156], [212, 21, 76, 1, 199, 60]], ![[90, 135, 5, 165, 80, 26], [74, 0, 46, 212, 81, 114], [214, 72, 166, 38, 75, 134], [210, 208, 197, 86, 43, 108], [3, 18, 31, 151, 19, 113], [215, 103, 50], [199, 48, 83, 156, 8, 174]]]
 h' := ![![[118, 23, 29, 35], [180, 33, 215, 173], [206, 108, 7, 159], [181, 66, 17, 101], [49, 167, 54, 90], [192, 6, 24, 161], [0, 0, 0, 1], [0, 1]], ![[43, 195, 222, 86], [187, 71, 198, 77], [169, 128, 180, 116], [93, 119, 82, 57], [16, 114, 97, 94], [97, 126, 117, 9], [63, 14, 173, 154], [118, 23, 29, 35]], ![[30, 4, 195, 102], [158, 184, 206, 193], [27, 61, 214, 13], [137, 67, 54, 37], [33, 113, 72, 1], [136, 61, 218, 212], [65, 100, 45, 143], [43, 195, 222, 86]], ![[0, 1], [100, 158, 50, 3], [51, 149, 45, 158], [129, 194, 70, 28], [216, 52, 0, 38], [20, 30, 87, 64], [183, 109, 5, 148], [30, 4, 195, 102]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [42, 159, 90], []]
 b := ![[], [], [167, 3, 82, 56], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI223N0 : CertifiedPrimeIdeal' SI223N0 223 where
  n := 4
  hpos := by decide
  P := [137, 98, 192, 32, 1]
  hirr := P223P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-175210129184, -101704088016, -29141379235, 47148126342, 37183520637]
  a := ![1, 25, -3, 18, 13]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-27464454848, -8459699904, -6633626386, -28134755076, 37183520637]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI223N0 : Ideal.IsPrime I223N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI223N0 B_one_repr
lemma NI223N0 : Nat.card (O ⧸ I223N0) = 2472973441 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI223N0

def I223N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![29417, 17204, 5006, -7832, -6200]] i)))

def SI223N1: IdealEqSpanCertificate' Table ![![29417, 17204, 5006, -7832, -6200]] 
 ![![223, 0, 0, 0, 0], ![212, 1, 0, 0, 0], ![51, 0, 1, 0, 0], ![63, 0, 0, 1, 0], ![37, 0, 0, 0, 1]] where
  M :=![![![29417, 17204, 5006, -7832, -6200], ![148800, 86959, 25272, -39588, -31328], ![375936, 219752, 63891, -100040, -79176], ![875712, 511862, 148804, -233019, -184416], ![1220064, 713160, 207334, -324656, -256943]]]
  hmulB := by decide  
  f := ![![![-13945, -8532, 5946, 5128, -4136]], ![![-12812, -7897, 5456, 4780, -3840]], ![![-4293, -2428, 1853, 1344, -1136]], ![![-1881, -1606, 750, 1229, -872]], ![![-4867, -2404, 2140, 1112, -1047]]]
  g := ![![![-14127, 17204, 5006, -7832, -6200], ![-71400, 86959, 25272, -39588, -31328], ![-180439, 219752, 63891, -100040, -79176], ![-420289, 511862, 148804, -233019, -184416], ![-585577, 713160, 207334, -324656, -256943]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI223N1 : Nat.card (O ⧸ I223N1) = 223 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI223N1)

lemma isPrimeI223N1 : Ideal.IsPrime I223N1 := prime_ideal_of_norm_prime hp223.out _ NI223N1
def MulI223N0 : IdealMulLeCertificate' Table 
  ![![-63791, -50112, -23322, 7833, 9214]] ![![29417, 17204, 5006, -7832, -6200]]
  ![![223, 0, 0, 0, 0]] where
 M := ![![![336953, 265370, 123096, -40363, -47722]]]
 hmul := by decide  
 g := ![![![![1511, 1190, 552, -181, -214]]]]
 hle2 := by decide  


def PBC223 : ContainsPrimesAboveP 223 ![I223N0, I223N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI223N0
    exact isPrimeI223N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 223 (by decide) (𝕀 ⊙ MulI223N0)
instance hp227 : Fact (Nat.Prime 227) := {out := by norm_num}

def I227N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![18205, 22885, -6504, -20550, 13524]] i)))

def SI227N0: IdealEqSpanCertificate' Table ![![18205, 22885, -6504, -20550, 13524]] 
 ![![227, 0, 0, 0, 0], ![0, 227, 0, 0, 0], ![0, 0, 227, 0, 0], ![178, 112, 85, 1, 0], ![153, 130, 75, 0, 1]] where
  M :=![![![18205, 22885, -6504, -20550, 13524], ![-324576, -178163, 140966, 95184, -82200], ![986400, 455479, -437747, -187834, 190368], ![-2122128, -871450, 953566, 276133, -334568], ![2662896, 1082809, -1197716, -333862, 412417]]]
  hmulB := by decide  
  f := ![![![-37633, -23141, -7286, 10526, 8524]], ![![-204576, -117631, -33238, 53620, 42104]], ![![-505248, -296859, -87043, 135178, 107240]], ![![-324854, -190391, -55591, 86715, 68712]], ![![-316707, -185291, -53943, 84398, 66821]]]
  g := ![![![7079, 2495, 3198, -20550, 13524], ![-20664, -673, -7862, 95184, -82200], ![23324, -14339, 5509, -187834, 190368], ![-374, 51522, 11343, 276133, -334568], ![-4447, -66691, -16523, -333862, 412417]]]
  hle1 := by decide   
  hle2 := by decide  


def P227P0 : CertificateIrreducibleZModOfList' 227 3 2 7 [204, 148, 96, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [212, 182, 94], [146, 44, 133], [0, 1]]
 g := ![![[177, 10, 78], [7, 34, 186], [189, 207], [96, 122], [175, 10], [116, 151, 136], [1]], ![[94, 223, 96, 96], [9, 94, 205, 201], [112, 108], [221, 77], [141, 65], [36, 108, 191, 118], [135, 207, 208, 218]], ![[26, 25, 82, 100], [76, 64, 172, 212], [63, 189], [76, 188], [100, 47], [174, 87, 116, 73], [225, 148, 70, 9]]]
 h' := ![![[212, 182, 94], [161, 210, 140], [163, 119, 58], [105, 3, 52], [124, 208, 203], [171, 0, 64], [23, 79, 131], [0, 1]], ![[146, 44, 133], [61, 186, 22], [128, 25, 118], [220, 78, 73], [178, 163, 109], [106, 105, 92], [184, 33, 24], [212, 182, 94]], ![[0, 1], [150, 58, 65], [151, 83, 51], [8, 146, 102], [59, 83, 142], [211, 122, 71], [147, 115, 72], [146, 44, 133]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [210, 26], []]
 b := ![[], [26, 91, 77], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI227N0 : CertifiedPrimeIdeal' SI227N0 227 where
  n := 3
  hpos := by decide
  P := [204, 148, 96, 1]
  hirr := P227P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![18284227, 11585258, 3174599, -5961400, -3201259]
  a := ![-1, -7, 5, 5, -19]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![6912802, 4825664, 3303912, -5961400, -3201259]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI227N0 : Ideal.IsPrime I227N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI227N0 B_one_repr
lemma NI227N0 : Nat.card (O ⧸ I227N0) = 11697083 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI227N0

def I227N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![1025, 599, 174, -273, -216]] i)))

def SI227N1: IdealEqSpanCertificate' Table ![![1025, 599, 174, -273, -216]] 
 ![![227, 0, 0, 0, 0], ![77, 1, 0, 0, 0], ![100, 0, 1, 0, 0], ![84, 0, 0, 1, 0], ![97, 0, 0, 0, 1]] where
  M :=![![![1025, 599, 174, -273, -216], ![5184, 3029, 880, -1380, -1092], ![13104, 7658, 2225, -3488, -2760], ![30528, 17842, 5186, -8125, -6430], ![42540, 24863, 7226, -11321, -8959]]]
  hmulB := by decide  
  f := ![![![-1637, -121, 380, 127, -154]], ![![-539, -38, 124, 41, -50]], ![![-748, -62, 177, 60, -72]], ![![-564, -28, 122, 41, -50]], ![![-763, -74, 188, 62, -75]]]
  g := ![![![-82, 599, 174, -273, -216], ![-415, 3029, 880, -1380, -1092], ![-1050, 7658, 2225, -3488, -2760], ![-2448, 17842, 5186, -8125, -6430], ![-3412, 24863, 7226, -11321, -8959]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI227N1 : Nat.card (O ⧸ I227N1) = 227 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI227N1)

lemma isPrimeI227N1 : Ideal.IsPrime I227N1 := prime_ideal_of_norm_prime hp227.out _ NI227N1

def I227N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![11321, 490, -2858, -325, 782]] i)))

def SI227N2: IdealEqSpanCertificate' Table ![![11321, 490, -2858, -325, 782]] 
 ![![227, 0, 0, 0, 0], ![207, 1, 0, 0, 0], ![27, 0, 1, 0, 0], ![53, 0, 0, 1, 0], ![175, 0, 0, 0, 1]] where
  M :=![![![11321, 490, -2858, -325, 782], ![-18768, -789, 4758, 540, -1300], ![15600, 685, -3929, -442, 1080], ![-3576, -152, 908, 121, -234], ![18588, 774, -4714, -505, 1311]]]
  hmulB := by decide  
  f := ![![![-28109, -9940, 12806, 1767, -3324]], ![![-25281, -8955, 11516, 1607, -3000]], ![![-3717, -1263, 1699, 173, -404]], ![![-6635, -2464, 3010, 556, -866]], ![![-21493, -7452, 9808, 1176, -2439]]]
  g := ![![![-584, 490, -2858, -325, 782], ![947, -789, 4758, 540, -1300], ![-818, 685, -3929, -442, 1080], ![167, -152, 908, 121, -234], ![-956, 774, -4714, -505, 1311]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI227N2 : Nat.card (O ⧸ I227N2) = 227 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI227N2)

lemma isPrimeI227N2 : Ideal.IsPrime I227N2 := prime_ideal_of_norm_prime hp227.out _ NI227N2
def MulI227N0 : IdealMulLeCertificate' Table 
  ![![18205, 22885, -6504, -20550, 13524]] ![![1025, 599, 174, -273, -216]]
  ![![28109, 9940, -12806, -1767, 3324]] where
 M := ![![![28109, 9940, -12806, -1767, 3324]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI227N1 : IdealMulLeCertificate' Table 
  ![![28109, 9940, -12806, -1767, 3324]] ![![11321, 490, -2858, -325, 782]]
  ![![227, 0, 0, 0, 0]] where
 M := ![![![-227, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC227 : ContainsPrimesAboveP 227 ![I227N0, I227N1, I227N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI227N0
    exact isPrimeI227N1
    exact isPrimeI227N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 227 (by decide) (𝕀 ⊙ MulI227N0 ⊙ MulI227N1)
instance hp229 : Fact (Nat.Prime 229) := {out := by norm_num}

def I229N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![995137, 580968, 168552, -264487, -209202]] i)))

def SI229N0: IdealEqSpanCertificate' Table ![![995137, 580968, 168552, -264487, -209202]] 
 ![![229, 0, 0, 0, 0], ![0, 229, 0, 0, 0], ![0, 0, 229, 0, 0], ![0, 0, 0, 229, 0], ![151, 55, 141, 141, 1]] where
  M :=![![![995137, 580968, 168552, -264487, -209202], ![5020848, 2935937, 854102, -1336512, -1057948], ![12695376, 7419677, 2156553, -3377690, -2673024], ![29565864, 17281938, 5024268, -7867287, -6226406], ![41195700, 24078376, 6999432, -10961267, -8674825]]]
  hmulB := by decide  
  f := ![![![541, 210, -232, -49, 68]], ![![-1632, -537, 790, 80, -196]], ![![2352, 737, -1009, 6, 160]], ![![-1104, 66, 656, -409, 110]], ![![739, 504, -183, -259, 163]]]
  g := ![![![142291, 52782, 129546, 127655, -209202], ![719524, 266913, 655130, 645564, -1057948], ![1818000, 674393, 1655253, 1631086, -2673024], ![4234730, 1570892, 3855666, 3799371, -6226406], ![5899975, 2188619, 5371833, 5293402, -8674825]]]
  hle1 := by decide   
  hle2 := by decide  


def P229P0 : CertificateIrreducibleZModOfList' 229 4 2 7 [191, 115, 110, 117, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [208, 90, 216, 160], [215, 205, 40, 38], [147, 162, 202, 31], [0, 1]]
 g := ![![[126, 164, 101, 61], [186, 27, 70], [69, 72, 23, 100], [201, 180, 215], [211, 73, 186], [219, 68, 112, 1], []], ![[209, 164, 168, 48, 188, 227], [109, 41, 83], [98, 78, 25, 220, 191, 199], [226, 212, 149], [136, 68, 94], [80, 67, 190, 164, 73, 160], [145, 33, 218, 156, 4, 106]], ![[209, 74, 100, 55, 43, 170], [150, 85, 33], [175, 107, 19, 106, 61, 155], [108, 206, 203], [178, 12, 53], [160, 0, 47, 174, 160, 115], [187, 187, 172, 152, 147, 141]], ![[88, 180, 17, 144, 117, 175], [202, 43, 16], [1, 183, 132, 182, 85, 137], [68, 30, 196], [168, 7, 129], [136, 204, 217, 22, 198, 109], [176, 61, 81, 20, 81, 21]]]
 h' := ![![[208, 90, 216, 160], [44, 34, 178, 176], [103, 59, 81, 38], [137, 218, 48, 10], [133, 192, 164, 131], [78, 70, 55, 84], [0, 0, 0, 1], [0, 1]], ![[215, 205, 40, 38], [146, 122, 6, 82], [144, 192, 160, 82], [214, 166, 222, 10], [127, 37, 195, 148], [40, 115, 186, 95], [142, 141, 106, 1], [208, 90, 216, 160]], ![[147, 162, 202, 31], [43, 11, 142, 128], [143, 210, 178, 105], [200, 4, 4, 131], [203, 123, 15, 165], [35, 147, 165, 125], [11, 114, 200, 189], [215, 205, 40, 38]], ![[0, 1], [145, 62, 132, 72], [207, 226, 39, 4], [76, 70, 184, 78], [34, 106, 84, 14], [156, 126, 52, 154], [111, 203, 152, 38], [147, 162, 202, 31]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [80, 162, 33], []]
 b := ![[], [], [159, 48, 210, 198], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI229N0 : CertifiedPrimeIdeal' SI229N0 229 where
  n := 4
  hpos := by decide
  P := [191, 115, 110, 117, 1]
  hirr := P229P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-546419425, -883244100, 157420970, 843411538, -527334418]
  a := ![0, -4, -2, -18, 10]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![345332217, 122795410, 325378052, 328373644, -527334418]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI229N0 : Ideal.IsPrime I229N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI229N0 B_one_repr
lemma NI229N0 : Nat.card (O ⧸ I229N0) = 2750058481 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI229N0

def I229N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![541, 210, -232, -49, 68]] i)))

def SI229N1: IdealEqSpanCertificate' Table ![![541, 210, -232, -49, 68]] 
 ![![229, 0, 0, 0, 0], ![123, 1, 0, 0, 0], ![107, 0, 1, 0, 0], ![228, 0, 0, 1, 0], ![80, 0, 0, 0, 1]] where
  M :=![![![541, 210, -232, -49, 68], ![-1632, -537, 790, 80, -196], ![2352, 737, -1009, 6, 160], ![-1104, 66, 656, -409, 110], ![1332, 18, -552, 511, -231]]]
  hmulB := by decide  
  f := ![![![995137, 580968, 168552, -264487, -209202]], ![![556431, 324869, 94262, -147897, -116986]], ![![520415, 303857, 88173, -138331, -109422]], ![![1119900, 653898, 189756, -297687, -235478]], ![![527540, 308104, 89448, -140263, -110965]]]
  g := ![![![23, 210, -232, -49, 68], ![-99, -537, 790, 80, -196], ![24, 737, -1009, 6, 160], ![22, 66, 656, -409, 110], ![-174, 18, -552, 511, -231]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI229N1 : Nat.card (O ⧸ I229N1) = 229 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI229N1)

lemma isPrimeI229N1 : Ideal.IsPrime I229N1 := prime_ideal_of_norm_prime hp229.out _ NI229N1
def MulI229N0 : IdealMulLeCertificate' Table 
  ![![995137, 580968, 168552, -264487, -209202]] ![![541, 210, -232, -49, 68]]
  ![![229, 0, 0, 0, 0]] where
 M := ![![![229, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC229 : ContainsPrimesAboveP 229 ![I229N0, I229N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI229N0
    exact isPrimeI229N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 229 (by decide) (𝕀 ⊙ MulI229N0)
instance hp233 : Fact (Nat.Prime 233) := {out := by norm_num}

def I233N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-685739, -29627, 173184, 19832, -47270]] i)))

def SI233N0: IdealEqSpanCertificate' Table ![![-685739, -29627, 173184, 19832, -47270]] 
 ![![233, 0, 0, 0, 0], ![0, 233, 0, 0, 0], ![0, 0, 233, 0, 0], ![212, 32, 138, 1, 0], ![51, 210, 163, 0, 1]] where
  M :=![![![-685739, -29627, 173184, 19832, -47270], ![1134480, 47079, -287998, -31792, 79328], ![-951936, -44855, 237527, 29314, -63584], ![195768, -1718, -57338, -913, 18964], ![-1156992, -63967, 281324, 39812, -72369]]]
  hmulB := by decide  
  f := ![![![27989, 14533, -12246, -7228, 6514]], ![![-156336, -70367, 69578, 27620, -28912]], ![![346944, 143257, -155811, -46070, 55240]], ![![206972, 87466, -92732, -29849, 34340]], ![![111015, 41121, -50369, -9174, 14413]]]
  g := ![![![-10641, 39753, 22066, 19832, -47270], ![16432, -66929, -37902, -31792, 79328], ![-16840, 53089, 28139, 29314, -63584], ![-2480, -16974, -12972, -913, 18964], ![-25349, 59483, 28255, 39812, -72369]]]
  hle1 := by decide   
  hle2 := by decide  


def P233P0 : CertificateIrreducibleZModOfList' 233 3 2 7 [161, 222, 50, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [221, 197, 192], [195, 35, 41], [0, 1]]
 g := ![![[194, 4, 104], [64, 175], [28, 205], [40, 21, 195], [161, 173], [170, 186, 170], [1]], ![[34, 34, 134, 90], [128, 178], [165, 2], [201, 165, 32, 153], [58, 62], [212, 155, 40, 176], [196, 100, 172, 47]], ![[184, 56, 58, 48], [109, 30], [24, 210], [126, 214, 99, 188], [104, 128], [62, 36, 111, 47], [134, 21, 144, 186]]]
 h' := ![![[221, 197, 192], [173, 58, 77], [218, 193, 117], [84, 193, 122], [173, 76, 121], [124, 175, 147], [72, 11, 183], [0, 1]], ![[195, 35, 41], [53, 87, 84], [33, 100, 143], [6, 214, 85], [33, 116, 187], [98, 34, 67], [35, 95, 129], [221, 197, 192]], ![[0, 1], [61, 88, 72], [169, 173, 206], [189, 59, 26], [173, 41, 158], [52, 24, 19], [211, 127, 154], [195, 35, 41]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [104, 26], []]
 b := ![[], [172, 228, 12], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI233N0 : CertifiedPrimeIdeal' SI233N0 233 where
  n := 3
  hpos := by decide
  P := [161, 222, 50, 1]
  hirr := P233P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![14013422, 8263456, 1738188, -3937066, -2379005]
  a := ![13, -7, 4, 2, -15]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![4163093, 2720346, 4003567, -3937066, -2379005]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI233N0 : Ideal.IsPrime I233N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI233N0 B_one_repr
lemma NI233N0 : Nat.card (O ⧸ I233N0) = 12649337 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI233N0

def I233N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![433, 165, 12, -31, -12]] i)))

def SI233N1: IdealEqSpanCertificate' Table ![![433, 165, 12, -31, -12]] 
 ![![233, 0, 0, 0, 0], ![15, 1, 0, 0, 0], ![4, 0, 1, 0, 0], ![79, 0, 0, 1, 0], ![106, 0, 0, 0, 1]] where
  M :=![![![433, 165, 12, -31, -12], ![288, 515, 344, -72, -124], ![1488, 926, 339, -152, -144], ![1584, 1296, 618, -201, -242], ![2052, 1321, 504, -215, -211]]]
  hmulB := by decide  
  f := ![![![-1903, -621, 850, 55, -170]], ![![-105, -36, 46, 5, -10]], ![![-44, -10, 19, -4, 0]], ![![-689, -237, 304, 34, -68]], ![![-818, -255, 362, 9, -61]]]
  g := ![![![7, 165, 12, -31, -12], ![43, 515, 344, -72, -124], ![58, 926, 339, -152, -144], ![91, 1296, 618, -201, -242], ![84, 1321, 504, -215, -211]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI233N1 : Nat.card (O ⧸ I233N1) = 233 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI233N1)

lemma isPrimeI233N1 : Ideal.IsPrime I233N1 := prime_ideal_of_norm_prime hp233.out _ NI233N1

def I233N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1727, -807, 760, 337, -336]] i)))

def SI233N2: IdealEqSpanCertificate' Table ![![-1727, -807, 760, 337, -336]] 
 ![![233, 0, 0, 0, 0], ![175, 1, 0, 0, 0], ![182, 0, 1, 0, 0], ![181, 0, 0, 1, 0], ![65, 0, 0, 0, 1]] where
  M :=![![![-1727, -807, 760, 337, -336], ![8064, 3403, -3632, -1168, 1348], ![-16176, -6366, 7267, 1760, -2336], ![24000, 8452, -10982, -1493, 2846], ![-29196, -10203, 13268, 1665, -3335]]]
  hmulB := by decide  
  f := ![![![-245407, -46881, 33662, 22983, 1810]], ![![-184505, -36008, 24714, 17613, 1754]], ![![-196426, -38816, 25935, 18962, 2116]], ![![-198971, -41419, 24632, 20128, 3228]], ![![-81667, -20114, 7680, 9626, 2933]]]
  g := ![![![-163, -807, 760, 337, -336], ![847, 3403, -3632, -1168, 1348], ![-1680, -6366, 7267, 1760, -2336], ![2699, 8452, -10982, -1493, 2846], ![-3189, -10203, 13268, 1665, -3335]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI233N2 : Nat.card (O ⧸ I233N2) = 233 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI233N2)

lemma isPrimeI233N2 : Ideal.IsPrime I233N2 := prime_ideal_of_norm_prime hp233.out _ NI233N2
def MulI233N0 : IdealMulLeCertificate' Table 
  ![![-685739, -29627, 173184, 19832, -47270]] ![![433, 165, 12, -31, -12]]
  ![![-113343923, -4777854, 28720916, 3243903, -7861254]] where
 M := ![![![-113343923, -4777854, 28720916, 3243903, -7861254]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI233N1 : IdealMulLeCertificate' Table 
  ![![-113343923, -4777854, 28720916, 3243903, -7861254]] ![![-1727, -807, 760, 337, -336]]
  ![![233, 0, 0, 0, 0]] where
 M := ![![![-2353067, -1999839, -979998, 308492, 381188]]]
 hmul := by decide  
 g := ![![![![-10099, -8583, -4206, 1324, 1636]]]]
 hle2 := by decide  


def PBC233 : ContainsPrimesAboveP 233 ![I233N0, I233N1, I233N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI233N0
    exact isPrimeI233N1
    exact isPrimeI233N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 233 (by decide) (𝕀 ⊙ MulI233N0 ⊙ MulI233N1)
instance hp239 : Fact (Nat.Prime 239) := {out := by norm_num}

def I239N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-72557, -2868, 18532, 1978, -5142]] i)))

def SI239N0: IdealEqSpanCertificate' Table ![![-72557, -2868, 18532, 1978, -5142]] 
 ![![239, 0, 0, 0, 0], ![0, 239, 0, 0, 0], ![0, 0, 239, 0, 0], ![186, 186, 130, 1, 0], ![99, 59, 127, 0, 1]] where
  M :=![![![-72557, -2868, 18532, 1978, -5142], ![123408, 6493, -30260, -4072, 7912], ![-94944, -1014, 26389, 1388, -8144], ![36024, 8656, -3560, -4151, -1180], ![-102096, 5532, 33548, -1410, -12179]]]
  hmulB := by decide  
  f := ![![![1541, 1188, 500, -198, -194]], ![![4656, 3779, 1996, -552, -792]], ![![9504, 7130, 2747, -1172, -1104]], ![![10038, 7782, 3458, -1227, -1376]], ![![6897, 5257, 2175, -848, -869]]]
  g := ![![![287, -282, 1734, 1978, -5142], ![408, 1243, -2116, -4072, 7912], ![1896, 926, 3683, 1388, -8144], ![3870, 3558, 2870, -4151, -1180], ![5715, 4127, 7379, -1410, -12179]]]
  hle1 := by decide   
  hle2 := by decide  


def P239P0 : CertificateIrreducibleZModOfList' 239 3 2 7 [199, 200, 33, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [73, 165, 45], [133, 73, 194], [0, 1]]
 g := ![![[199, 180, 36], [52, 234, 62], [156, 34, 6], [119, 178, 31], [30, 88], [105, 207, 133], [1]], ![[215, 48, 73, 34], [10, 70, 190, 196], [72, 80, 96, 220], [174, 60, 68, 170], [142, 125], [26, 79, 184, 72], [1, 224, 221, 66]], ![[234, 192, 215, 158], [148, 11, 168, 39], [142, 54, 111, 77], [113, 31, 165, 105], [150, 18], [217, 52, 108, 130], [181, 23, 157, 173]]]
 h' := ![![[73, 165, 45], [168, 114, 6], [26, 196, 118], [219, 27, 22], [132, 41, 105], [137, 113, 142], [40, 39, 206], [0, 1]], ![[133, 73, 194], [200, 69, 71], [35, 40, 226], [75, 29, 192], [16, 133, 189], [123, 50, 155], [204, 168, 63], [73, 165, 45]], ![[0, 1], [30, 56, 162], [44, 3, 134], [51, 183, 25], [18, 65, 184], [94, 76, 181], [230, 32, 209], [133, 73, 194]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [139, 148], []]
 b := ![[], [86, 44, 87], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI239N0 : CertifiedPrimeIdeal' SI239N0 239 where
  n := 3
  hpos := by decide
  P := [199, 200, 33, 1]
  hirr := P239P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![691555, 221263, -344810, -21770, 90460]
  a := ![-1, -1, -1, -4, 5]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-17635, -4463, -37670, -21770, 90460]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI239N0 : Ideal.IsPrime I239N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI239N0 B_one_repr
lemma NI239N0 : Nat.card (O ⧸ I239N0) = 13651919 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI239N0

def I239N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1541, -1188, -500, 198, 194]] i)))

def SI239N1: IdealEqSpanCertificate' Table ![![-1541, -1188, -500, 198, 194]] 
 ![![239, 0, 0, 0, 0], ![0, 239, 0, 0, 0], ![193, 109, 1, 0, 0], ![234, 166, 0, 1, 0], ![210, 29, 0, 0, 1]] where
  M :=![![![-1541, -1188, -500, 198, 194], ![-4656, -3779, -1996, 552, 792], ![-9504, -7130, -2747, 1172, 1104], ![-10920, -9136, -5096, 1393, 1948], ![-14112, -10340, -3692, 1658, 1549]]]
  hmulB := by decide  
  f := ![![![72557, 2868, -18532, -1978, 5142]], ![![-123408, -6493, 30260, 4072, -7912]], ![![2707, -641, -1275, 254, 578]], ![![-14826, -1738, 2888, 909, -456]], ![![49206, 1709, -12752, -1238, 3609]]]
  g := ![![![33, 62, -500, 198, 194], ![356, 415, -1996, 552, 792], ![61, 275, -2747, 1172, 1104], ![994, 1082, -5096, 1393, 1948], ![-62, 301, -3692, 1658, 1549]]]
  hle1 := by decide   
  hle2 := by decide  


def P239P1 : CertificateIrreducibleZModOfList' 239 2 2 7 [138, 73, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [166, 238], [0, 1]]
 g := ![![[75, 87], [3, 109], [97, 196], [88, 6], [31], [167, 187], [166, 1]], ![[177, 152], [172, 130], [129, 43], [128, 233], [31], [139, 52], [93, 238]]]
 h' := ![![[166, 238], [64, 39], [237, 161], [45, 14], [151, 217], [137, 105], [36, 172], [0, 1]], ![[0, 1], [85, 200], [195, 78], [218, 225], [84, 22], [120, 134], [147, 67], [166, 238]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [81]]
 b := ![[], [104, 160]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI239N1 : CertifiedPrimeIdeal' SI239N1 239 where
  n := 2
  hpos := by decide
  P := [138, 73, 1]
  hirr := P239P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![114, -775, -3506, 967, 2844]
  a := ![3, 3, 0, -1, 7]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-614, 579, -3506, 967, 2844]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI239N1 : Ideal.IsPrime I239N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI239N1 B_one_repr
lemma NI239N1 : Nat.card (O ⧸ I239N1) = 57121 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI239N1
def MulI239N0 : IdealMulLeCertificate' Table 
  ![![-72557, -2868, 18532, 1978, -5142]] ![![-1541, -1188, -500, 198, 194]]
  ![![239, 0, 0, 0, 0]] where
 M := ![![![-239, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC239 : ContainsPrimesAboveP 239 ![I239N0, I239N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI239N0
    exact isPrimeI239N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 239 (by decide) (𝕀 ⊙ MulI239N0)
instance hp241 : Fact (Nat.Prime 241) := {out := by norm_num}

def I241N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-523, -193, 242, 44, -70]] i)))

def SI241N0: IdealEqSpanCertificate' Table ![![-523, -193, 242, 44, -70]] 
 ![![241, 0, 0, 0, 0], ![0, 241, 0, 0, 0], ![3, 64, 1, 0, 0], ![49, 3, 0, 1, 0], ![238, 9, 0, 0, 1]] where
  M :=![![![-523, -193, 242, 44, -70], ![1680, 577, -754, -76, 176], ![-2112, -581, 1005, -50, -152], ![984, -56, -458, 435, -188], ![-768, 287, 446, -592, 271]]]
  hmulB := by decide  
  f := ![![![9245, 5287, 1480, -2408, -1886]], ![![45264, 26655, 7846, -12128, -9632]], ![![12615, 7424, 2183, -3378, -2682]], ![![3557, 2058, 588, -937, -738]], ![![12374, 7124, 2018, -3244, -2549]]]
  g := ![![![55, -63, 242, 44, -70], ![-142, 197, -754, -76, 176], ![139, -263, 1005, -50, -152], ![107, 123, -458, 435, -188], ![-156, -120, 446, -592, 271]]]
  hle1 := by decide   
  hle2 := by decide  


def P241P0 : CertificateIrreducibleZModOfList' 241 2 2 7 [102, 16, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [225, 240], [0, 1]]
 g := ![![[175, 45], [59], [61], [82], [184, 162], [49, 98], [225, 1]], ![[178, 196], [59], [61], [82], [2, 79], [168, 143], [209, 240]]]
 h' := ![![[225, 240], [221, 68], [93, 78], [7, 213], [30, 166], [63, 198], [186, 154], [0, 1]], ![[0, 1], [97, 173], [50, 163], [214, 28], [25, 75], [28, 43], [132, 87], [225, 240]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [222]]
 b := ![[], [165, 111]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI241N0 : CertifiedPrimeIdeal' SI241N0 241 where
  n := 2
  hpos := by decide
  P := [102, 16, 1]
  hirr := P241P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![467, -1824, -7587, 2070, 4779]
  a := ![1, 5, -3, -2, 11]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-5044, 1803, -7587, 2070, 4779]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI241N0 : Ideal.IsPrime I241N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI241N0 B_one_repr
lemma NI241N0 : Nat.card (O ⧸ I241N0) = 58081 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI241N0

def I241N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-173, -70, -8, 13, 6]] i)))

def SI241N1: IdealEqSpanCertificate' Table ![![-173, -70, -8, 13, 6]] 
 ![![241, 0, 0, 0, 0], ![0, 241, 0, 0, 0], ![18, 69, 1, 0, 0], ![204, 189, 0, 1, 0], ![236, 193, 0, 0, 1]] where
  M :=![![![-173, -70, -8, 13, 6], ![-144, -221, -142, 32, 52], ![-624, -397, -149, 66, 64], ![-696, -562, -264, 91, 106], ![-876, -574, -224, 97, 97]]]
  hmulB := by decide  
  f := ![![![-221, -88, 96, 27, -32]], ![![768, 281, -358, -64, 108]], ![![198, 72, -93, -16, 28]], ![![420, 147, -202, -27, 58]], ![![392, 137, -190, -25, 55]]]
  g := ![![![-17, -13, -8, 13, 6], ![-68, -27, -142, 32, 52], ![-110, -62, -149, 66, 64], ![-164, -83, -264, 91, 106], ![-164, -92, -224, 97, 97]]]
  hle1 := by decide   
  hle2 := by decide  


def P241P1 : CertificateIrreducibleZModOfList' 241 2 2 7 [75, 239, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [2, 240], [0, 1]]
 g := ![![[151, 45], [164], [97], [58], [162, 16], [52, 221], [2, 1]], ![[0, 196], [164], [97], [58], [194, 225], [12, 20], [4, 240]]]
 h' := ![![[2, 240], [136, 173], [77, 204], [107, 196], [141, 96], [197, 4], [91, 170], [0, 1]], ![[0, 1], [0, 68], [3, 37], [17, 45], [92, 145], [205, 237], [190, 71], [2, 240]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [114]]
 b := ![[], [184, 57]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI241N1 : CertifiedPrimeIdeal' SI241N1 241 where
  n := 2
  hpos := by decide
  P := [75, 239, 1]
  hirr := P241P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![1371, 134, -152, 201, -188]
  a := ![4, 0, 0, 1, -1]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![31, 37, -152, 201, -188]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI241N1 : Ideal.IsPrime I241N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI241N1 B_one_repr
lemma NI241N1 : Nat.card (O ⧸ I241N1) = 58081 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI241N1

def I241N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![1757, -272, -732, -5, 222]] i)))

def SI241N2: IdealEqSpanCertificate' Table ![![1757, -272, -732, -5, 222]] 
 ![![241, 0, 0, 0, 0], ![216, 1, 0, 0, 0], ![49, 0, 1, 0, 0], ![143, 0, 0, 1, 0], ![27, 0, 0, 0, 1]] where
  M :=![![![1757, -272, -732, -5, 222], ![-5328, -1427, 354, 312, -20], ![240, -2065, -1779, 274, 624], ![-4824, -3214, -1268, 561, 558], ![-564, -3096, -2396, 463, 883]]]
  hmulB := by decide  
  f := ![![![-93331, -27638, 43100, -467, -7324]], ![![-82920, -24649, 38282, -304, -6572]], ![![-18883, -5271, 8755, -473, -1260]], ![![-58493, -18056, 26932, 574, -5098]], ![![-6261, -928, 2992, -1124, 149]]]
  g := ![![![378, -272, -732, -5, 222], ![1002, -1427, 354, 312, -20], ![1981, -2065, -1779, 274, 624], ![2723, -3214, -1268, 561, 558], ![2886, -3096, -2396, 463, 883]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI241N2 : Nat.card (O ⧸ I241N2) = 241 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI241N2)

lemma isPrimeI241N2 : Ideal.IsPrime I241N2 := prime_ideal_of_norm_prime hp241.out _ NI241N2
def MulI241N0 : IdealMulLeCertificate' Table 
  ![![-523, -193, 242, 44, -70]] ![![-173, -70, -8, 13, 6]]
  ![![-2041, -1359, -404, 211, 188]] where
 M := ![![![-2041, -1359, -404, 211, 188]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI241N1 : IdealMulLeCertificate' Table 
  ![![-2041, -1359, -404, 211, 188]] ![![1757, -272, -732, -5, 222]]
  ![![241, 0, 0, 0, 0]] where
 M := ![![![2433859, 2068503, 1013646, -319084, -394276]]]
 hmul := by decide  
 g := ![![![![10099, 8583, 4206, -1324, -1636]]]]
 hle2 := by decide  


def PBC241 : ContainsPrimesAboveP 241 ![I241N0, I241N1, I241N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI241N0
    exact isPrimeI241N1
    exact isPrimeI241N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 241 (by decide) (𝕀 ⊙ MulI241N0 ⊙ MulI241N1)
instance hp251 : Fact (Nat.Prime 251) := {out := by norm_num}

def I251N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![251, 0, 0, 0, 0]] i)))

def SI251N0: IdealEqSpanCertificate' Table ![![251, 0, 0, 0, 0]] 
 ![![251, 0, 0, 0, 0], ![0, 251, 0, 0, 0], ![0, 0, 251, 0, 0], ![0, 0, 0, 251, 0], ![0, 0, 0, 0, 251]] where
  M :=![![![251, 0, 0, 0, 0], ![0, 251, 0, 0, 0], ![0, 0, 251, 0, 0], ![0, 0, 0, 251, 0], ![0, 0, 0, 0, 251]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P251P0 : CertificateIrreducibleZModOfList' 251 5 2 7 [37, 186, 165, 232, 188, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 1, 1, 1, 1]
 hbits := by decide
 h := ![[0, 1], [129, 247, 109, 122, 80], [130, 97, 242, 118, 248], [121, 163, 215, 169, 30], [185, 245, 187, 93, 144], [0, 1]]
 g := ![![[44, 196, 37, 235, 227], [210, 218, 232, 241, 232], [205, 111, 207, 121], [4, 27, 197, 231, 27], [62, 109, 121, 36, 190], [223, 63, 1], []], ![[41, 155, 30, 226, 157, 40, 76, 219], [51, 70, 152, 11, 74, 150, 70, 3], [210, 122, 188, 237], [245, 123, 106, 187, 109, 243, 30, 108], [169, 203, 48, 161, 191, 100, 28, 51], [131, 195, 31, 79, 55, 177, 204, 227], [112, 93, 112, 95, 94, 23, 58, 211]], ![[67, 36, 135, 202, 60, 56, 169, 235], [53, 111, 43, 191, 140, 19, 60, 129], [140, 173, 97, 110], [70, 36, 10, 48, 86, 151, 202, 248], [169, 28, 205, 210, 233, 238, 9, 104], [76, 27, 50, 89, 76, 248, 185, 206], [75, 8, 193, 146, 15, 113, 230, 224]], ![[28, 113, 147, 114, 210, 135, 112, 26], [38, 107, 119, 76, 69, 200, 142, 128], [92, 203, 172, 13], [24, 111, 51, 16, 178, 229, 155, 213], [31, 178, 99, 231, 141, 187, 107, 130], [41, 229, 41, 140, 9, 128, 163, 187], [188, 215, 92, 101, 146, 69, 206, 143]], ![[147, 169, 131, 49, 85, 17, 188, 233], [33, 154, 187, 192, 121, 64, 46, 91], [174, 179, 159, 198], [129, 114, 205, 89, 40, 139, 174, 100], [152, 139, 39, 150, 140, 197, 52, 114], [33, 244, 236, 42, 84, 219, 2, 93], [9, 243, 89, 231, 196, 152, 67, 88]]]
 h' := ![![[129, 247, 109, 122, 80], [11, 206, 114, 37, 27], [12, 149, 79, 182, 146], [103, 235, 146, 223, 240], [216, 17, 53, 99, 23], [32, 116, 144, 182, 21], [0, 0, 0, 1], [0, 1]], ![[130, 97, 242, 118, 248], [83, 68, 127, 42, 10], [5, 106, 55, 24, 140], [112, 195, 1, 27, 57], [83, 166, 67, 85, 164], [80, 142, 80, 180, 25], [9, 178, 82, 244, 129], [129, 247, 109, 122, 80]], ![[121, 163, 215, 169, 30], [32, 67, 116, 47, 66], [179, 116, 69, 131, 220], [29, 55, 198, 160, 232], [64, 100, 149, 80, 1], [120, 115, 199, 156, 7], [234, 118, 239, 44, 39], [130, 97, 242, 118, 248]], ![[185, 245, 187, 93, 144], [30, 186, 204, 52, 108], [54, 63, 235, 190, 180], [137, 233, 250, 147, 55], [62, 131, 80, 198, 22], [153, 206, 17, 200, 222], [75, 174, 77, 170, 93], [121, 163, 215, 169, 30]], ![[0, 1], [96, 226, 192, 73, 40], [26, 68, 64, 226, 67], [38, 35, 158, 196, 169], [48, 88, 153, 40, 41], [66, 174, 62, 35, 227], [68, 32, 104, 43, 241], [185, 245, 187, 93, 144]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [23, 151, 97, 179], [], [], []]
 b := ![[], [44, 77, 8, 75, 26], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI251N0 : CertifiedPrimeIdeal' SI251N0 251 where
  n := 5
  hpos := by decide
  P := [37, 186, 165, 232, 188, 1]
  hirr := P251P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![1081677081492443, 631726544306940, 183299605520330, -288207383265716, -227973368828580]
  a := ![7, -21, -1, -23, -21]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![4309470444193, 2516838821940, 730277312830, -1148236586716, -908260433580]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI251N0 : Ideal.IsPrime I251N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI251N0 B_one_repr
lemma NI251N0 : Nat.card (O ⧸ I251N0) = 996250626251 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI251N0

def PBC251 : ContainsPrimesAboveP 251 ![I251N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI251N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![251, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 251 (by decide) 𝕀



lemma PB934I5_primes (p : ℕ) :
  p ∈ Set.range ![199, 211, 223, 227, 229, 233, 239, 241, 251] ↔ Nat.Prime p ∧ 197 < p ∧ p ≤ 251 := by
  rw [← List.mem_ofFn']
  convert primes_range 197 251 (by omega)

def PB934I5 : PrimesBelowBoundCertificateInterval O 197 251 934 where
  m := 9
  g := ![2, 1, 2, 3, 2, 3, 2, 3, 1]
  P := ![199, 211, 223, 227, 229, 233, 239, 241, 251]
  hP := PB934I5_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I199N0, I199N1]
    · exact ![I211N0]
    · exact ![I223N0, I223N1]
    · exact ![I227N0, I227N1, I227N2]
    · exact ![I229N0, I229N1]
    · exact ![I233N0, I233N1, I233N2]
    · exact ![I239N0, I239N1]
    · exact ![I241N0, I241N1, I241N2]
    · exact ![I251N0]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC199
    · exact PBC211
    · exact PBC223
    · exact PBC227
    · exact PBC229
    · exact PBC233
    · exact PBC239
    · exact PBC241
    · exact PBC251
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![7880599, 39601]
    · exact ![418227202051]
    · exact ![2472973441, 223]
    · exact ![11697083, 227, 227]
    · exact ![2750058481, 229]
    · exact ![12649337, 233, 233]
    · exact ![13651919, 57121]
    · exact ![58081, 58081, 241]
    · exact ![996250626251]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI199N0
      exact NI199N1
    · dsimp ; intro j
      fin_cases j
      exact NI211N0
    · dsimp ; intro j
      fin_cases j
      exact NI223N0
      exact NI223N1
    · dsimp ; intro j
      fin_cases j
      exact NI227N0
      exact NI227N1
      exact NI227N2
    · dsimp ; intro j
      fin_cases j
      exact NI229N0
      exact NI229N1
    · dsimp ; intro j
      fin_cases j
      exact NI233N0
      exact NI233N1
      exact NI233N2
    · dsimp ; intro j
      fin_cases j
      exact NI239N0
      exact NI239N1
    · dsimp ; intro j
      fin_cases j
      exact NI241N0
      exact NI241N1
      exact NI241N2
    · dsimp ; intro j
      fin_cases j
      exact NI251N0
  β := ![I223N1, I227N1, I227N2, I229N1, I233N1, I233N2, I241N2]
  Il := ![[], [], [I223N1], [I227N1, I227N2], [I229N1], [I233N1, I233N2], [], [I241N2], []]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
