
import IdealArithmetic.Examples.NF5_3_202500000_1.RI5_3_202500000_1
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp367 : Fact (Nat.Prime 367) := {out := by norm_num}

def I367N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![367, 0, 0, 0, 0]] i)))

def SI367N0: IdealEqSpanCertificate' Table ![![367, 0, 0, 0, 0]] 
 ![![367, 0, 0, 0, 0], ![0, 367, 0, 0, 0], ![0, 0, 367, 0, 0], ![0, 0, 0, 367, 0], ![0, 0, 0, 0, 367]] where
  M :=![![![367, 0, 0, 0, 0], ![0, 367, 0, 0, 0], ![0, 0, 367, 0, 0], ![0, 0, 0, 367, 0], ![0, 0, 0, 0, 367]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P367P0 : CertificateIrreducibleZModOfList' 367 5 2 8 [233, 331, 242, 200, 202, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [133, 26, 32, 127, 343], [198, 93, 194, 188, 98], [269, 66, 285, 180, 171], [299, 181, 223, 239, 122], [0, 1]]
 g := ![![[305, 270, 40, 34, 166], [44, 309, 74, 332, 270], [17, 88, 110, 125, 231], [269, 23, 290, 366, 2], [0, 364, 193, 134], [154, 245, 31, 105, 67], [1], []], ![[277, 170, 154, 282, 92, 245, 346, 37], [243, 252, 24, 267, 59, 155, 80, 121], [115, 74, 166, 230, 7, 245, 130, 31], [118, 71, 136, 252, 155, 163, 199, 281], [110, 200, 64, 52], [17, 18, 23, 250, 105, 130, 7, 328], [65, 1, 204, 188, 213, 182, 92, 145], [290, 115, 130, 209]], ![[189, 276, 61, 85, 358, 120, 76, 258], [205, 23, 239, 85, 20, 61, 107, 114], [3, 81, 30, 108, 220, 239, 195, 268], [283, 5, 151, 102, 254, 131, 253, 348], [182, 33, 211, 244], [122, 112, 97, 33, 27, 150, 40, 94], [132, 297, 56, 54, 38, 171, 30, 105], [95, 361, 102, 62]], ![[98, 11, 250, 25, 363, 4, 194, 337], [298, 82, 117, 3, 154, 366, 238, 171], [217, 330, 65, 180, 263, 97, 124, 140], [159, 8, 154, 55, 59, 57, 66, 262], [243, 26, 258, 182], [326, 337, 239, 303, 22, 363, 226, 153], [365, 221, 75, 334, 243, 304, 94, 310], [257, 306, 87, 248]], ![[111, 266, 321, 30, 153, 48, 226, 36], [351, 74, 266, 341, 62, 180, 300, 199], [23, 234, 283, 41, 224, 170, 178, 8], [243, 282, 215, 349, 279, 262, 111, 120], [357, 82, 260, 324], [135, 20, 131, 126, 327, 48, 243, 74], [23, 111, 278, 73, 306, 309, 57, 113], [112, 125, 226, 204]]]
 h' := ![![[133, 26, 32, 127, 343], [24, 322, 128, 327, 30], [76, 87, 192, 177, 296], [80, 204, 360, 151, 161], [83, 310, 16, 344, 79], [84, 179, 34, 262, 190], [134, 36, 125, 167, 165], [0, 0, 1], [0, 1]], ![[198, 93, 194, 188, 98], [345, 105, 54, 303, 17], [134, 272, 76, 135, 319], [298, 78, 295, 174, 324], [68, 329, 156, 311, 233], [209, 346, 279, 60, 137], [366, 35, 79, 203, 206], [31, 103, 204, 285, 323], [133, 26, 32, 127, 343]], ![[269, 66, 285, 180, 171], [166, 222, 294, 44, 10], [46, 318, 244, 207, 11], [319, 247, 346, 219, 235], [366, 116, 31, 77, 271], [56, 80, 247, 35, 251], [112, 236, 5, 328, 74], [187, 175, 333, 2, 139], [198, 93, 194, 188, 98]], ![[299, 181, 223, 239, 122], [207, 247, 74, 78, 42], [22, 309, 93, 283, 366], [350, 191, 91, 14, 343], [182, 90, 349, 348, 198], [284, 166, 238, 41, 174], [74, 360, 259, 44, 85], [2, 253, 359, 231, 178], [269, 66, 285, 180, 171]], ![[0, 1], [357, 205, 184, 349, 268], [366, 115, 129, 299, 109], [63, 14, 9, 176, 38], [38, 256, 182, 21, 320], [160, 330, 303, 336, 349], [88, 67, 266, 359, 204], [181, 203, 204, 216, 94], [299, 181, 223, 239, 122]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [306, 250, 267, 216], [], [], []]
 b := ![[], [71, 142, 288, 317, 9], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI367N0 : CertifiedPrimeIdeal' SI367N0 367 where
  n := 5
  hpos := by decide
  P := [233, 331, 242, 200, 202, 1]
  hirr := P367P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-126908459855545, -44370660882477, -32702865982018, -45151557925363, -60233733297630]
  a := ![-17, -10, -24, -5, -51]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-345799618135, -120900983331, -89108626654, -123028768189, -164124613890]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI367N0 : Ideal.IsPrime I367N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI367N0 B_one_repr
lemma NI367N0 : Nat.card (O ⧸ I367N0) = 6657793506607 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI367N0

def PBC367 : ContainsPrimesAboveP 367 ![I367N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI367N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![367, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 367 (by decide) 𝕀

instance hp373 : Fact (Nat.Prime 373) := {out := by norm_num}

def I373N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![2167, -748, -92, 296, -728]] i)))

def SI373N0: IdealEqSpanCertificate' Table ![![2167, -748, -92, 296, -728]] 
 ![![373, 0, 0, 0, 0], ![0, 373, 0, 0, 0], ![48, 4, 1, 0, 0], ![325, 136, 0, 1, 0], ![264, 312, 0, 0, 1]] where
  M :=![![![2167, -748, -92, 296, -728], ![-5232, 1827, 232, -708, 1776], ![12792, -4396, -529, 1764, -4248], ![-7632, 2756, 376, -1005, 2704], ![-1704, 632, 88, -224, 615]]]
  hmulB := by decide  
  f := ![![![9619, -2948, -1972, 2456, -4520]], ![![-31248, 9527, 6392, -7980, 14736]], ![![1176, -360, -241, 300, -552]], ![![-3245, 976, 660, -829, 1544]], ![![-19296, 5872, 3944, -4928, 9111]]]
  g := ![![![275, 500, -92, 296, -728], ![-684, -1225, 232, -708, 1776], ![1572, 2904, -529, 1764, -4248], ![-1107, -1892, 376, -1005, 2704], ![-256, -432, 88, -224, 615]]]
  hle1 := by decide   
  hle2 := by decide  


def P373P0 : CertificateIrreducibleZModOfList' 373 2 2 8 [167, 89, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [284, 372], [0, 1]]
 g := ![![[5, 324], [91], [49, 16], [364], [362, 152], [50, 83], [260, 88], [1]], ![[263, 49], [91], [117, 357], [364], [262, 221], [123, 290], [261, 285], [1]]]
 h' := ![![[284, 372], [252, 18], [23, 217], [49, 369], [345, 61], [229, 317], [221, 124], [206, 284], [0, 1]], ![[0, 1], [142, 355], [106, 156], [32, 4], [138, 312], [364, 56], [2, 249], [294, 89], [284, 372]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [355]]
 b := ![[], [159, 364]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI373N0 : CertifiedPrimeIdeal' SI373N0 373 where
  n := 2
  hpos := by decide
  P := [167, 89, 1]
  hirr := P373P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![5067399, 4910374, 3834483, 2243677, 7341018]
  a := ![-240, -181, -361, -1, -723]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-7630594, -6986502, 3834483, 2243677, 7341018]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI373N0 : Ideal.IsPrime I373N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI373N0 B_one_repr
lemma NI373N0 : Nat.card (O ⧸ I373N0) = 139129 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI373N0

def I373N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![137, 50, 37, 49, 70]] i)))

def SI373N1: IdealEqSpanCertificate' Table ![![137, 50, 37, 49, 70]] 
 ![![373, 0, 0, 0, 0], ![0, 373, 0, 0, 0], ![71, 306, 1, 0, 0], ![366, 121, 0, 1, 0], ![337, 58, 0, 0, 1]] where
  M :=![![![137, 50, 37, 49, 70], ![658, 219, 160, 230, 294], ![2812, 1022, 749, 1004, 1380], ![5506, 1896, 1398, 1955, 2566], ![1594, 558, 414, 570, 765]]]
  hmulB := by decide  
  f := ![![![-2733, 984, 123, -381, 928]], ![![6662, -2309, -282, 916, -2286]], ![![4901, -1692, -206, 673, -1684]], ![![-494, 207, 28, -73, 160]], ![![-1427, 528, 67, -201, 481]]]
  g := ![![![-118, -57, 37, 49, 70], ![-520, -251, 160, 230, 294], ![-2367, -1152, 749, 1004, 1380], ![-4488, -2175, 1398, 1955, 2566], ![-1325, -642, 414, 570, 765]]]
  hle1 := by decide   
  hle2 := by decide  


def P373P1 : CertificateIrreducibleZModOfList' 373 2 2 8 [297, 305, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [68, 372], [0, 1]]
 g := ![![[315, 286], [256], [215, 284], [81], [221, 203], [221, 94], [258, 148], [1]], ![[367, 87], [256], [131, 89], [81], [224, 170], [272, 279], [251, 225], [1]]]
 h' := ![![[68, 372], [22, 184], [301, 16], [309, 88], [11, 364], [11, 349], [212, 252], [76, 68], [0, 1]], ![[0, 1], [225, 189], [270, 357], [325, 285], [145, 9], [244, 24], [190, 121], [224, 305], [68, 372]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [33]]
 b := ![[], [185, 203]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI373N1 : CertifiedPrimeIdeal' SI373N1 373 where
  n := 2
  hpos := by decide
  P := [297, 305, 1]
  hirr := P373P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![27127, 18232, 9765, 11901, 17134]
  a := ![-15, -10, -22, -3, -46]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-28944, -14487, 9765, 11901, 17134]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI373N1 : Ideal.IsPrime I373N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI373N1 B_one_repr
lemma NI373N1 : Nat.card (O ⧸ I373N1) = 139129 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI373N1

def I373N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-621, 188, 127, -157, 288]] i)))

def SI373N2: IdealEqSpanCertificate' Table ![![-621, 188, 127, -157, 288]] 
 ![![373, 0, 0, 0, 0], ![63, 1, 0, 0, 0], ![134, 0, 1, 0, 0], ![360, 0, 0, 1, 0], ![248, 0, 0, 0, 1]] where
  M :=![![![-621, 188, 127, -157, 288], ![1990, -617, -410, 512, -942], ![-6512, 1970, 1329, -1660, 3072], ![5578, -1692, -1140, 1417, -2610], ![-806, 258, 168, -208, 377]]]
  hmulB := by decide  
  f := ![![![-15335, -5506, -4007, -5495, -7434]], ![![-2779, -995, -725, -995, -1344]], ![![-6350, -2274, -1657, -2274, -3072]], ![![-16414, -5876, -4282, -5877, -7938]], ![![-10670, -3826, -2786, -3822, -5167]]]
  g := ![![![-119, 188, 127, -157, 288], ![389, -617, -410, 512, -942], ![-1268, 1970, 1329, -1660, 3072], ![1078, -1692, -1140, 1417, -2610], ![-156, 258, 168, -208, 377]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI373N2 : Nat.card (O ⧸ I373N2) = 373 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI373N2)

lemma isPrimeI373N2 : Ideal.IsPrime I373N2 := prime_ideal_of_norm_prime hp373.out _ NI373N2
def MulI373N0 : IdealMulLeCertificate' Table 
  ![![2167, -748, -92, 296, -728]] ![![137, 50, 37, 49, 70]]
  ![![15335, 5506, 4007, 5495, 7434]] where
 M := ![![![15335, 5506, 4007, 5495, 7434]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI373N1 : IdealMulLeCertificate' Table 
  ![![15335, 5506, 4007, 5495, 7434]] ![![-621, 188, 127, -157, 288]]
  ![![373, 0, 0, 0, 0]] where
 M := ![![![-373, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC373 : ContainsPrimesAboveP 373 ![I373N0, I373N1, I373N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI373N0
    exact isPrimeI373N1
    exact isPrimeI373N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 373 (by decide) (𝕀 ⊙ MulI373N0 ⊙ MulI373N1)
instance hp379 : Fact (Nat.Prime 379) := {out := by norm_num}

def I379N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-37, -16, 0, -6, 30]] i)))

def SI379N0: IdealEqSpanCertificate' Table ![![-37, -16, 0, -6, 30]] 
 ![![379, 0, 0, 0, 0], ![0, 379, 0, 0, 0], ![62, 228, 1, 0, 0], ![362, 76, 0, 1, 0], ![8, 141, 0, 0, 1]] where
  M :=![![![-37, -16, 0, -6, 30], ![228, -13, -34, 24, -36], ![-240, 250, 93, -114, 144], ![304, -22, -42, 73, -192], ![-188, -76, 6, 2, 29]]]
  hmulB := by decide  
  f := ![![![-391, 60, -16, -78, 42]], ![![180, -411, -158, -84, -468]], ![![34, -238, -99, -66, -276]], ![![-346, -30, -50, -95, -60]], ![![56, -153, -60, -34, -175]]]
  g := ![![![5, -10, 0, -6, 30], ![-16, 29, -34, 24, -36], ![90, -86, 93, -114, 144], ![-58, 82, -42, 73, -192], ![-4, -15, 6, 2, 29]]]
  hle1 := by decide   
  hle2 := by decide  


def P379P0 : CertificateIrreducibleZModOfList' 379 2 2 8 [126, 79, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [300, 378], [0, 1]]
 g := ![![[142, 376], [224, 70], [364], [243, 306], [214, 81], [281, 49], [240, 177], [1]], ![[0, 3], [0, 309], [364], [325, 73], [258, 298], [200, 330], [280, 202], [1]]]
 h' := ![![[300, 378], [201, 276], [113, 59], [81, 227], [324, 64], [220, 9], [80, 7], [253, 300], [0, 1]], ![[0, 1], [0, 103], [0, 320], [340, 152], [195, 315], [267, 370], [285, 372], [51, 79], [300, 378]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [204]]
 b := ![[], [239, 102]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI379N0 : CertifiedPrimeIdeal' SI379N0 379 where
  n := 2
  hpos := by decide
  P := [126, 79, 1]
  hirr := P379P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![801980, 811877, 646288, 354325, 1239000]
  a := ![98, 72, 147, -1, 293]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-468194, -918653, 646288, 354325, 1239000]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI379N0 : Ideal.IsPrime I379N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI379N0 B_one_repr
lemma NI379N0 : Nat.card (O ⧸ I379N0) = 143641 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI379N0

def I379N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1239, 706, 60, -242, 546]] i)))

def SI379N1: IdealEqSpanCertificate' Table ![![-1239, 706, 60, -242, 546]] 
 ![![379, 0, 0, 0, 0], ![0, 379, 0, 0, 0], ![17, 131, 1, 0, 0], ![274, 140, 0, 1, 0], ![118, 185, 0, 0, 1]] where
  M :=![![![-1239, 706, 60, -242, 546], ![3884, -995, -80, 484, -1452], ![-10648, 2996, 537, -1208, 2904], ![4684, -2496, -236, 861, -1932], ![2020, -510, -182, 164, -209]]]
  hmulB := by decide  
  f := ![![![-180805, 55030, 36984, -46066, 85062]], ![![588364, -178793, -120152, 149948, -276396]], ![![190213, -57795, -38839, 48478, -89346]], ![![90934, -27568, -18524, 23185, -42624]], ![![230278, -69949, -47006, 58692, -108137]]]
  g := ![![![-1, -196, 60, -242, 546], ![116, 555, -80, 484, -1452], ![-83, -1149, 537, -1208, 2904], ![2, 700, -236, 861, -1932], ![-40, 103, -182, 164, -209]]]
  hle1 := by decide   
  hle2 := by decide  


def P379P1 : CertificateIrreducibleZModOfList' 379 2 2 8 [184, 150, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [229, 378], [0, 1]]
 g := ![![[145, 314], [43, 58], [290], [232, 189], [369, 104], [29, 156], [240, 139], [1]], ![[41, 65], [60, 321], [290], [307, 190], [308, 275], [127, 223], [235, 240], [1]]]
 h' := ![![[229, 378], [47, 47], [71, 171], [139, 153], [324, 319], [349, 56], [183, 326], [195, 229], [0, 1]], ![[0, 1], [198, 332], [193, 208], [308, 226], [228, 60], [287, 323], [174, 53], [334, 150], [229, 378]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [306]]
 b := ![[], [105, 153]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI379N1 : CertifiedPrimeIdeal' SI379N1 379 where
  n := 2
  hpos := by decide
  P := [184, 150, 1]
  hirr := P379P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![16586, 75451, 56585, 17070, 110025]
  a := ![-32, -24, -50, 8, -95]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-49091, -79371, 56585, 17070, 110025]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI379N1 : Ideal.IsPrime I379N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI379N1 B_one_repr
lemma NI379N1 : Nat.card (O ⧸ I379N1) = 143641 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI379N1

def I379N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![77, -3, -11, 10, -20]] i)))

def SI379N2: IdealEqSpanCertificate' Table ![![77, -3, -11, 10, -20]] 
 ![![379, 0, 0, 0, 0], ![20, 1, 0, 0, 0], ![358, 0, 1, 0, 0], ![266, 0, 0, 1, 0], ![24, 0, 0, 0, 1]] where
  M :=![![![77, -3, -11, 10, -20], ![-140, 78, 38, -43, 60], ![394, -161, -89, 131, -258], ![-516, 91, 90, -102, 196], ![114, -32, -24, 16, -9]]]
  hmulB := by decide  
  f := ![![![969, 1457, 731, 696, 1762]], ![![92, 84, 46, 49, 104]], ![![1028, 1433, 727, 703, 1738]], ![![958, 1109, 580, 584, 1356]], ![![142, 118, 66, 72, 147]]]
  g := ![![![5, -3, -11, 10, -20], ![-14, 78, 38, -43, 60], ![18, -161, -89, 131, -258], ![-32, 91, 90, -102, 196], ![14, -32, -24, 16, -9]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI379N2 : Nat.card (O ⧸ I379N2) = 379 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI379N2)

lemma isPrimeI379N2 : Ideal.IsPrime I379N2 := prime_ideal_of_norm_prime hp379.out _ NI379N2
def MulI379N0 : IdealMulLeCertificate' Table 
  ![![-37, -16, 0, -6, 30]] ![![-1239, 706, 60, -242, 546]]
  ![![16195, -10526, -4984, 964, 8352]] where
 M := ![![![16195, -10526, -4984, 964, 8352]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI379N1 : IdealMulLeCertificate' Table 
  ![![16195, -10526, -4984, 964, 8352]] ![![77, -3, -11, 10, -20]]
  ![![379, 0, 0, 0, 0]] where
 M := ![![![1211663, -246729, -248245, -3032, 444188]]]
 hmul := by decide  
 g := ![![![![3197, -651, -655, -8, 1172]]]]
 hle2 := by decide  


def PBC379 : ContainsPrimesAboveP 379 ![I379N0, I379N1, I379N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI379N0
    exact isPrimeI379N1
    exact isPrimeI379N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 379 (by decide) (𝕀 ⊙ MulI379N0 ⊙ MulI379N1)
instance hp383 : Fact (Nat.Prime 383) := {out := by norm_num}

def I383N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1145, 327, 229, -282, 522]] i)))

def SI383N0: IdealEqSpanCertificate' Table ![![-1145, 327, 229, -282, 522]] 
 ![![383, 0, 0, 0, 0], ![0, 383, 0, 0, 0], ![301, 157, 1, 0, 0], ![51, 362, 0, 1, 0], ![65, 164, 0, 0, 1]] where
  M :=![![![-1145, 327, 229, -282, 522], ![3612, -1134, -748, 927, -1692], ![-11682, 3595, 2395, -3009, 5562], ![10136, -3021, -2060, 2552, -4728], ![-1522, 456, 310, -374, 667]]]
  hmulB := by decide  
  f := ![![![116567, -40489, -5037, 15888, -39312]], ![![-282720, 98180, 12212, -38535, 95328]], ![![-22493, 7804, 970, -3066, 7578]], ![![-252793, 87786, 10919, -34456, 85236]], ![![-101525, 35255, 4385, -13838, 34231]]]
  g := ![![![-234, -50, 229, -282, 522], ![761, 152, -748, 927, -1692], ![-2456, -510, 2395, -3009, 5562], ![2108, 449, -2060, 2552, -4728], ![-311, -58, 310, -374, 667]]]
  hle1 := by decide   
  hle2 := by decide  


def P383P0 : CertificateIrreducibleZModOfList' 383 2 2 8 [350, 269, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [114, 382], [0, 1]]
 g := ![![[282, 58], [177, 69], [255, 28], [357, 93], [349, 258], [43, 317], [347, 357], [1]], ![[0, 325], [0, 314], [0, 355], [235, 290], [270, 125], [179, 66], [64, 26], [1]]]
 h' := ![![[114, 382], [96, 362], [372, 158], [291, 68], [27, 172], [270, 32], [344, 340], [33, 114], [0, 1]], ![[0, 1], [0, 21], [0, 225], [0, 315], [102, 211], [88, 351], [38, 43], [7, 269], [114, 382]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [65]]
 b := ![[], [254, 224]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI383N0 : CertifiedPrimeIdeal' SI383N0 383 where
  n := 2
  hpos := by decide
  P := [350, 269, 1]
  hirr := P383P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-63432, 26654, 27838, -28642, 49710]
  a := ![14, 18, 30, -26, 42]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-26666, -5556, 27838, -28642, 49710]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI383N0 : Ideal.IsPrime I383N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI383N0 B_one_repr
lemma NI383N0 : Nat.card (O ⧸ I383N0) = 146689 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI383N0

def I383N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-31, -12, 0, 0, -6]] i)))

def SI383N1: IdealEqSpanCertificate' Table ![![-31, -12, 0, 0, -6]] 
 ![![383, 0, 0, 0, 0], ![0, 383, 0, 0, 0], ![274, 334, 1, 0, 0], ![226, 168, 0, 1, 0], ![69, 2, 0, 0, 1]] where
  M :=![![![-31, -12, 0, 0, -6], ![-48, -37, -12, -6, 0], ![-12, -42, -43, -42, -36], ![-144, -42, -60, -85, -96], ![-108, -6, -6, -24, -49]]]
  hmulB := by decide  
  f := ![![![-809, 240, 180, -216, 390]], ![![2688, -815, -588, 714, -1296]], ![![1742, -532, -379, 462, -840]], ![![722, -222, -156, 191, -348]], ![![-135, 40, 30, -36, 65]]]
  g := ![![![1, 0, 0, 0, -6], ![12, 13, -12, -6, 0], ![62, 56, -43, -42, -36], ![110, 90, -60, -85, -96], ![27, 16, -6, -24, -49]]]
  hle1 := by decide   
  hle2 := by decide  


def P383P1 : CertificateIrreducibleZModOfList' 383 2 2 8 [143, 126, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 1, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [257, 382], [0, 1]]
 g := ![![[258, 75], [178, 226], [153, 216], [374, 161], [96, 322], [211, 223], [67, 173], [1]], ![[0, 308], [44, 157], [130, 167], [4, 222], [122, 61], [72, 160], [100, 210], [1]]]
 h' := ![![[257, 382], [207, 29], [335, 284], [138, 95], [60, 236], [84, 160], [377, 290], [240, 257], [0, 1]], ![[0, 1], [0, 354], [170, 99], [41, 288], [198, 147], [223, 223], [222, 93], [30, 126], [257, 382]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [96]]
 b := ![[], [343, 48]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI383N1 : CertifiedPrimeIdeal' SI383N1 383 where
  n := 2
  hpos := by decide
  P := [143, 126, 1]
  hirr := P383P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![17405, 7527, 6360, 6524, 12377]
  a := ![12, 6, 10, 5, 23]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-10584, -8453, 6360, 6524, 12377]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI383N1 : Ideal.IsPrime I383N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI383N1 B_one_repr
lemma NI383N1 : Nat.card (O ⧸ I383N1) = 146689 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI383N1

def I383N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-25, -31, -5, 4, 10]] i)))

def SI383N2: IdealEqSpanCertificate' Table ![![-25, -31, -5, 4, 10]] 
 ![![383, 0, 0, 0, 0], ![275, 1, 0, 0, 0], ![209, 0, 1, 0, 0], ![153, 0, 0, 1, 0], ![89, 0, 0, 0, 1]] where
  M :=![![![-25, -31, -5, 4, 10], ![88, -6, -14, -1, 24], ![190, 125, 5, -19, -6], ![64, 93, 18, -10, -32], ![-158, -66, 6, 12, -9]]]
  hmulB := by decide  
  f := ![![![13935, -4227, -2871, 3570, -6568]], ![![9887, -2999, -2037, 2533, -4660]], ![![7991, -2424, -1646, 2047, -3766]], ![![5237, -1588, -1079, 1342, -2468]], ![![3287, -997, -677, 842, -1549]]]
  g := ![![![21, -31, -5, 4, 10], ![7, -6, -14, -1, 24], ![-83, 125, 5, -19, -6], ![-65, 93, 18, -10, -32], ![41, -66, 6, 12, -9]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI383N2 : Nat.card (O ⧸ I383N2) = 383 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI383N2)

lemma isPrimeI383N2 : Ideal.IsPrime I383N2 := prime_ideal_of_norm_prime hp383.out _ NI383N2
def MulI383N0 : IdealMulLeCertificate' Table 
  ![![-1145, 327, 229, -282, 522]] ![![-31, -12, 0, 0, -6]]
  ![![1283, 735, 17, -138, 120]] where
 M := ![![![1283, 735, 17, -138, 120]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI383N1 : IdealMulLeCertificate' Table 
  ![![1283, 735, 17, -138, 120]] ![![-25, -31, -5, 4, 10]]
  ![![383, 0, 0, 0, 0]] where
 M := ![![![8043, -62812, -18384, 6894, 33704]]]
 hmul := by decide  
 g := ![![![![21, -164, -48, 18, 88]]]]
 hle2 := by decide  


def PBC383 : ContainsPrimesAboveP 383 ![I383N0, I383N1, I383N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI383N0
    exact isPrimeI383N1
    exact isPrimeI383N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 383 (by decide) (𝕀 ⊙ MulI383N0 ⊙ MulI383N1)
instance hp389 : Fact (Nat.Prime 389) := {out := by norm_num}

def I389N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![4625, 1533, -275, -316, 552]] i)))

def SI389N0: IdealEqSpanCertificate' Table ![![4625, 1533, -275, -316, 552]] 
 ![![389, 0, 0, 0, 0], ![0, 389, 0, 0, 0], ![0, 0, 389, 0, 0], ![0, 0, 0, 389, 0], ![236, 81, 89, 115, 1]] where
  M :=![![![4625, 1533, -275, -316, 552], ![3784, 5136, 860, -589, -1896], ![-16346, 439, 2509, 95, -3534], ![-13548, -5573, 528, 1198, -1620], ![6498, -3074, -1812, 150, 3367]]]
  hmulB := by decide  
  f := ![![![267, 103, 73, 98, 138]], ![![1300, 430, 324, 455, 588]], ![![5614, 2019, 1471, 2015, 2730]], ![![10928, 3779, 2796, 3876, 5136]], ![![4956, 1734, 1277, 1764, 2353]]]
  g := ![![![-323, -111, -127, -164, 552], ![1160, 408, 436, 559, -1896], ![2102, 737, 815, 1045, -3534], ![948, 323, 372, 482, -1620], ![-2026, -709, -775, -995, 3367]]]
  hle1 := by decide   
  hle2 := by decide  


def P389P0 : CertificateIrreducibleZModOfList' 389 4 2 8 [365, 4, 51, 26, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [127, 256, 294, 227], [127, 158, 88, 104], [109, 363, 7, 58], [0, 1]]
 g := ![![[216, 209, 357, 78], [340, 51, 209], [23, 88, 139, 230], [204, 211, 325], [374, 76, 28], [279, 363, 310], [236, 363, 1], []], ![[338, 256, 334, 43, 115, 123], [280, 381, 220], [385, 223, 258, 52, 6, 192], [106, 59, 248], [190, 302, 140], [319, 36, 202], [88, 345, 287], [167, 20, 12, 216, 84, 242]], ![[41, 246, 45, 240, 35, 151], [24, 117, 223], [169, 306, 99, 213, 150, 118], [52, 54, 388], [96, 273, 310], [343, 257, 35], [301, 287, 49], [187, 338, 211, 128, 276, 265]], ![[233, 156, 196, 230, 139, 64], [134, 298, 334], [359, 138, 161, 248, 131, 320], [143, 271, 213], [169, 327, 74], [324, 246, 30], [168, 298, 324], [57, 320, 265, 378, 272, 223]]]
 h' := ![![[127, 256, 294, 227], [108, 85, 248, 95], [163, 262, 10, 177], [365, 386, 75, 116], [57, 321, 62, 142], [149, 30, 167, 240], [218, 377, 151, 243], [0, 0, 0, 1], [0, 1]], ![[127, 158, 88, 104], [90, 62, 7, 271], [251, 291, 170, 328], [209, 153, 315, 341], [274, 188, 338, 268], [185, 4, 221, 23], [118, 160, 103, 37], [27, 346, 381, 363], [127, 256, 294, 227]], ![[109, 363, 7, 58], [181, 144, 50, 45], [108, 161, 92, 85], [144, 231, 220, 268], [360, 330, 335, 115], [388, 196, 122, 243], [142, 192, 0, 183], [118, 102, 306, 7], [127, 158, 88, 104]], ![[0, 1], [241, 98, 84, 367], [332, 64, 117, 188], [104, 8, 168, 53], [259, 328, 43, 253], [69, 159, 268, 272], [292, 49, 135, 315], [249, 330, 91, 18], [109, 363, 7, 58]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [302, 342, 142], []]
 b := ![[], [], [345, 36, 135, 51], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI389N0 : CertifiedPrimeIdeal' SI389N0 389 where
  n := 4
  hpos := by decide
  P := [365, 4, 51, 26, 1]
  hirr := P389P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![3373339965, 1220073354, 898050360, 1206336372, 1659841770]
  a := ![-8, -6, -11, -1, -23]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-998327295, -342486144, -377449530, -487597602, 1659841770]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI389N0 : Ideal.IsPrime I389N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI389N0 B_one_repr
lemma NI389N0 : Nat.card (O ⧸ I389N0) = 22898045041 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI389N0

def I389N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![267, 103, 73, 98, 138]] i)))

def SI389N1: IdealEqSpanCertificate' Table ![![267, 103, 73, 98, 138]] 
 ![![389, 0, 0, 0, 0], ![88, 1, 0, 0, 0], ![36, 0, 1, 0, 0], ![282, 0, 0, 1, 0], ![323, 0, 0, 0, 1]] where
  M :=![![![267, 103, 73, 98, 138], ![1300, 430, 324, 455, 588], ![5614, 2019, 1471, 2015, 2730], ![10928, 3779, 2796, 3876, 5136], ![3206, 1112, 822, 1138, 1511]]]
  hmulB := by decide  
  f := ![![![4625, 1533, -275, -316, 552]], ![![1056, 360, -60, -73, 120]], ![![386, 143, -19, -29, 42]], ![![3318, 1097, -198, -226, 396]], ![![3857, 1265, -233, -262, 467]]]
  g := ![![![-215, 103, 73, 98, 138], ![-942, 430, 324, 455, 588], ![-4306, 2019, 1471, 2015, 2730], ![-8160, 3779, 2796, 3876, 5136], ![-2399, 1112, 822, 1138, 1511]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI389N1 : Nat.card (O ⧸ I389N1) = 389 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI389N1)

lemma isPrimeI389N1 : Ideal.IsPrime I389N1 := prime_ideal_of_norm_prime hp389.out _ NI389N1
def MulI389N0 : IdealMulLeCertificate' Table 
  ![![4625, 1533, -275, -316, 552]] ![![267, 103, 73, 98, 138]]
  ![![389, 0, 0, 0, 0]] where
 M := ![![![389, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC389 : ContainsPrimesAboveP 389 ![I389N0, I389N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI389N0
    exact isPrimeI389N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 389 (by decide) (𝕀 ⊙ MulI389N0)
instance hp397 : Fact (Nat.Prime 397) := {out := by norm_num}

def I397N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![397, 0, 0, 0, 0]] i)))

def SI397N0: IdealEqSpanCertificate' Table ![![397, 0, 0, 0, 0]] 
 ![![397, 0, 0, 0, 0], ![0, 397, 0, 0, 0], ![0, 0, 397, 0, 0], ![0, 0, 0, 397, 0], ![0, 0, 0, 0, 397]] where
  M :=![![![397, 0, 0, 0, 0], ![0, 397, 0, 0, 0], ![0, 0, 397, 0, 0], ![0, 0, 0, 397, 0], ![0, 0, 0, 0, 397]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P397P0 : CertificateIrreducibleZModOfList' 397 5 2 8 [325, 3, 334, 338, 103, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 1, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [18, 60, 336, 72, 241], [38, 150, 300, 172, 220], [313, 367, 190, 169, 357], [322, 216, 365, 381, 373], [0, 1]]
 g := ![![[298, 101, 118, 128, 381], [293, 226, 105, 131], [332, 196, 296, 20, 160], [57, 332, 67, 129, 11], [159, 230, 28, 318], [324, 103, 135, 219], [294, 1], []], ![[153, 40, 255, 357, 320, 6, 77, 197], [355, 251, 27, 147], [329, 309, 265, 272, 40, 304, 223, 241], [226, 189, 302, 224, 8, 70, 306, 347], [344, 273, 30, 10], [353, 345, 17, 79], [380, 99, 254, 224], [13, 320, 246, 379, 225, 13, 39, 95]], ![[354, 151, 319, 186, 99, 40, 274, 59], [247, 181, 70, 276], [310, 369, 158, 136, 230, 208, 146, 71], [128, 146, 126, 188, 305, 92, 124, 272], [368, 225, 273, 229], [137, 94, 226, 73], [382, 5, 26, 4], [102, 14, 179, 385, 98, 6, 184, 63]], ![[217, 85, 18, 363, 243, 5, 143, 121], [125, 271, 127, 253], [310, 283, 365, 42, 192, 129, 304, 78], [333, 395, 205, 289, 67, 345, 116, 105], [243, 223, 369, 250], [134, 294, 142, 34], [368, 300, 62, 354], [141, 167, 318, 31, 298, 149, 341, 314]], ![[13, 94, 23, 39, 325, 4, 43, 222], [3, 181, 303, 40], [46, 289, 139, 29, 382, 327, 130, 301], [344, 296, 66, 45, 91, 346, 68, 138], [14, 302, 232, 107], [203, 121, 70, 144], [83, 361, 258, 314], [377, 339, 57, 29, 89, 129, 372, 71]]]
 h' := ![![[18, 60, 336, 72, 241], [362, 250, 368, 337, 145], [84, 106, 250, 137, 351], [134, 287, 123, 224, 90], [228, 381, 127, 318, 188], [154, 395, 77, 290, 203], [127, 381, 257, 338, 346], [0, 0, 0, 1], [0, 1]], ![[38, 150, 300, 172, 220], [83, 118, 69, 344, 162], [204, 197, 3, 247, 140], [289, 49, 368, 276, 396], [179, 9, 122, 169, 81], [5, 322, 245, 197, 176], [328, 380, 19, 90, 85], [19, 333, 231, 113, 47], [18, 60, 336, 72, 241]], ![[313, 367, 190, 169, 357], [39, 205, 129, 362, 23], [291, 263, 42, 138, 296], [77, 301, 164, 256, 256], [116, 262, 181, 81, 382], [346, 161, 187, 48, 232], [176, 23, 343, 242, 340], [284, 216, 21, 308, 2], [38, 150, 300, 172, 220]], ![[322, 216, 365, 381, 373], [236, 340, 166, 270, 333], [234, 300, 279, 42, 359], [44, 200, 206, 48, 54], [278, 102, 126, 61, 29], [311, 197, 356, 289, 311], [280, 188, 385, 381, 35], [244, 248, 112, 0, 206], [313, 367, 190, 169, 357]], ![[0, 1], [299, 278, 62, 275, 131], [185, 325, 220, 230, 45], [191, 354, 330, 387, 395], [180, 40, 238, 165, 114], [177, 116, 326, 367, 269], [86, 219, 187, 140, 385], [284, 394, 33, 372, 142], [322, 216, 365, 381, 373]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [26, 364, 97, 388], [], [], []]
 b := ![[], [82, 36, 93, 311, 145], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI397N0 : CertifiedPrimeIdeal' SI397N0 397 where
  n := 5
  hpos := by decide
  P := [325, 3, 334, 338, 103, 1]
  hirr := P397P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![69721637159527, 24744172313723, 18227641847395, 24861205961277, 33623876059461]
  a := ![16, 10, 23, 2, 45]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![175621252291, 62327889959, 45913455535, 62622685041, 84694901913]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI397N0 : Ideal.IsPrime I397N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI397N0 B_one_repr
lemma NI397N0 : Nat.card (O ⧸ I397N0) = 9861716961757 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI397N0

def PBC397 : ContainsPrimesAboveP 397 ![I397N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI397N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![397, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 397 (by decide) 𝕀

instance hp401 : Fact (Nat.Prime 401) := {out := by norm_num}

def I401N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![401, 0, 0, 0, 0]] i)))

def SI401N0: IdealEqSpanCertificate' Table ![![401, 0, 0, 0, 0]] 
 ![![401, 0, 0, 0, 0], ![0, 401, 0, 0, 0], ![0, 0, 401, 0, 0], ![0, 0, 0, 401, 0], ![0, 0, 0, 0, 401]] where
  M :=![![![401, 0, 0, 0, 0], ![0, 401, 0, 0, 0], ![0, 0, 401, 0, 0], ![0, 0, 0, 401, 0], ![0, 0, 0, 0, 401]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P401P0 : CertificateIrreducibleZModOfList' 401 5 2 8 [22, 311, 149, 288, 211, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [187, 93, 177, 170, 218], [179, 179, 241, 170, 226], [248, 141, 365, 355, 328], [378, 388, 19, 107, 30], [0, 1]]
 g := ![![[192, 280, 215, 122, 114], [66, 385, 54, 201], [208, 261, 205, 86], [190, 130, 7, 360], [253, 29, 322, 57, 324], [57, 25, 28, 292], [190, 1], []], ![[179, 108, 107, 310, 279, 287, 118, 313], [272, 330, 11, 345], [357, 20, 0, 8], [140, 146, 351, 43], [50, 271, 18, 173, 293, 393, 89, 362], [397, 129, 267, 57], [375, 307, 182, 250], [6, 92, 374, 375, 1, 110, 40, 397]], ![[143, 226, 318, 117, 34, 246, 73, 29], [117, 327, 163, 11], [12, 289, 369, 69], [204, 338, 329, 343], [78, 103, 18, 149, 279, 143, 216, 56], [119, 24, 160, 80], [102, 50, 69, 252], [358, 121, 399, 219, 58, 63, 306, 391]], ![[8, 314, 259, 274, 333, 269, 15, 360], [77, 33, 238, 109], [151, 219, 395, 88], [372, 157, 320, 98], [191, 111, 250, 223, 97, 154, 57, 197], [273, 289, 186, 391], [23, 35, 96, 291], [361, 150, 21, 211, 245, 354, 325, 354]], ![[38, 264, 200, 377, 41, 246, 313, 316], [347, 237, 166, 332], [199, 295, 398, 179], [221, 342, 285, 331], [199, 120, 60, 150, 340, 185, 330, 395], [215, 230, 275, 88], [206, 242, 304, 287], [52, 367, 282, 9, 338, 246, 187, 133]]]
 h' := ![![[187, 93, 177, 170, 218], [174, 2, 47, 23, 142], [35, 82, 54, 317, 227], [129, 236, 235, 347, 64], [48, 205, 15, 215, 338], [378, 129, 389, 330, 18], [231, 236, 251, 68, 123], [0, 0, 0, 1], [0, 1]], ![[179, 179, 241, 170, 226], [272, 182, 383, 268, 390], [38, 314, 30, 180, 151], [59, 339, 26, 356, 106], [357, 317, 32, 243, 92], [10, 264, 323, 37, 354], [264, 2, 120, 171, 247], [365, 141, 183, 0, 148], [187, 93, 177, 170, 218]], ![[248, 141, 365, 355, 328], [211, 62, 90, 229, 398], [102, 153, 100, 208, 326], [155, 262, 397, 367, 323], [260, 89, 331, 71, 207], [45, 140, 75, 351, 23], [161, 320, 145, 39, 311], [381, 194, 281, 327, 109], [179, 179, 241, 170, 226]], ![[378, 388, 19, 107, 30], [20, 211, 249, 74, 265], [215, 222, 138, 256, 54], [56, 117, 182, 356, 70], [167, 207, 59, 305, 371], [4, 227, 315, 242, 317], [49, 107, 131, 249, 191], [233, 31, 61, 44, 111], [248, 141, 365, 355, 328]], ![[0, 1], [277, 345, 33, 208, 8], [278, 31, 79, 242, 44], [358, 249, 363, 178, 239], [316, 385, 365, 369, 195], [380, 42, 101, 243, 90], [349, 137, 155, 275, 331], [323, 35, 277, 29, 33], [378, 388, 19, 107, 30]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [291, 71, 312, 354], [], [], []]
 b := ![[], [88, 320, 106, 346, 186], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI401N0 : CertifiedPrimeIdeal' SI401N0 401 where
  n := 5
  hpos := by decide
  P := [22, 311, 149, 288, 211, 1]
  hirr := P401P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![276910840677682, 105550478214561, 77563650018744, 99848256905697, 144082951414572]
  a := ![24, 18, 37, -5, 71]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![690550724882, 263218150161, 193425561144, 248998146897, 359309105772]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI401N0 : Ideal.IsPrime I401N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI401N0 B_one_repr
lemma NI401N0 : Nat.card (O ⧸ I401N0) = 10368641602001 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI401N0

def PBC401 : ContainsPrimesAboveP 401 ![I401N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI401N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![401, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 401 (by decide) 𝕀

instance hp409 : Fact (Nat.Prime 409) := {out := by norm_num}

def I409N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![112957, -39219, -4875, 15400, -38076]] i)))

def SI409N0: IdealEqSpanCertificate' Table ![![112957, -39219, -4875, 15400, -38076]] 
 ![![409, 0, 0, 0, 0], ![0, 409, 0, 0, 0], ![0, 0, 409, 0, 0], ![334, 149, 15, 1, 0], ![30, 138, 385, 0, 1]] where
  M :=![![![112957, -39219, -4875, 15400, -38076], ![-273808, 95156, 11856, -37301, 92400], ![664598, -230565, -28603, 90667, -223806], ![-406108, 141551, 17764, -55194, 137532], ![-91654, 31982, 4024, -12446, 31079]]]
  hmulB := by decide  
  f := ![![![3, -173, -43, 62, -66]], ![![-404, 42, 56, -133, 372]], ![![2710, -221, -413, 407, -798]], ![![-48, -132, -29, 16, 54]], ![![2414, -207, -373, 343, -631]]]
  g := ![![![-9507, 7141, 35265, 15400, -38076], ![23014, -17355, -85581, -37301, 92400], ![-56000, 41920, 207278, 90667, -223806], ![33992, -25951, -127394, -55194, 137532], ![7660, -5874, -28789, -12446, 31079]]]
  hle1 := by decide   
  hle2 := by decide  


def P409P0 : CertificateIrreducibleZModOfList' 409 3 2 8 [67, 309, 234, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [136, 400, 178], [39, 8, 231], [0, 1]]
 g := ![![[175, 26, 125], [347, 392], [150, 375], [308, 291, 32], [16, 201, 349], [175, 360], [74, 359], [1]], ![[94, 86, 70, 289], [32, 128], [54, 8], [231, 126, 179, 309], [56, 401, 407, 405], [353, 356], [266, 120], [398, 402, 87, 51]], ![[363, 66, 93, 327], [49, 150], [302, 153], [394, 328, 345, 309], [365, 17, 388, 259], [159, 369], [272, 200], [308, 87, 158, 358]]]
 h' := ![![[136, 400, 178], [100, 302, 341], [6, 72, 131], [223, 154, 381], [155, 156, 21], [55, 131, 211], [349, 213, 226], [342, 100, 175], [0, 1]], ![[39, 8, 231], [108, 58, 42], [322, 91, 367], [48, 142, 194], [298, 313, 124], [23, 336, 57], [390, 357, 49], [25, 184, 386], [136, 400, 178]], ![[0, 1], [206, 49, 26], [38, 246, 320], [244, 113, 243], [196, 349, 264], [265, 351, 141], [317, 248, 134], [237, 125, 257], [39, 8, 231]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [227, 252], []]
 b := ![[], [225, 342, 187], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI409N0 : CertifiedPrimeIdeal' SI409N0 409 where
  n := 3
  hpos := by decide
  P := [67, 309, 234, 1]
  hirr := P409P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![13520181, 6662430, 4987620, 5095660, 9393362]
  a := ![11, 7, 14, 1, 29]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-4817191, -5009474, -9016850, 5095660, 9393362]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI409N0 : Ideal.IsPrime I409N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI409N0 B_one_repr
lemma NI409N0 : Nat.card (O ⧸ I409N0) = 68417929 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI409N0

def I409N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![43, -9, -8, 9, -18]] i)))

def SI409N1: IdealEqSpanCertificate' Table ![![43, -9, -8, 9, -18]] 
 ![![409, 0, 0, 0, 0], ![61, 1, 0, 0, 0], ![369, 0, 1, 0, 0], ![275, 0, 0, 1, 0], ![236, 0, 0, 0, 1]] where
  M :=![![![43, -9, -8, 9, -18], ![-126, 42, 26, -33, 54], ![366, -131, -83, 99, -198], ![-382, 87, 64, -94, 150], ![56, -18, -14, 10, -23]]]
  hmulB := by decide  
  f := ![![![-149057, 51775, 6438, -20319, 50274]], ![![-21347, 7415, 922, -2910, 7200]], ![![-136623, 47456, 5901, -18624, 46080]], ![![-98909, 34356, 4272, -13483, 33360]], ![![-85712, 29772, 3702, -11684, 28909]]]
  g := ![![![13, -9, -8, 9, -18], ![-39, 42, 26, -33, 54], ![143, -131, -83, 99, -198], ![-95, 87, 64, -94, 150], ![22, -18, -14, 10, -23]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI409N1 : Nat.card (O ⧸ I409N1) = 409 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI409N1)

lemma isPrimeI409N1 : Ideal.IsPrime I409N1 := prime_ideal_of_norm_prime hp409.out _ NI409N1

def I409N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![23, 8, -1, -1, 0]] i)))

def SI409N2: IdealEqSpanCertificate' Table ![![23, 8, -1, -1, 0]] 
 ![![409, 0, 0, 0, 0], ![302, 1, 0, 0, 0], ![3, 0, 1, 0, 0], ![345, 0, 0, 1, 0], ![113, 0, 0, 0, 1]] where
  M :=![![![23, 8, -1, -1, 0], ![-2, 23, 6, -4, -6], ![-56, -18, 5, 8, -24], ![-78, -24, 4, 1, 6], ![42, -6, -8, 0, 13]]]
  hmulB := by decide  
  f := ![![![561, 18, 61, 145, 54]], ![![416, 15, 46, 108, 42]], ![![23, 4, 4, 7, 6]], ![![499, 26, 59, 132, 60]], ![![163, 8, 19, 43, 19]]]
  g := ![![![-5, 8, -1, -1, 0], ![-12, 23, 6, -4, -6], ![13, -18, 5, 8, -24], ![15, -24, 4, 1, 6], ![1, -6, -8, 0, 13]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI409N2 : Nat.card (O ⧸ I409N2) = 409 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI409N2)

lemma isPrimeI409N2 : Ideal.IsPrime I409N2 := prime_ideal_of_norm_prime hp409.out _ NI409N2
def MulI409N0 : IdealMulLeCertificate' Table 
  ![![112957, -39219, -4875, 15400, -38076]] ![![43, -9, -8, 9, -18]]
  ![![-561, -18, -61, -145, -54]] where
 M := ![![![-561, -18, -61, -145, -54]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI409N1 : IdealMulLeCertificate' Table 
  ![![-561, -18, -61, -145, -54]] ![![23, 8, -1, -1, 0]]
  ![![409, 0, 0, 0, 0]] where
 M := ![![![-409, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC409 : ContainsPrimesAboveP 409 ![I409N0, I409N1, I409N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI409N0
    exact isPrimeI409N1
    exact isPrimeI409N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 409 (by decide) (𝕀 ⊙ MulI409N0 ⊙ MulI409N1)
instance hp419 : Fact (Nat.Prime 419) := {out := by norm_num}

def I419N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![393, -174, -34, 42, -178]] i)))

def SI419N0: IdealEqSpanCertificate' Table ![![393, -174, -34, 42, -178]] 
 ![![419, 0, 0, 0, 0], ![0, 419, 0, 0, 0], ![0, 0, 419, 0, 0], ![256, 373, 220, 1, 0], ![150, 395, 231, 0, 1]] where
  M :=![![![393, -174, -34, 42, -178], ![-1340, 291, -14, -238, 252], ![1540, -1312, -409, -28, -1428], ![-3760, -176, -470, -983, -448], ![-976, -92, -146, -270, -177]]]
  hmulB := by decide  
  f := ![![![-37, -58, -10, 10, 10]], ![![100, -7, -18, -10, 60]], ![![460, 168, -19, -4, -60]], ![![308, 47, -32, -5, 28]], ![![334, 65, -31, -8, 27]]]
  g := ![![![39, 130, 76, 42, -178], ![52, -25, -14, -238, 252], ![532, 1368, 801, -28, -1428], ![752, 1297, 762, -983, -448], ![226, 407, 239, -270, -177]]]
  hle1 := by decide   
  hle2 := by decide  


def P419P0 : CertificateIrreducibleZModOfList' 419 3 2 8 [193, 364, 45, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 0, 1, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [188, 216, 343], [186, 202, 76], [0, 1]]
 g := ![![[405, 217, 364], [321, 145, 368], [41, 66], [19, 205], [41, 295], [212, 388, 20], [295, 349], [1]], ![[202, 82, 84, 185], [373, 232, 17, 110], [0, 256], [337, 87], [396, 105], [11, 184, 356, 202], [203, 189], [389, 201, 86, 136]], ![[160, 216, 314, 89], [87, 123, 137, 181], [311, 108], [417, 269], [43, 34], [268, 327, 269, 163], [186, 269], [0, 58, 184, 283]]]
 h' := ![![[188, 216, 343], [59, 158, 266], [348, 314, 110], [129, 417, 190], [414, 3, 144], [146, 94, 53], [7, 125, 337], [226, 55, 374], [0, 1]], ![[186, 202, 76], [108, 206, 243], [154, 120, 32], [299, 59, 403], [298, 213, 368], [412, 93, 210], [244, 100, 333], [94, 153, 138], [188, 216, 343]], ![[0, 1], [188, 55, 329], [30, 404, 277], [107, 362, 245], [289, 203, 326], [284, 232, 156], [83, 194, 168], [273, 211, 326], [186, 202, 76]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [61, 404], []]
 b := ![[], [187, 410, 292], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI419N0 : CertifiedPrimeIdeal' SI419N0 419 where
  n := 3
  hpos := by decide
  P := [193, 364, 45, 1]
  hirr := P419P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-130611885, 12415950, 9366096, -39826186, 22578436]
  a := ![10, 24, 24, -50, 23]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![15938249, 14198332, 8485700, -39826186, 22578436]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI419N0 : Ideal.IsPrime I419N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI419N0 B_one_repr
lemma NI419N0 : Nat.card (O ⧸ I419N0) = 73560059 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI419N0

def I419N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-15, 5, 3, -4, 6]] i)))

def SI419N1: IdealEqSpanCertificate' Table ![![-15, 5, 3, -4, 6]] 
 ![![419, 0, 0, 0, 0], ![237, 1, 0, 0, 0], ![396, 0, 1, 0, 0], ![352, 0, 0, 1, 0], ![116, 0, 0, 0, 1]] where
  M :=![![![-15, 5, 3, -4, 6], ![40, -16, -10, 11, -24], ![-170, 37, 27, -43, 66], ![104, -51, -34, 24, -72], ![-22, 6, 2, -8, 5]]]
  hmulB := by decide  
  f := ![![![6557, -2327, -291, 902, -2208]], ![![3671, -1303, -163, 505, -1236]], ![![6290, -2231, -279, 865, -2118]], ![![5452, -1935, -242, 750, -1836]], ![![1802, -640, -80, 248, -607]]]
  g := ![![![-4, 5, 3, -4, 6], ![16, -16, -10, 11, -24], ![-29, 37, 27, -43, 66], ![61, -51, -34, 24, -72], ![0, 6, 2, -8, 5]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI419N1 : Nat.card (O ⧸ I419N1) = 419 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI419N1)

lemma isPrimeI419N1 : Ideal.IsPrime I419N1 := prime_ideal_of_norm_prime hp419.out _ NI419N1

def I419N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![11, 3, -3, -2, 10]] i)))

def SI419N2: IdealEqSpanCertificate' Table ![![11, 3, -3, -2, 10]] 
 ![![419, 0, 0, 0, 0], ![359, 1, 0, 0, 0], ![171, 0, 1, 0, 0], ![105, 0, 0, 1, 0], ![259, 0, 0, 0, 1]] where
  M :=![![![11, 3, -3, -2, 10], ![76, 22, 0, -1, -12], ![-98, 63, 19, -13, -6], ![-32, -17, 8, 8, -32], ![-2, -44, -10, 6, 15]]]
  hmulB := by decide  
  f := ![![![-1209, -281, -217, -408, -376]], ![![-1045, -245, -189, -353, -328]], ![![-547, -130, -100, -185, -174]], ![![-391, -104, -79, -134, -140]], ![![-775, -183, -141, -262, -245]]]
  g := ![![![-7, 3, -3, -2, 10], ![-11, 22, 0, -1, -12], ![-55, 63, 19, -13, -6], ![29, -17, 8, 8, -32], ![31, -44, -10, 6, 15]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI419N2 : Nat.card (O ⧸ I419N2) = 419 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI419N2)

lemma isPrimeI419N2 : Ideal.IsPrime I419N2 := prime_ideal_of_norm_prime hp419.out _ NI419N2
def MulI419N0 : IdealMulLeCertificate' Table 
  ![![393, -174, -34, 42, -178]] ![![-15, 5, 3, -4, 6]]
  ![![1209, 281, 217, 408, 376]] where
 M := ![![![1209, 281, 217, 408, 376]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI419N1 : IdealMulLeCertificate' Table 
  ![![1209, 281, 217, 408, 376]] ![![11, 3, -3, -2, 10]]
  ![![419, 0, 0, 0, 0]] where
 M := ![![![-419, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC419 : ContainsPrimesAboveP 419 ![I419N0, I419N1, I419N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI419N0
    exact isPrimeI419N1
    exact isPrimeI419N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 419 (by decide) (𝕀 ⊙ MulI419N0 ⊙ MulI419N1)


lemma PB696I8_primes (p : ℕ) :
  p ∈ Set.range ![367, 373, 379, 383, 389, 397, 401, 409, 419] ↔ Nat.Prime p ∧ 359 < p ∧ p ≤ 419 := by
  rw [← List.mem_ofFn']
  convert primes_range 359 419 (by omega)

def PB696I8 : PrimesBelowBoundCertificateInterval O 359 419 696 where
  m := 9
  g := ![1, 3, 3, 3, 2, 1, 1, 3, 3]
  P := ![367, 373, 379, 383, 389, 397, 401, 409, 419]
  hP := PB696I8_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I367N0]
    · exact ![I373N0, I373N1, I373N2]
    · exact ![I379N0, I379N1, I379N2]
    · exact ![I383N0, I383N1, I383N2]
    · exact ![I389N0, I389N1]
    · exact ![I397N0]
    · exact ![I401N0]
    · exact ![I409N0, I409N1, I409N2]
    · exact ![I419N0, I419N1, I419N2]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC367
    · exact PBC373
    · exact PBC379
    · exact PBC383
    · exact PBC389
    · exact PBC397
    · exact PBC401
    · exact PBC409
    · exact PBC419
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![6657793506607]
    · exact ![139129, 139129, 373]
    · exact ![143641, 143641, 379]
    · exact ![146689, 146689, 383]
    · exact ![22898045041, 389]
    · exact ![9861716961757]
    · exact ![10368641602001]
    · exact ![68417929, 409, 409]
    · exact ![73560059, 419, 419]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI367N0
    · dsimp ; intro j
      fin_cases j
      exact NI373N0
      exact NI373N1
      exact NI373N2
    · dsimp ; intro j
      fin_cases j
      exact NI379N0
      exact NI379N1
      exact NI379N2
    · dsimp ; intro j
      fin_cases j
      exact NI383N0
      exact NI383N1
      exact NI383N2
    · dsimp ; intro j
      fin_cases j
      exact NI389N0
      exact NI389N1
    · dsimp ; intro j
      fin_cases j
      exact NI397N0
    · dsimp ; intro j
      fin_cases j
      exact NI401N0
    · dsimp ; intro j
      fin_cases j
      exact NI409N0
      exact NI409N1
      exact NI409N2
    · dsimp ; intro j
      fin_cases j
      exact NI419N0
      exact NI419N1
      exact NI419N2
  β := ![I373N2, I379N2, I383N2, I389N1, I409N1, I409N2, I419N1, I419N2]
  Il := ![[], [I373N2], [I379N2], [I383N2], [I389N1], [], [], [I409N1, I409N2], [I419N1, I419N2]]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
