
import IdealArithmetic.Examples.NF5_3_12000000000_4.RI5_3_12000000000_4
import IdealArithmetic.Generation.ClassGroupGeneration
import IdealArithmetic.IdealArithmetic
import IdealArithmetic.Computation.PrimeSieve

set_option linter.all false

open Classical Polynomial

noncomputable section instance hp67 : Fact (Nat.Prime 67) := {out := by norm_num}

def I67N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-335, 477, -11, -78, 334]] i)))

def SI67N0: IdealEqSpanCertificate' Table ![![-335, 477, -11, -78, 334]] 
 ![![67, 0, 0, 0, 0], ![0, 67, 0, 0, 0], ![0, 0, 67, 0, 0], ![44, 12, 47, 1, 0], ![52, 61, 30, 0, 1]] where
  M :=![![![-335, 477, -11, -78, 334], ![1048, -5195, 3910, 981, -13576], ![5570, 5920, -14642, -1023, 39490], ![-16968, 52802, -29879, -10550, 117656], ![70, 5452, -5856, -1026, 18457]]]
  hmulB := by decide  
  f := ![![![24397, -56251, 25695, 3975, -122132]], ![![156814, -358595, 164107, 25410, -779698]], ![![1000376, -2285294, 1046080, 161991, -4969832]], ![![782562, -1788108, 818455, 126739, -3888450]], ![![615720, -1407303, 644109, 99738, -3060185]]]
  g := ![![![-213, -283, -95, -78, 334], ![9908, 12107, 5449, 981, -13576], ![-29894, -35682, -17183, -1023, 39490], ![-84640, -104442, -45727, -10550, 117656], ![-13650, -16539, -7632, -1026, 18457]]]
  hle1 := by decide   
  hle2 := by decide  


def P67P0 : CertificateIrreducibleZModOfList' 67 3 2 6 [2, 25, 62, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [22, 50, 58], [50, 16, 9], [0, 1]]
 g := ![![[56, 54, 65], [17, 29, 25], [27, 56], [], [5, 1], []], ![[23, 13, 50, 41], [53, 55, 61, 34], [43, 17], [66, 16], [62, 55], [41, 14]], ![[64, 63, 40, 10], [32, 66, 7, 25], [12, 55], [55, 16], [42, 21], [23, 14]]]
 h' := ![![[22, 50, 58], [33, 15, 20], [30, 23, 62], [33, 61, 49], [57, 7], [0, 0, 1], [0, 1]], ![[50, 16, 9], [28, 39, 51], [0, 38, 48], [35, 25, 34], [10, 15, 4], [0, 8, 16], [22, 50, 58]], ![[0, 1], [15, 13, 63], [32, 6, 24], [49, 48, 51], [5, 45, 63], [42, 59, 50], [50, 16, 9]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [17, 10], []]
 b := ![[], [32, 9, 16], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI67N0 : CertifiedPrimeIdeal' SI67N0 67 where
  n := 3
  hpos := by decide
  P := [2, 25, 62, 1]
  hirr := P67P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![353980522, -362036840, -83375220, -59293829, -332627880]
  a := ![99, -397, 273, 62, -1053]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![302381474, 308056564, 189287629, -59293829, -332627880]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI67N0 : Ideal.IsPrime I67N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI67N0 B_one_repr
lemma NI67N0 : Nat.card (O ⧸ I67N0) = 300763 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI67N0

def I67N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-4333419, 9898380, -4531015, -701657, 21526344]] i)))

def SI67N1: IdealEqSpanCertificate' Table ![![-4333419, 9898380, -4531015, -701657, 21526344]] 
 ![![67, 0, 0, 0, 0], ![12, 1, 0, 0, 0], ![57, 0, 1, 0, 0], ![59, 0, 0, 1, 0], ![42, 0, 0, 0, 1]] where
  M :=![![![-4333419, 9898380, -4531015, -701657, 21526344], ![-27616234, 63078829, -28874904, -4471504, 137181078], ![-175989068, 401977882, -184008835, -28495160, 874203156], ![-432500620, 987877890, -452209994, -70028195, 2148393300], ![-71705616, 163783200, -74973184, -11610166, 356188285]]]
  hmulB := by decide  
  f := ![![![631503, -892792, -9821, 177835, -742848]], ![![76886, 16573, -132498, -3094, 332826]], ![![374293, -1075682, 567014, 213361, -2286888]], ![![1149887, -2435038, 830461, 483696, -4087368]], ![![399474, -763780, 202390, 151808, -1142363]]]
  g := ![![![-10859027, 9898380, -4531015, -701657, 21526344], ![-69201182, 63078829, -28874904, -4471504, 137181078], ![-440993107, 401977882, -184008835, -28495160, 874203156], ![-1083760011, 987877890, -452209994, -70028195, 2148393300], ![-179679712, 163783200, -74973184, -11610166, 356188285]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI67N1 : Nat.card (O ⧸ I67N1) = 67 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI67N1)

lemma isPrimeI67N1 : Ideal.IsPrime I67N1 := prime_ideal_of_norm_prime hp67.out _ NI67N1

def I67N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![77, -9, -104, 2, 242]] i)))

def SI67N2: IdealEqSpanCertificate' Table ![![77, -9, -104, 2, 242]] 
 ![![67, 0, 0, 0, 0], ![47, 1, 0, 0, 0], ![2, 0, 1, 0, 0], ![14, 0, 0, 1, 0], ![46, 0, 0, 0, 1]] where
  M :=![![![77, -9, -104, 2, 242], ![-528, 1705, -995, -338, 3856], ![-276, -7136, 7894, 1409, -25108], ![6314, -11356, 2449, 2258, -15638], ![406, -2658, 2178, 526, -7519]]]
  hmulB := by decide  
  f := ![![![-4111, -811, 5922, 1787, -24040]], ![![-2753, -436, 3862, 1172, -15646]], ![![-764, 236, 706, 237, -2754]], ![![-1062, 1018, 305, 168, -880]], ![![-3072, -446, 4262, 1296, -17255]]]
  g := ![![![-156, -9, -104, 2, 242], ![-3751, 1705, -995, -338, 3856], ![21710, -7136, 7894, 1409, -25108], ![18252, -11356, 2449, 2258, -15638], ![6858, -2658, 2178, 526, -7519]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI67N2 : Nat.card (O ⧸ I67N2) = 67 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI67N2)

lemma isPrimeI67N2 : Ideal.IsPrime I67N2 := prime_ideal_of_norm_prime hp67.out _ NI67N2
def MulI67N0 : IdealMulLeCertificate' Table 
  ![![-335, 477, -11, -78, 334]] ![![-4333419, 9898380, -4531015, -701657, 21526344]]
  ![![4111, 811, -5922, -1787, 24040]] where
 M := ![![![4111, 811, -5922, -1787, 24040]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI67N1 : IdealMulLeCertificate' Table 
  ![![4111, 811, -5922, -1787, 24040]] ![![77, -9, -104, 2, 242]]
  ![![67, 0, 0, 0, 0]] where
 M := ![![![-67, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC67 : ContainsPrimesAboveP 67 ![I67N0, I67N1, I67N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI67N0
    exact isPrimeI67N1
    exact isPrimeI67N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 67 (by decide) (𝕀 ⊙ MulI67N0 ⊙ MulI67N1)
instance hp71 : Fact (Nat.Prime 71) := {out := by norm_num}

def I71N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-2879167, 6193787, -2874874, -448160, 13615752]] i)))

def SI71N0: IdealEqSpanCertificate' Table ![![-2879167, 6193787, -2874874, -448160, 13615752]] 
 ![![71, 0, 0, 0, 0], ![0, 71, 0, 0, 0], ![17, 32, 1, 0, 0], ![61, 30, 0, 1, 0], ![28, 56, 0, 0, 1]] where
  M :=![![![-2879167, 6193787, -2874874, -448160, 13615752], ![-17371984, 39377265, -18056587, -2798542, 85751088], ![-109934252, 250862848, -114859438, -17788715, 545656404], ![-269965110, 616486700, -282217051, -43704578, 1340762250], ![-44744302, 102207822, -46785816, -7245088, 222274363]]]
  hmulB := by decide  
  f := ![![![-347807, 889341, -411360, -176491, 1752642]], ![![377518, -5363163, 5056084, 1060303, -16761906]], ![![230493, -2301263, 2066922, 455122, -6945660]], ![![-360649, -535871, 1101697, 105011, -3109134]], ![![180182, -3831044, 3745688, 757192, -12295661]]]
  g := ![![![-4336755, -9166867, -2874874, -448160, 13615752], ![-27334217, -57759389, -18056587, -2798542, 85751088], ![-173951993, -367559610, -114859438, -17788715, 545656404], ![-427431535, -903156568, -282217051, -43704578, 1340762250], ![-70860806, -149727574, -46785816, -7245088, 222274363]]]
  hle1 := by decide   
  hle2 := by decide  


def P71P0 : CertificateIrreducibleZModOfList' 71 2 2 6 [36, 8, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [63, 70], [0, 1]]
 g := ![![[16, 2], [50, 24], [40, 5], [49], [64], [1]], ![[0, 69], [0, 47], [0, 66], [49], [64], [1]]]
 h' := ![![[63, 70], [46, 59], [51, 33], [65, 17], [57, 64], [35, 63], [0, 1]], ![[0, 1], [0, 12], [0, 38], [0, 54], [42, 7], [28, 8], [63, 70]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [32]]
 b := ![[], [64, 16]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI71N0 : CertifiedPrimeIdeal' SI71N0 71 where
  n := 2
  hpos := by decide
  P := [36, 8, 1]
  hirr := P71P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-204757, 443682, -173637, -51768, 881982]
  a := ![-97, 327, -267, -60, 1032]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-264656, -589266, -173637, -51768, 881982]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI71N0 : Ideal.IsPrime I71N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI71N0 B_one_repr
lemma NI71N0 : Nat.card (O ⧸ I71N0) = 5041 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI71N0

def I71N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![11, -14, 19, 3, -60]] i)))

def SI71N1: IdealEqSpanCertificate' Table ![![11, -14, 19, 3, -60]] 
 ![![71, 0, 0, 0, 0], ![3, 1, 0, 0, 0], ![62, 0, 1, 0, 0], ![6, 0, 0, 1, 0], ![51, 0, 0, 0, 1]] where
  M :=![![![11, -14, 19, 3, -60], ![54, -85, 24, 18, -138], ![-120, 810, -655, -162, 2280], ![-372, 38, 524, -7, -1236], ![-60, 208, -128, -42, 491]]]
  hmulB := by decide  
  f := ![![![-67787, 154846, -70883, -10977, 336756]], ![![-8949, 20441, -9357, -1449, 44454]], ![![-97970, 223786, -102441, -15864, 486684]], ![![-101022, 230746, -105626, -16357, 501816]], ![![-64491, 147314, -67435, -10443, 320375]]]
  g := ![![![27, -14, 19, 3, -60], ![81, -85, 24, 18, -138], ![-1088, 810, -655, -162, 2280], ![424, 38, 524, -7, -1236], ![-247, 208, -128, -42, 491]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N1 : Nat.card (O ⧸ I71N1) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N1)

lemma isPrimeI71N1 : Ideal.IsPrime I71N1 := prime_ideal_of_norm_prime hp71.out _ NI71N1

def I71N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-1801, -321, 806, 9, -1800]] i)))

def SI71N2: IdealEqSpanCertificate' Table ![![-1801, -321, 806, 9, -1800]] 
 ![![71, 0, 0, 0, 0], ![10, 1, 0, 0, 0], ![42, 0, 1, 0, 0], ![16, 0, 0, 1, 0], ![34, 0, 0, 0, 1]] where
  M :=![![![-1801, -321, 806, 9, -1800], ![3402, -11809, 5524, 2301, -23094], ![-4434, 67326, -65318, -13341, 215118], ![-47056, 59864, 6885, -11954, 34992], ![-4394, 21488, -15902, -4254, 56677]]]
  hmulB := by decide  
  f := ![![![89767, -913071, 798700, 183414, -3513906]], ![![54794, -196957, 128769, 25998, -583308]], ![![226254, -1013802, 731338, 155181, -3277512]], ![![534850, -1334308, 671369, 113470, -3144942]], ![![114312, -629932, 486690, 106482, -2166023]]]
  g := ![![![403, -321, 806, 9, -1800], ![8984, -11809, 5524, 2301, -23094], ![-70914, 67326, -65318, -13341, 215118], ![-27230, 59864, 6885, -11954, 34992], ![-19864, 21488, -15902, -4254, 56677]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N2 : Nat.card (O ⧸ I71N2) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N2)

lemma isPrimeI71N2 : Ideal.IsPrime I71N2 := prime_ideal_of_norm_prime hp71.out _ NI71N2

def I71N3 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-154029373, -61431283, 250339684, 73628553, -1025547036]] i)))

def SI71N3: IdealEqSpanCertificate' Table ![![-154029373, -61431283, 250339684, 73628553, -1025547036]] 
 ![![71, 0, 0, 0, 0], ![26, 1, 0, 0, 0], ![34, 0, 1, 0, 0], ![48, 0, 0, 1, 0], ![3, 0, 0, 0, 1]] where
  M :=![![![-154029373, -61431283, 250339684, 73628553, -1025547036], ![431265906, 172001075, -700924556, -206152137, 2871422898], ![-1207498782, -481584762, 1962514396, 577204113, -8039679486], ![724456568, 288933828, -1177439237, -346302056, 4823523384], ![-459862982, -183406400, 747402594, 219822006, -3061825847]]]
  hmulB := by decide  
  f := ![![![-521, -10849, 12276, 2148, -38850]], ![![238, -4601, 4513, 912, -14808]], ![![-1846, 2782, -92, -549, 2604]], ![![-3454, -9068, 14759, 1792, -43278]], ![![-659, 1425, -502, -282, 2431]]]
  g := ![![![-105998517, -61431283, 250339684, 73628553, -1025547036], ![296784602, 172001075, -700924556, -206152137, 2871422898], ![-830965400, -481584762, 1962514396, 577204113, -8039679486], ![498549854, 288933828, -1177439237, -346302056, 4823523384], ![-316464275, -183406400, 747402594, 219822006, -3061825847]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI71N3 : Nat.card (O ⧸ I71N3) = 71 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI71N3)

lemma isPrimeI71N3 : Ideal.IsPrime I71N3 := prime_ideal_of_norm_prime hp71.out _ NI71N3
def MulI71N0 : IdealMulLeCertificate' Table 
  ![![-2879167, 6193787, -2874874, -448160, 13615752]] ![![11, -14, 19, 3, -60]]
  ![![-2451059, 234839, -662911, -144211, 2554686]] where
 M := ![![![-2451059, 234839, -662911, -144211, 2554686]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI71N1 : IdealMulLeCertificate' Table 
  ![![-2451059, 234839, -662911, -144211, 2554686]] ![![-1801, -321, 806, 9, -1800]]
  ![![3713329443, -355524334, 1004208273, 218464709, -3869847054]] where
 M := ![![![3713329443, -355524334, 1004208273, 218464709, -3869847054]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI71N2 : IdealMulLeCertificate' Table 
  ![![3713329443, -355524334, 1004208273, 218464709, -3869847054]] ![![-154029373, -61431283, 250339684, 73628553, -1025547036]]
  ![![71, 0, 0, 0, 0]] where
 M := ![![![3070504411, -293938793, 830214715, 180602558, -3199308564]]]
 hmul := by decide  
 g := ![![![![43246541, -4139983, 11693165, 2543698, -45060684]]]]
 hle2 := by decide  


def PBC71 : ContainsPrimesAboveP 71 ![I71N0, I71N1, I71N2, I71N3] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI71N0
    exact isPrimeI71N1
    exact isPrimeI71N2
    exact isPrimeI71N3
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 71 (by decide) (𝕀 ⊙ MulI71N0 ⊙ MulI71N1 ⊙ MulI71N2)
instance hp73 : Fact (Nat.Prime 73) := {out := by norm_num}

def I73N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![82923527, -7939324, 22425290, 4878604, -86418768]] i)))

def SI73N0: IdealEqSpanCertificate' Table ![![82923527, -7939324, 22425290, 4878604, -86418768]] 
 ![![73, 0, 0, 0, 0], ![0, 73, 0, 0, 0], ![0, 0, 73, 0, 0], ![36, 31, 16, 1, 0], ![7, 43, 18, 0, 1]] where
  M :=![![![82923527, -7939324, 22425290, 4878604, -86418768], ![65508248, -6271929, 17715614, 3854018, -68269416], ![51750436, -4954664, 13995023, 3044608, -53931612], ![30877428, -2956132, 8350232, 1816591, -32178636], ![-1529200, 146436, -413556, -89968, 1593703]]]
  hmulB := by decide  
  f := ![![![-265, 60, 270, 76, -1128]], ![![584, -345, -334, -178, 1992]], ![![-68, -3128, 2879, 1312, -13764]], ![![96, -667, 494, 217, -2268]], ![![297, -971, 546, 230, -2369]]]
  g := ![![![7016783, 48723712, 20546650, 4878604, -86418768], ![5543144, 38490937, 16231518, 3854018, -68269416], ![4378984, 30407148, 12822607, 3044608, -53931612], ![2612748, 18142615, 7650688, 1816591, -32178636], ![-129401, -898545, -378914, -89968, 1593703]]]
  hle1 := by decide   
  hle2 := by decide  


def P73P0 : CertificateIrreducibleZModOfList' 73 3 2 6 [7, 55, 30, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [2, 29, 65], [41, 43, 8], [0, 1]]
 g := ![![[31, 66, 49], [8, 61], [23, 36], [3, 47, 12], [43, 1], []], ![[66, 53, 56, 64], [20, 3], [46, 6], [33, 16, 7, 2], [11, 24], [25, 64]], ![[33, 48, 22, 49], [51, 23], [15, 8], [4, 60, 69, 41], [46, 38], [9, 64]]]
 h' := ![![[2, 29, 65], [15, 5, 66], [61, 61, 39], [52, 25, 6], [64, 37, 42], [0, 0, 1], [0, 1]], ![[41, 43, 8], [54, 49, 24], [11, 20, 21], [25, 46, 58], [37, 43, 50], [48, 45, 43], [2, 29, 65]], ![[0, 1], [63, 19, 56], [37, 65, 13], [54, 2, 9], [41, 66, 54], [12, 28, 29], [41, 43, 8]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [27, 16], []]
 b := ![[], [52, 43, 2], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI73N0 : CertifiedPrimeIdeal' SI73N0 73 where
  n := 3
  hpos := by decide
  P := [7, 55, 30, 1]
  hirr := P73P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![7750207, -4139030, -5583330, -2461660, 4305994]
  a := ![30, -122, 83, 19, -319]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![907233, -1547744, -598694, -2461660, 4305994]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI73N0 : Ideal.IsPrime I73N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI73N0 B_one_repr
lemma NI73N0 : Nat.card (O ⧸ I73N0) = 389017 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI73N0

def I73N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-265, 60, 270, 76, -1128]] i)))

def SI73N1: IdealEqSpanCertificate' Table ![![-265, 60, 270, 76, -1128]] 
 ![![73, 0, 0, 0, 0], ![0, 73, 0, 0, 0], ![45, 24, 1, 0, 0], ![20, 50, 0, 1, 0], ![44, 0, 0, 0, 1]] where
  M :=![![![-265, 60, 270, 76, -1128], ![584, -345, -334, -178, 1992], ![-68, -3128, 2879, 1312, -13764], ![-468, 9892, -9368, -2369, 33516], ![-352, -164, 508, 296, -2945]]]
  hmulB := by decide  
  f := ![![![82923527, -7939324, 22425290, 4878604, -86418768]], ![![65508248, -6271929, 17715614, 3854018, -68269416]], ![![73363111, -7023980, 19839833, 4316140, -76455372]], ![![68010416, -6511494, 18392284, 4001227, -70877052]], ![![49960356, -4783340, 13510948, 2939296, -52066193]]]
  g := ![![![489, -140, 270, 76, -1128], ![-938, 227, -334, -178, 1992], ![6161, -1888, 2879, 1312, -13764], ![-13784, 4838, -9368, -2369, 33516], ![1376, -372, 508, 296, -2945]]]
  hle1 := by decide   
  hle2 := by decide  


def P73P1 : CertificateIrreducibleZModOfList' 73 2 2 6 [67, 63, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [10, 72], [0, 1]]
 g := ![![[26, 12], [19], [69], [17, 41], [27], [1]], ![[0, 61], [19], [69], [62, 32], [27], [1]]]
 h' := ![![[10, 72], [18, 42], [14, 26], [29, 54], [52, 25], [6, 10], [0, 1]], ![[0, 1], [0, 31], [55, 47], [58, 19], [10, 48], [33, 63], [10, 72]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [40]]
 b := ![[], [46, 20]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI73N1 : CertifiedPrimeIdeal' SI73N1 73 where
  n := 2
  hpos := by decide
  P := [67, 63, 1]
  hirr := P73P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-407045, 666312, -122693, -62142, 987660]
  a := ![-113, 472, -311, -72, 1202]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-508220, 92028, -122693, -62142, 987660]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI73N1 : Ideal.IsPrime I73N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI73N1 B_one_repr
lemma NI73N1 : Nat.card (O ⧸ I73N1) = 5329 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI73N1
def MulI73N0 : IdealMulLeCertificate' Table 
  ![![82923527, -7939324, 22425290, 4878604, -86418768]] ![![-265, 60, 270, 76, -1128]]
  ![![73, 0, 0, 0, 0]] where
 M := ![![![73, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC73 : ContainsPrimesAboveP 73 ![I73N0, I73N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI73N0
    exact isPrimeI73N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 73 (by decide) (𝕀 ⊙ MulI73N0)
instance hp79 : Fact (Nat.Prime 79) := {out := by norm_num}

def I79N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![1219091, -2789051, 1279142, 198466, -6075254]] i)))

def SI79N0: IdealEqSpanCertificate' Table ![![1219091, -2789051, 1279142, 198466, -6075254]] 
 ![![79, 0, 0, 0, 0], ![0, 79, 0, 0, 0], ![0, 0, 79, 0, 0], ![6, 22, 64, 1, 0], ![23, 70, 61, 0, 1]] where
  M :=![![![1219091, -2789051, 1279142, 198466, -6075254], ![7784256, -17767425, 8126397, 1257368, -38612512], ![49562928, -113242432, 51856778, 8033407, -246351056], ![121843362, -278282008, 127374655, 19723150, -605149534], ![20194434, -46139730, 21128126, 3272990, -100371749]]]
  hmulB := by decide  
  f := ![![![2303, -1581, 2260, 409, -7544]], ![![6090, -6969, 1386, 1463, -9910]], ![![-12366, 75374, -57958, -14861, 203602]], ![![-8538, 58904, -45689, -11582, 159824]], ![![-3557, 51799, -43000, -10106, 146757]]]
  g := ![![![1769103, 5292563, 4546428, 198466, -6075254], ![11244656, 33638561, 28898963, 1257368, -38612512], ![71739706, 214615146, 184368774, 8033407, -246351056], ![176227136, 527193368, 452901451, 19723150, -605149534], ![29229199, 87441480, 75118145, 3272990, -100371749]]]
  hle1 := by decide   
  hle2 := by decide  


def P79P0 : CertificateIrreducibleZModOfList' 79 3 2 6 [43, 9, 38, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 1, 0, 0, 1]
 hbits := by decide
 h := ![[0, 1], [0, 18, 43], [41, 60, 36], [0, 1]]
 g := ![![[0, 0, 22], [19, 37, 2], [25, 44, 22], [67, 9, 11], [41, 1], []], ![[56, 4, 43, 30], [43, 63, 36, 14], [39, 62, 47, 12], [12, 47, 69, 69], [39, 45], [16, 32]], ![[21, 10, 27, 4], [18, 69, 58, 26], [0, 28, 73, 36], [3, 54, 34, 55], [64, 8], [23, 32]]]
 h' := ![![[0, 18, 43], [52, 68, 41], [31, 42, 70], [42, 30, 41], [54, 62, 13], [0, 0, 1], [0, 1]], ![[41, 60, 36], [47, 50, 12], [61, 58, 2], [37, 77, 37], [37, 0, 49], [23, 60, 60], [0, 18, 43]], ![[0, 1], [7, 40, 26], [28, 58, 7], [19, 51, 1], [58, 17, 17], [60, 19, 18], [41, 60, 36]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [68, 77], []]
 b := ![[], [62, 64, 57], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI79N0 : CertifiedPrimeIdeal' SI79N0 79 where
  n := 3
  hpos := by decide
  P := [43, 9, 38, 1]
  hirr := P79P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![586698379, -222432584, -505118882, -229442541, 559232724]
  a := ![135, -541, 372, 87, -1436]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-137962013, -434442878, -252329018, -229442541, 559232724]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI79N0 : Ideal.IsPrime I79N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI79N0 B_one_repr
lemma NI79N0 : Nat.card (O ⧸ I79N0) = 493039 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI79N0

def I79N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![9095067, -20785123, 9513435, 1473143, -45198366]] i)))

def SI79N1: IdealEqSpanCertificate' Table ![![9095067, -20785123, 9513435, 1473143, -45198366]] 
 ![![79, 0, 0, 0, 0], ![16, 1, 0, 0, 0], ![60, 0, 1, 0, 0], ![16, 0, 0, 1, 0], ![10, 0, 0, 0, 1]] where
  M :=![![![9095067, -20785123, 9513435, 1473143, -45198366], ![57987586, -132458545, 60633183, 9389446, -288061662], ![369555512, -844111138, 386398714, 59836751, -1835732904], ![908204266, -2074439654, 949592889, 147051710, -4511397942], ![150574290, -343927558, 157435938, 24380164, -747958501]]]
  hmulB := by decide  
  f := ![![![-34197, -670459, 753951, 132350, -2388444]], ![![16684, -170195, 153408, 33657, -514980]], ![![-114226, -70096, 244516, 13571, -648078]], ![![-176012, -237450, 512439, 46492, -1436028]], ![![-39360, 18358, 39696, -3720, -79681]]]
  g := ![![![2522333, -20785123, 9513435, 1473143, -45198366], ![16072390, -132458545, 60633183, 9389446, -288061662], ![102422176, -844111138, 386398714, 59836751, -1835732904], ![251706550, -2074439654, 949592889, 147051710, -4511397942], ![41731156, -343927558, 157435938, 24380164, -747958501]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI79N1 : Nat.card (O ⧸ I79N1) = 79 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI79N1)

lemma isPrimeI79N1 : Ideal.IsPrime I79N1 := prime_ideal_of_norm_prime hp79.out _ NI79N1

def I79N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-438851, 42004, -118675, -25818, 457324]] i)))

def SI79N2: IdealEqSpanCertificate' Table ![![-438851, 42004, -118675, -25818, 457324]] 
 ![![79, 0, 0, 0, 0], ![28, 1, 0, 0, 0], ![6, 0, 1, 0, 0], ![25, 0, 0, 1, 0], ![68, 0, 0, 0, 1]] where
  M :=![![![-438851, 42004, -118675, -25818, 457324], ![-346652, 33109, -93719, -20391, 361124], ![-273646, 25684, -73817, -16074, 284242], ![-162834, 14326, -43590, -9521, 167438], ![8188, -994, 2290, 492, -8915]]]
  hmulB := by decide  
  f := ![![![1825, -17588, 15701, 3480, -52862]], ![![1016, -6349, 5133, 1257, -17796]], ![![-2260, 6748, -3689, -1338, 14662]], ![![-923, -13318, 15341, 2629, -48324]], ![![852, -13682, 13064, 2706, -43167]]]
  g := ![![![-396905, 42004, -118675, -25818, 457324], ![-313393, 33109, -93719, -20391, 361124], ![-246538, 25684, -73817, -16074, 284242], ![-144939, 14326, -43590, -9521, 167438], ![7800, -994, 2290, 492, -8915]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI79N2 : Nat.card (O ⧸ I79N2) = 79 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI79N2)

lemma isPrimeI79N2 : Ideal.IsPrime I79N2 := prime_ideal_of_norm_prime hp79.out _ NI79N2
def MulI79N0 : IdealMulLeCertificate' Table 
  ![![1219091, -2789051, 1279142, 198466, -6075254]] ![![9095067, -20785123, 9513435, 1473143, -45198366]]
  ![![-412458033429789, 942098203802974, -431253882638338, -66782971219887, 2048833458046370]] where
 M := ![![![-412458033429789, 942098203802974, -431253882638338, -66782971219887, 2048833458046370]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI79N1 : IdealMulLeCertificate' Table 
  ![![-412458033429789, 942098203802974, -431253882638338, -66782971219887, 2048833458046370]] ![![-438851, 42004, -118675, -25818, 457324]]
  ![![79, 0, 0, 0, 0]] where
 M := ![![![88680542541187057, -202555831149457124, 92721744184547045, 14358673215852747, -440509452584939712]]]
 hmul := by decide  
 g := ![![![![1122538513179583, -2563997862651356, 1173692964361355, 181755357162693, -5576069020062528]]]]
 hle2 := by decide  


def PBC79 : ContainsPrimesAboveP 79 ![I79N0, I79N1, I79N2] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI79N0
    exact isPrimeI79N1
    exact isPrimeI79N2
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 79 (by decide) (𝕀 ⊙ MulI79N0 ⊙ MulI79N1)
instance hp83 : Fact (Nat.Prime 83) := {out := by norm_num}

def I83N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-373, 562, -80, -113, 684]] i)))

def SI83N0: IdealEqSpanCertificate' Table ![![-373, 562, -80, -113, 684]] 
 ![![83, 0, 0, 0, 0], ![0, 83, 0, 0, 0], ![0, 0, 83, 0, 0], ![0, 0, 0, 83, 0], ![27, 53, 79, 40, 1]] where
  M :=![![![-373, 562, -80, -113, 684], ![1118, -6213, 4799, 1229, -16866], ![6694, 8074, -18517, -1580, 51462], ![-20490, 61500, -33798, -12197, 134070], ![152, 6674, -7222, -1318, 23095]]]
  hmulB := by decide  
  f := ![![![-89, -58, 164, 47, -678]], ![![322, -21, -377, -119, 1506]], ![![-394, -1114, 1591, 416, -6762]], ![![1326, -1824, 186, -73, -1362]], ![![439, -1977, 1424, 302, -6383]]]
  g := ![![![-227, -430, -652, -331, 684], ![5500, 10695, 16111, 8143, -16866], ![-16660, -32764, -49205, -24820, 51462], ![-43860, -84870, -128016, -64759, 134070], ![-7511, -14667, -22069, -11146, 23095]]]
  hle1 := by decide   
  hle2 := by decide  


def P83P0 : CertificateIrreducibleZModOfList' 83 4 2 6 [36, 4, 19, 80, 1] where
 m := 1
 P := ![2]
 exp := ![2]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 0, 0, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [28, 2, 55, 65], [19, 44, 64, 24], [39, 36, 47, 77], [0, 1]]
 g := ![![[73, 9, 73, 51], [73, 12, 30, 49], [50, 3, 61], [37, 26, 17], [3, 1], []], ![[81, 48, 77, 21, 77, 68], [4, 58, 26, 15, 57, 69], [28, 7, 27], [6, 58, 61], [32, 59, 12, 55, 34, 78], [81, 71, 75]], ![[50, 27, 54, 12, 20, 80], [8, 16, 81, 42, 8, 5], [23, 31, 11], [59, 15, 59], [21, 7, 20, 13, 48, 22], [36, 69, 78]], ![[42, 33, 68, 11, 32, 9], [3, 24, 58, 58, 43, 40], [12, 79, 9], [14, 16, 41], [44, 25, 10, 49, 7, 65], [57, 42, 36]]]
 h' := ![![[28, 2, 55, 65], [28, 17, 45, 36], [49, 60, 38, 76], [40, 71, 34, 12], [58, 35, 22, 73], [0, 0, 1], [0, 1]], ![[19, 44, 64, 24], [16, 24, 7, 53], [56, 55, 78, 33], [63, 58, 48, 39], [14, 36, 64, 71], [26, 54, 55, 47], [28, 2, 55, 65]], ![[39, 36, 47, 77], [66, 80, 45, 60], [43, 38, 11, 15], [46, 37, 20, 29], [57, 53, 22, 68], [61, 40, 19, 49], [19, 44, 64, 24]], ![[0, 1], [21, 45, 69, 17], [52, 13, 39, 42], [22, 0, 64, 3], [51, 42, 58, 37], [50, 72, 8, 70], [39, 36, 47, 77]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [], [14, 57, 61], []]
 b := ![[], [], [74, 23, 42, 77], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI83N0 : CertifiedPrimeIdeal' SI83N0 83 where
  n := 4
  hpos := by decide
  P := [36, 4, 19, 80, 1]
  hirr := P83P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-6922142807060, 14511485110704, -5993510460416, -633137535472, 30667825203912]
  a := ![132, -528, 368, 74, -1404]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-10059679798948, -19408231936104, -29262068693608, -14787302960144, 30667825203912]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI83N0 : Ideal.IsPrime I83N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI83N0 B_one_repr
lemma NI83N0 : Nat.card (O ⧸ I83N0) = 47458321 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI83N0

def I83N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![89, 58, -164, -47, 678]] i)))

def SI83N1: IdealEqSpanCertificate' Table ![![89, 58, -164, -47, 678]] 
 ![![83, 0, 0, 0, 0], ![5, 1, 0, 0, 0], ![58, 0, 1, 0, 0], ![61, 0, 0, 1, 0], ![28, 0, 0, 0, 1]] where
  M :=![![![89, 58, -164, -47, 678], ![-322, 21, 377, 119, -1506], ![394, 1114, -1591, -416, 6762], ![-1326, 1824, -186, 73, 1362], ![140, 446, -616, -160, 2623]]]
  hmulB := by decide  
  f := ![![![373, -562, 80, 113, -684]], ![![9, 41, -53, -8, 162]], ![![180, -490, 279, 98, -1098]], ![![521, -1154, 466, 230, -2118]], ![![124, -270, 114, 54, -509]]]
  g := ![![![-82, 58, -164, -47, 678], ![152, 21, 377, 119, -1506], ![-926, 1114, -1591, -416, 6762], ![-509, 1824, -186, 73, 1362], ![-362, 446, -616, -160, 2623]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI83N1 : Nat.card (O ⧸ I83N1) = 83 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI83N1)

lemma isPrimeI83N1 : Ideal.IsPrime I83N1 := prime_ideal_of_norm_prime hp83.out _ NI83N1
def MulI83N0 : IdealMulLeCertificate' Table 
  ![![-373, 562, -80, -113, 684]] ![![89, 58, -164, -47, 678]]
  ![![83, 0, 0, 0, 0]] where
 M := ![![![-83, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![-1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC83 : ContainsPrimesAboveP 83 ![I83N0, I83N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI83N0
    exact isPrimeI83N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 83 (by decide) (𝕀 ⊙ MulI83N0)
instance hp89 : Fact (Nat.Prime 89) := {out := by norm_num}

def I89N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-44239, 79788, -25158, -2112, 127896]] i)))

def SI89N0: IdealEqSpanCertificate' Table ![![-44239, 79788, -25158, -2112, 127896]] 
 ![![89, 0, 0, 0, 0], ![0, 89, 0, 0, 0], ![0, 0, 89, 0, 0], ![61, 76, 53, 1, 0], ![44, 0, 1, 0, 1]] where
  M :=![![![-44239, 79788, -25158, -2112, 127896], ![-209328, 537281, -277806, -48018, 1296336], ![-1536276, 3343104, -1441159, -209184, 6912492], ![-3586404, 8291196, -3848880, -604423, 18246108], ![-624288, 1362780, -589860, -86016, 2827385]]]
  hmulB := by decide  
  f := ![![![2977, 17652, -22962, -3480, 70368]], ![![-64176, 118945, -28578, -23646, 170832]], ![![178548, -1120032, 906601, 221664, -3141516]], ![![59501, -554380, 491971, 109649, -1658904]], ![![4432, -7116, 821, 1416, -8083]]]
  g := ![![![-62279, 2700, -462, -2112, 127896], ![-610326, 47041, 10908, -48018, 1296336], ![-3291300, 216192, 30709, -209184, 6912492], ![-8646577, 609296, 111679, -604423, 18246108], ![-1345868, 88764, 12827, -86016, 2827385]]]
  hle1 := by decide   
  hle2 := by decide  


def P89P0 : CertificateIrreducibleZModOfList' 89 3 2 6 [50, 20, 38, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [59, 69, 71], [81, 19, 18], [0, 1]]
 g := ![![[54, 52, 17], [82, 1], [42, 50], [66, 80, 4], [0, 51, 1], []], ![[31, 1, 61, 4], [87, 49], [33, 42], [71, 28, 36, 50], [37, 28, 56, 88], [67, 57]], ![[69, 78, 22, 1], [18, 64], [42, 55], [3, 18, 70, 36], [14, 21, 42, 80], [31, 57]]]
 h' := ![![[59, 69, 71], [10, 36, 27], [85, 29, 88], [82, 20, 53], [0, 31, 87], [0, 0, 1], [0, 1]], ![[81, 19, 18], [64, 74, 43], [63, 7, 82], [17, 84, 24], [54, 20, 27], [42, 36, 19], [59, 69, 71]], ![[0, 1], [6, 68, 19], [4, 53, 8], [18, 74, 12], [54, 38, 64], [27, 53, 69], [81, 19, 18]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [31, 14], []]
 b := ![[], [19, 4, 70], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI89N0 : CertifiedPrimeIdeal' SI89N0 89 where
  n := 3
  hpos := by decide
  P := [50, 20, 38, 1]
  hirr := P89P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-9407667260, 16344021240, -4421240453, -552820413, 29217677359]
  a := ![-226, 916, -624, -131, 2405]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-14171499167, 655712052, -48757707, -552820413, 29217677359]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI89N0 : Ideal.IsPrime I89N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI89N0 B_one_repr
lemma NI89N0 : Nat.card (O ⧸ I89N0) = 704969 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI89N0

def I89N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![2977, 17652, -22962, -3480, 70368]] i)))

def SI89N1: IdealEqSpanCertificate' Table ![![2977, 17652, -22962, -3480, 70368]] 
 ![![89, 0, 0, 0, 0], ![0, 89, 0, 0, 0], ![7, 18, 1, 0, 0], ![79, 19, 0, 1, 0], ![82, 5, 0, 0, 1]] where
  M :=![![![2977, 17652, -22962, -3480, 70368], ![-64176, 118945, -28578, -23646, 170832], ![178548, -1120032, 906601, 221664, -3141516], ![528324, -94716, -691824, 19945, 1582212], ![84912, -289980, 176796, 57480, -674063]]]
  hmulB := by decide  
  f := ![![![-44239, 79788, -25158, -2112, 127896]], ![![-209328, 537281, -277806, -48018, 1296336]], ![![-63077, 152502, -74357, -12228, 349908]], ![![-124253, 278683, -124884, -18917, 595284]], ![![-59534, 119009, -45414, -5610, 222433]]]
  g := ![![![-59905, 1632, -22962, -3480, 70368], ![-134880, 2567, -28578, -23646, 170832], ![2628373, -66774, 906601, 221664, -3141516], ![-1415123, 45709, -691824, 19945, 1582212], ![557074, -13417, 176796, 57480, -674063]]]
  hle1 := by decide   
  hle2 := by decide  


def P89P1 : CertificateIrreducibleZModOfList' 89 2 2 6 [75, 66, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 1, 1, 0, 1]
 hbits := by decide
 h := ![[0, 1], [23, 88], [0, 1]]
 g := ![![[8, 47], [78], [72], [86, 32], [84, 84], [1]], ![[21, 42], [78], [72], [21, 57], [58, 5], [1]]]
 h' := ![![[23, 88], [15, 74], [13, 16], [47, 28], [19, 11], [14, 23], [0, 1]], ![[0, 1], [26, 15], [25, 73], [68, 61], [5, 78], [9, 66], [23, 88]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [61]]
 b := ![[], [72, 75]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI89N1 : CertifiedPrimeIdeal' SI89N1 89 where
  n := 2
  hpos := by decide
  P := [75, 66, 1]
  hirr := P89P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-1224, 3720, -2414, -426, 10270]
  a := ![3, -16, 9, 0, -32]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-8908, 44, -2414, -426, 10270]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI89N1 : Ideal.IsPrime I89N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI89N1 B_one_repr
lemma NI89N1 : Nat.card (O ⧸ I89N1) = 7921 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI89N1
def MulI89N0 : IdealMulLeCertificate' Table 
  ![![-44239, 79788, -25158, -2112, 127896]] ![![2977, 17652, -22962, -3480, 70368]]
  ![![89, 0, 0, 0, 0]] where
 M := ![![![89, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC89 : ContainsPrimesAboveP 89 ![I89N0, I89N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI89N0
    exact isPrimeI89N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 89 (by decide) (𝕀 ⊙ MulI89N0)
instance hp97 : Fact (Nat.Prime 97) := {out := by norm_num}

def I97N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![3216983, -308033, 869996, 189269, -3352642]] i)))

def SI97N0: IdealEqSpanCertificate' Table ![![3216983, -308033, 869996, 189269, -3352642]] 
 ![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![0, 0, 97, 0, 0], ![27, 82, 43, 1, 0], ![23, 10, 93, 0, 1]] where
  M :=![![![3216983, -308033, 869996, 189269, -3352642], ![2541366, -243197, 687130, 149491, -2648042], ![2007282, -191678, 542890, 118007, -2091694], ![1198172, -116648, 325557, 70862, -1253924], ![-59390, 5668, -15932, -3488, 61547]]]
  hmulB := by decide  
  f := ![![![5477, -1757, -4978, -1678, 19388]], ![![-1860, -25859, 28027, 6880, -121220]], ![![91080, -123740, 11314, -5359, -87160]], ![![41645, -80733, 29219, 3311, -144518]], ![![88805, -122243, 12618, -4845, -91889]]]
  g := ![![![775438, 182457, 3139455, 189269, -3352642], ![612475, 144113, 2479659, 149491, -2648042], ![483815, 113904, 1958723, 118007, -2091694], ![289950, 68164, 1174159, 70862, -1253924], ![-14235, -3338, -57627, -3488, 61547]]]
  hle1 := by decide   
  hle2 := by decide  


def P97P0 : CertificateIrreducibleZModOfList' 97 3 2 6 [2, 0, 53, 1] where
 m := 1
 P := ![3]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [0, 95, 64], [44, 1, 33], [0, 1]]
 g := ![![[0, 13, 4], [46, 54], [86, 88], [95, 89], [18, 93], [1]], ![[75, 66, 23, 49], [59, 27], [30, 36], [18, 35], [79, 93], [95, 95, 31, 50]], ![[93, 51, 60, 53], [89, 61], [78, 11], [81, 4], [0, 81], [4, 93, 0, 47]]]
 h' := ![![[0, 95, 64], [86, 32, 2], [88, 3, 32], [58, 86, 31], [65, 8, 34], [95, 0, 44], [0, 1]], ![[44, 1, 33], [51, 42, 13], [13, 41, 30], [49, 16, 6], [52, 40, 61], [4, 4, 44], [0, 95, 64]], ![[0, 1], [66, 23, 82], [70, 53, 35], [41, 92, 60], [3, 49, 2], [10, 93, 9], [44, 1, 33]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [49], []]
 b := ![[], [0, 25], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI97N0 : CertifiedPrimeIdeal' SI97N0 97 where
  n := 3
  hpos := by decide
  P := [2, 0, 53, 1]
  hirr := P97P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-74741154, 91335956, -1955518, 17333871, 143469696]
  a := ![-64, 259, -173, -42, 681]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-39614007, -28502458, -145257667, 17333871, 143469696]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI97N0 : Ideal.IsPrime I97N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI97N0 B_one_repr
lemma NI97N0 : Nat.card (O ⧸ I97N0) = 912673 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI97N0

def I97N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![5477, -1757, -4978, -1678, 19388]] i)))

def SI97N1: IdealEqSpanCertificate' Table ![![5477, -1757, -4978, -1678, 19388]] 
 ![![97, 0, 0, 0, 0], ![0, 97, 0, 0, 0], ![67, 64, 1, 0, 0], ![48, 4, 0, 1, 0], ![79, 28, 0, 0, 1]] where
  M :=![![![5477, -1757, -4978, -1678, 19388], ![-1860, -25859, 28027, 6880, -121220], ![91080, -123740, 11314, -5359, -87160], ![127766, -342404, 183933, 32750, -853802], ![36274, -50750, 5968, -1784, -41077]]]
  hmulB := by decide  
  f := ![![![3216983, -308033, 869996, 189269, -3352642]], ![![2541366, -243197, 687130, 149491, -2648042]], ![![3919511, -375201, 1059886, 230582, -4084468]], ![![1709060, -163660, 462205, 100554, -1781164]], ![![3352995, -321015, 906736, 197263, -3494251]]]
  g := ![![![-11465, -2261, -4978, -1678, 19388], ![75943, 15949, 28027, 6880, -121220], ![66762, 16640, 11314, -5359, -87160], ![553429, 120220, 183933, 32750, -853802], ![30589, 7470, 5968, -1784, -41077]]]
  hle1 := by decide   
  hle2 := by decide  


def P97P1 : CertificateIrreducibleZModOfList' 97 2 2 6 [86, 88, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 0, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [9, 96], [0, 1]]
 g := ![![[89, 44], [4], [73], [24], [25], [9, 1]], ![[0, 53], [4], [73], [24], [25], [18, 96]]]
 h' := ![![[9, 96], [13, 74], [39, 95], [20, 49], [85, 11], [2, 92], [0, 1]], ![[0, 1], [0, 23], [21, 2], [73, 48], [87, 86], [54, 5], [9, 96]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [83]]
 b := ![[], [80, 90]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI97N1 : CertifiedPrimeIdeal' SI97N1 97 where
  n := 2
  hpos := by decide
  P := [86, 88, 1]
  hirr := P97P1
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-248491, 427580, -96852, -43330, 674750]
  a := ![-91, 366, -251, -58, 968]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-463761, -124676, -96852, -43330, 674750]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI97N1 : Ideal.IsPrime I97N1 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI97N1 B_one_repr
lemma NI97N1 : Nat.card (O ⧸ I97N1) = 9409 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI97N1
def MulI97N0 : IdealMulLeCertificate' Table 
  ![![3216983, -308033, 869996, 189269, -3352642]] ![![5477, -1757, -4978, -1678, 19388]]
  ![![97, 0, 0, 0, 0]] where
 M := ![![![97, 0, 0, 0, 0]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  


def PBC97 : ContainsPrimesAboveP 97 ![I97N0, I97N1] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI97N0
    exact isPrimeI97N1
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 97 (by decide) (𝕀 ⊙ MulI97N0)
instance hp101 : Fact (Nat.Prime 101) := {out := by norm_num}

def I101N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![101, 0, 0, 0, 0]] i)))

def SI101N0: IdealEqSpanCertificate' Table ![![101, 0, 0, 0, 0]] 
 ![![101, 0, 0, 0, 0], ![0, 101, 0, 0, 0], ![0, 0, 101, 0, 0], ![0, 0, 0, 101, 0], ![0, 0, 0, 0, 101]] where
  M :=![![![101, 0, 0, 0, 0], ![0, 101, 0, 0, 0], ![0, 0, 101, 0, 0], ![0, 0, 0, 101, 0], ![0, 0, 0, 0, 101]]]
  hmulB := by decide  
  f := ![![![1, 0, 0, 0, 0]], ![![0, 1, 0, 0, 0]], ![![0, 0, 1, 0, 0]], ![![0, 0, 0, 1, 0]], ![![0, 0, 0, 0, 1]]]
  g := ![![![1, 0, 0, 0, 0], ![0, 1, 0, 0, 0], ![0, 0, 1, 0, 0], ![0, 0, 0, 1, 0], ![0, 0, 0, 0, 1]]]
  hle1 := by decide   
  hle2 := by decide  


def P101P0 : CertificateIrreducibleZModOfList' 101 5 2 6 [95, 75, 41, 97, 80, 1] where
 m := 1
 P := ![5]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 0, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [12, 76, 57, 11, 78], [13, 79, 32, 57, 28], [29, 88, 65, 0, 46], [68, 59, 48, 33, 50], [0, 1]]
 g := ![![[2, 74, 96, 57, 58], [28, 35, 12, 96], [65, 73, 14, 22, 36], [41, 91, 43, 65], [21, 1], []], ![[8, 78, 16, 30, 13, 77, 44, 92], [41, 47, 31, 85], [26, 59, 35, 63, 98, 91, 74, 22], [89, 49, 78, 58], [54, 18, 63, 25], [2, 23, 6, 16, 88, 57, 7, 54]], ![[25, 72, 78, 4, 99, 27, 34, 40], [84, 29, 44, 30], [88, 42, 9, 18, 54, 8, 98, 86], [60, 97, 44, 33], [33, 96, 55, 17], [85, 83, 63, 74, 41, 23, 65, 35]], ![[87, 84, 59, 65, 87, 23, 9, 7], [83, 76, 0, 87], [82, 2, 0, 12, 69, 13, 65, 15], [0, 75, 32, 9], [44, 26, 13, 87], [38, 51, 33, 35, 60, 99, 18, 73]], ![[37, 29, 30, 65, 18, 12, 7, 90], [54, 47, 63, 85], [46, 82, 5, 4, 44, 31, 4, 26], [59, 43, 26, 82], [52, 81, 11, 14], [34, 91, 79, 55, 48, 66, 60, 63]]]
 h' := ![![[12, 76, 57, 11, 78], [61, 3, 86, 97, 82], [87, 37, 94, 13, 55], [63, 23, 85, 78, 95], [25, 47, 74, 43, 41], [0, 0, 0, 1], [0, 1]], ![[13, 79, 32, 57, 28], [64, 19, 53, 85, 20], [90, 65, 90, 21, 40], [34, 20, 87, 36, 18], [45, 70, 53, 30, 82], [23, 96, 4, 75, 5], [12, 76, 57, 11, 78]], ![[29, 88, 65, 0, 46], [32, 64, 26, 95, 54], [72, 50, 67, 21, 63], [20, 84, 74, 11, 88], [93, 15, 74, 1, 29], [81, 38, 13, 31, 44], [13, 79, 32, 57, 28]], ![[68, 59, 48, 33, 50], [16, 38, 100, 74, 73], [15, 69, 74, 27, 84], [87, 8, 97, 68, 8], [84, 13, 77, 43, 98], [74, 7, 96, 89, 84], [29, 88, 65, 0, 46]], ![[0, 1], [77, 78, 38, 53, 74], [37, 82, 79, 19, 61], [46, 67, 61, 9, 94], [46, 57, 25, 85, 53], [21, 61, 89, 6, 69], [68, 59, 48, 33, 50]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [89, 86, 58, 73], [], [], []]
 b := ![[], [53, 14, 77, 76, 91], [], [], []]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI101N0 : CertifiedPrimeIdeal' SI101N0 101 where
  n := 5
  hpos := by decide
  P := [95, 75, 41, 97, 80, 1]
  hirr := P101P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-9393059434008429, 23668354801999652, -12189700907787698, -1863293294594229, 54414764465597032]
  a := ![-111, 448, -307, -66, 1181]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![-93000588455529, 234340146554452, -120690107997898, -18448448461329, 538760044213832]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI101N0 : Ideal.IsPrime I101N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI101N0 B_one_repr
lemma NI101N0 : Nat.card (O ⧸ I101N0) = 10510100501 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI101N0

def PBC101 : ContainsPrimesAboveP 101 ![I101N0] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI101N0
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate (u := ![![101, 0, 0, 0, 0]]) timesTableT_eq_Table B_one_repr 101 (by decide) 𝕀

instance hp103 : Fact (Nat.Prime 103) := {out := by norm_num}

def I103N0 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![-14201, -5667, 23085, 6788, -94560]] i)))

def SI103N0: IdealEqSpanCertificate' Table ![![-14201, -5667, 23085, 6788, -94560]] 
 ![![103, 0, 0, 0, 0], ![0, 103, 0, 0, 0], ![86, 50, 1, 0, 0], ![3, 36, 0, 1, 0], ![59, 83, 0, 0, 1]] where
  M :=![![![-14201, -5667, 23085, 6788, -94560], ![39784, 15783, -64580, -18989, 264552], ![-111346, -43936, 180484, 53117, -739698], ![66492, 26942, -108427, -31984, 444636], ![-42422, -16768, 68798, 20236, -281887]]]
  hmulB := by decide  
  f := ![![![121927, -277799, 127237, 19709, -604410]], ![![775222, -1770141, 810355, 125494, -3849834]], ![![526074, -1200758, 549746, 85139, -2611680]], ![![392337, -895925, 410140, 63515, -1948500]], ![![714071, -1630174, 746314, 115579, -3545551]]]
  g := ![![![34555, 62565, 23085, 6788, -94560], ![-96679, -175043, -64580, -18989, 264552], ![270387, 489462, 180484, 53117, -739698], ![-162586, -294224, -108427, -31984, 444636], ![103025, 186519, 68798, 20236, -281887]]]
  hle1 := by decide   
  hle2 := by decide  


def P103P0 : CertificateIrreducibleZModOfList' 103 2 2 6 [68, 27, 1] where
 m := 1
 P := ![2]
 exp := ![1]
 hneq := by decide
 hP := by decide
 hlen := by decide
 htr := by decide
 bit := ![1, 1, 1, 0, 0, 1, 1]
 hbits := by decide
 h := ![[0, 1], [76, 102], [0, 1]]
 g := ![![[11, 50], [30, 18], [82, 56], [17], [98], [76, 1]], ![[0, 53], [59, 85], [12, 47], [17], [98], [49, 102]]]
 h' := ![![[76, 102], [20, 16], [89, 11], [33, 46], [46, 29], [85, 43], [0, 1]], ![[0, 1], [0, 87], [101, 92], [27, 57], [87, 74], [57, 60], [76, 102]]]
 hs := by decide
 hz := by decide
 hmul := by decide
 a := ![[], [64]]
 b := ![[], [20, 32]]
 hhz := by decide
 hhn := by decide
 hgcd := by decide

def PI103N0 : CertifiedPrimeIdeal' SI103N0 103 where
  n := 2
  hpos := by decide
  P := [68, 27, 1]
  hirr := P103P0
  hd := by decide
  hij := by decide
  hcard := by decide
  hneq := by decide
  hlen := by decide
  c := ![-53744, -28775, 104891, 17853, -246550]
  a := ![67, -259, 176, 49, -712]
  z := ![1, 0, 0, 0, 0]
  hpol := by decide
  g := ![52607, 141239, 104891, 17853, -246550]
  hcmem := by decide
  hpmem := by decide

lemma isPrimeI103N0 : Ideal.IsPrime I103N0 := CertifiedPrimeIdeal'.isPrime timesTableT_eq_Table rfl PI103N0 B_one_repr
lemma NI103N0 : Nat.card (O ⧸ I103N0) = 10609 := CertifiedPrimeIdeal'.idealNorm timesTableT_eq_Table PI103N0

def I103N1 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![20039, 8024, -32602, -9587, 133566]] i)))

def SI103N1: IdealEqSpanCertificate' Table ![![20039, 8024, -32602, -9587, 133566]] 
 ![![103, 0, 0, 0, 0], ![33, 1, 0, 0, 0], ![44, 0, 1, 0, 0], ![80, 0, 0, 1, 0], ![74, 0, 0, 0, 1]] where
  M :=![![![20039, 8024, -32602, -9587, 133566], ![-56218, -22221, 91169, 26825, -373434], ![156718, 63778, -255979, -75218, 1048974], ![-95478, -34948, 152060, 44893, -622134], ![59672, 24318, -97500, -28648, 399553]]]
  hmulB := by decide  
  f := ![![![1007, 7464, -9462, -1475, 29184]], ![![71, 2841, -3127, -562, 9966]], ![![1166, -1238, -505, 246, 162]], ![![2806, 5656, -10232, -1113, 29478]], ![![1062, 4234, -6122, -836, 18373]]]
  g := ![![![-76963, 8024, -32602, -9587, 133566], ![215085, -22221, 91169, 26825, -373434], ![-604772, 63778, -255979, -75218, 1048974], ![357414, -34948, 152060, 44893, -622134], ![-230368, 24318, -97500, -28648, 399553]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI103N1 : Nat.card (O ⧸ I103N1) = 103 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI103N1)

lemma isPrimeI103N1 : Ideal.IsPrime I103N1 := prime_ideal_of_norm_prime hp103.out _ NI103N1

def I103N2 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![2021, 806, -3284, -966, 13454]] i)))

def SI103N2: IdealEqSpanCertificate' Table ![![2021, 806, -3284, -966, 13454]] 
 ![![103, 0, 0, 0, 0], ![42, 1, 0, 0, 0], ![90, 0, 1, 0, 0], ![6, 0, 0, 1, 0], ![35, 0, 0, 0, 1]] where
  M :=![![![2021, 806, -3284, -966, 13454], ![-5656, -2263, 9200, 2706, -37688], ![15844, 6344, -25777, -7578, 105572], ![-9528, -3748, 15438, 4535, -63224], ![6032, 2416, -9814, -2886, 40199]]]
  hmulB := by decide  
  f := ![![![-15253, 35270, -16100, -2490, 76538]], ![![-7174, 16565, -7564, -1170, 35956]], ![![-19418, 44732, -20437, -3162, 97136]], ![![-15858, 36248, -16590, -2569, 78820]], ![![-7665, 17654, -8066, -1248, 38337]]]
  g := ![![![-1955, 806, -3284, -966, 13454], ![5478, -2263, 9200, 2706, -37688], ![-15342, 6344, -25777, -7578, 105572], ![9166, -3748, 15438, 4535, -63224], ![-5843, 2416, -9814, -2886, 40199]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI103N2 : Nat.card (O ⧸ I103N2) = 103 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI103N2)

lemma isPrimeI103N2 : Ideal.IsPrime I103N2 := prime_ideal_of_norm_prime hp103.out _ NI103N2

def I103N3 : Ideal O := Ideal.span (Set.range (fun i ↦ B.equivFun.symm (![![637, 772, -1763, -151, 4902]] i)))

def SI103N3: IdealEqSpanCertificate' Table ![![637, 772, -1763, -151, 4902]] 
 ![![103, 0, 0, 0, 0], ![81, 1, 0, 0, 0], ![31, 0, 1, 0, 0], ![66, 0, 0, 1, 0], ![97, 0, 0, 0, 1]] where
  M :=![![![637, 772, -1763, -151, 4902], ![-6482, 16761, -7862, -3326, 33294], ![6584, -99406, 94333, 19652, -312168], ![66192, -78818, -16502, 15725, -27984], ![6652, -31044, 22578, 6148, -80941]]]
  hmulB := by decide  
  f := ![![![1393171, -131016, 367695, 79397, -1415070]], ![![1106119, -104103, 292249, 63127, -1124784]], ![![428079, -40090, 112348, 24217, -432234]], ![![897510, -84514, 237320, 51275, -913416]], ![![1311905, -123304, 345983, 74691, -1331455]]]
  g := ![![![-4590, 772, -1763, -151, 4902], ![-40101, 16761, -7862, -3326, 33294], ![331237, -99406, 94333, 19652, -312168], ![83870, -78818, -16502, 15725, -27984], ![89969, -31044, 22578, 6148, -80941]]]
  hle1 := by decide   
  hle2 := by decide  

lemma NI103N3 : Nat.card (O ⧸ I103N3) = 103 := 
 ideal_norm_eq_prod' B _ _ (by decide) 0 0 (by decide) (ideal_eq_of_IdealEqSpanCertificate' timesTableT_eq_Table rfl SI103N3)

lemma isPrimeI103N3 : Ideal.IsPrime I103N3 := prime_ideal_of_norm_prime hp103.out _ NI103N3
def MulI103N0 : IdealMulLeCertificate' Table 
  ![![-14201, -5667, 23085, 6788, -94560]] ![![20039, 8024, -32602, -9587, 133566]]
  ![![-2638840387, -1052444391, 4288834344, 1261408746, -17569732770]] where
 M := ![![![-2638840387, -1052444391, 4288834344, 1261408746, -17569732770]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI103N1 : IdealMulLeCertificate' Table 
  ![![-2638840387, -1052444391, 4288834344, 1261408746, -17569732770]] ![![2021, 806, -3284, -966, 13454]]
  ![![-49427510200823, -19713092969081, 80333166173948, 23627156070294, -329094609172256]] where
 M := ![![![-49427510200823, -19713092969081, 80333166173948, 23627156070294, -329094609172256]]]
 hmul := by decide  
 g := ![![![![1, 0, 0, 0, 0]]]]
 hle2 := by decide  

def MulI103N2 : IdealMulLeCertificate' Table 
  ![![-49427510200823, -19713092969081, 80333166173948, 23627156070294, -329094609172256]] ![![637, 772, -1763, -151, 4902]]
  ![![103, 0, 0, 0, 0]] where
 M := ![![![-114892014041, -45822194113, 186730814899, 54920257037, -764965550824]]]
 hmul := by decide  
 g := ![![![![-1115456447, -444875671, 1812920533, 533206379, -7426850008]]]]
 hle2 := by decide  


def PBC103 : ContainsPrimesAboveP 103 ![I103N0, I103N1, I103N2, I103N3] where 
  Ip := by 
    intro i 
    fin_cases i 
    exact isPrimeI103N0
    exact isPrimeI103N1
    exact isPrimeI103N2
    exact isPrimeI103N3
  hPprod := by 
    simp only [← Fin.prod_ofFn]
    exact ideal_le_singleton_IdealMulLeChainCertificate timesTableT_eq_Table B_one_repr 103 (by decide) (𝕀 ⊙ MulI103N0 ⊙ MulI103N1 ⊙ MulI103N2)


lemma PB5356I2_primes (p : ℕ) :
  p ∈ Set.range ![67, 71, 73, 79, 83, 89, 97, 101, 103] ↔ Nat.Prime p ∧ 61 < p ∧ p ≤ 103 := by
  rw [← List.mem_ofFn']
  convert primes_range 61 103 (by omega)

def PB5356I2 : PrimesBelowBoundCertificateInterval O 61 103 5356 where
  m := 9
  g := ![3, 4, 2, 3, 2, 2, 2, 1, 4]
  P := ![67, 71, 73, 79, 83, 89, 97, 101, 103]
  hP := PB5356I2_primes
  I := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · exact ![I67N0, I67N1, I67N2]
    · exact ![I71N0, I71N1, I71N2, I71N3]
    · exact ![I73N0, I73N1]
    · exact ![I79N0, I79N1, I79N2]
    · exact ![I83N0, I83N1]
    · exact ![I89N0, I89N1]
    · exact ![I97N0, I97N1]
    · exact ![I101N0]
    · exact ![I103N0, I103N1, I103N2, I103N3]
  hC := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact PBC67
    · exact PBC71
    · exact PBC73
    · exact PBC79
    · exact PBC83
    · exact PBC89
    · exact PBC97
    · exact PBC101
    · exact PBC103
  N := fun i => by
    cases i
    rename_i i h
    interval_cases i
    · exact ![300763, 67, 67]
    · exact ![5041, 71, 71, 71]
    · exact ![389017, 5329]
    · exact ![493039, 79, 79]
    · exact ![47458321, 83]
    · exact ![704969, 7921]
    · exact ![912673, 9409]
    · exact ![10510100501]
    · exact ![10609, 103, 103, 103]
  hNz := by decide
  hN := fun i => by
    cases i
    rename_i i h
    interval_cases i 
    · dsimp ; intro j
      fin_cases j
      exact NI67N0
      exact NI67N1
      exact NI67N2
    · dsimp ; intro j
      fin_cases j
      exact NI71N0
      exact NI71N1
      exact NI71N2
      exact NI71N3
    · dsimp ; intro j
      fin_cases j
      exact NI73N0
      exact NI73N1
    · dsimp ; intro j
      fin_cases j
      exact NI79N0
      exact NI79N1
      exact NI79N2
    · dsimp ; intro j
      fin_cases j
      exact NI83N0
      exact NI83N1
    · dsimp ; intro j
      fin_cases j
      exact NI89N0
      exact NI89N1
    · dsimp ; intro j
      fin_cases j
      exact NI97N0
      exact NI97N1
    · dsimp ; intro j
      fin_cases j
      exact NI101N0
    · dsimp ; intro j
      fin_cases j
      exact NI103N0
      exact NI103N1
      exact NI103N2
      exact NI103N3
  β := ![I67N1, I67N2, I71N0, I71N1, I71N2, I71N3, I73N1, I79N1, I79N2, I83N1, I103N1, I103N2, I103N3]
  Il := ![[I67N1, I67N2], [I71N0, I71N1, I71N2, I71N3], [I73N1], [I79N1, I79N2], [I83N1], [], [], [], [I103N1, I103N2, I103N3]]
  hIl := by
      intro i
      cases i
      rename_i i h
      interval_cases i
      all_goals rfl
  hβ := by simp
